{
    "url": "https://slce.uic.edu/leadership/institute/",
    "title": "LeaderShape Institute | Student Leadership and Civic Engagement | University of Illinois at Chicago",
    "text": [
        "A Transitional Leaders Program",
        "The LeaderShape Institute is a four-day, three-night off-campus experience challenging participants to lead with integrity while working towards a vision grounded in their deepest values. Participants explore not only what they want to do, but who they want to be. Dynamic, challenging, and exciting, the week is intended to produce a breakthrough in the leadership capacity of participants—benefiting them individually, as well as their respective communities and the organizations they will go on to lead and serve in the future.",
        "This year's retreat, originally scheduled to take place on May 9-12, 2020, has been cancelled due to the spring 2020 semester changes due to the Coronavirus Disease 2019 (COVID-19) global pandemic.",
        "For more information and to apply for the Spring 2021 LeaderShape Institute, check back at a later date.",
        "Learn about our Leadership Retreat:",
        "Who is the Institute for?",
        "The LeaderShape Institute was created for individuals who are committed to taking their leadership to the next level and who want to make a significant impact on campus, in their communities, and in the world.",
        "How is the Institute different from other conferences and residential programs?",
        "Everyone who attends the Institute engages in the same activities and contributes to the same conversations. While the involvement of the individual is honored and expected, everything during the Institute is approached with a sense of community. Everyone is viewed as a learner and as a teacher. This belief is evident as the community is created through the contributions of everyone at the Institute, with time spent in meaningful conversation serving as its foundation. Unlike conferences, participants don’t only leave the retreat with a few tips and ideas. Graduates of the Institute experience a breakthrough in their leadership capacity.",
        "How will we spend our time during the Institute?",
        "Everything in the curriculum is anchored to four themes: community, inclusivity, integrity, and vision. Therefore the work that we do during the retreat is tied, in some way, to these concepts. We participate in large group activities, in small group exercises, in conversation with one another, and in personal reflection. We set out to discover our most deeply held values and greatest passions and how they can come together to give our lives and work purpose. We learn how developing a vision and plan of action can create lasting change. We reflect on how our personal styles and life experiences influence our leadership and our relationships. Those who graduate from the Institute leave as an agent of positive change in the world.",
        "(LeaderShape, http://leadershape.org/Institute/FAQ)",
        "Where does the Institute take place?",
        "UIC’s LeaderShape Institute is held at the Loyola University Retreat and Ecology Campus (LUREC) in Woodstock, Illinois. For more information regarding the facility, visit https://www.luc.edu/retreatcampus.",
        "How much does it cost to participate?",
        "Lucky for you, the LeaderShape Institute cost is covered by Student Leadership and Civic Engagement. Meaning, your transportation, housing, and food will all be provided to you at no cost. The only thing we ask is that you remain committed to attending upon submitting an application."