{
    "url": "https://slce.uic.edu/civic-engagement/participation/",
    "title": "Participation | Student Leadership and Civic Engagement | University of Illinois at Chicago",
    "text": [
        "Now that you're registered and informed, it's time to take action! Voting is the fundamental way we, as constituents, raise our voices and advocate for causes we care about. But, voting is not the only way one can participate in our democracy. Find events taking place on- and off-campus, volunteer for civic organizations or campaigns, and contact your elected officials as other ways to stay up-to-date with all things happening in our communities. Hearing from constituents like you makes a difference in how our elected officials prioritize their work and is just one of many ways we hold our elected officials accountable.",
        "It’s important that you have a plan set for how and when you will cast your vote. Be sure to have considered all aspects of the process; will you vote before or after school/work, will you go alone or with a peer, if you’re voting by mail or voting absentee, when/where will you drop off or mail your ballot? All of these questions should have an answer before you head off to vote. Remember, voting doesn’t need to be intimidating – nor is it meant to be – so, remember to have fun – this is what democracy looks like!",
        "Tab contents are cited from the Campus Vote Project and Fair Elections Center.",
        "You do not need any ID to vote early or on Election Day in Illinois. The only exception is for first-time mail-in registrants who failed to provide a driver’s license number, state ID number, or the last four digits of their Social Security Number.",
        "For acceptable forms of identification, visit: https://chicagoelections.com/en/when-you-need-id-to-vote.html",
        "Make a plan. Look up your voting site and hours at: https://ova.elections.il.gov/RegistrationLookup.aspx",
        "By Mail",
        "Early In-person",
        "Election Day",
        "Registering to Vote Does Not Affect Your:",
        "Will registering to vote in Illinois affect my driver’s license or car registration?",
        "In partnership with #VoteTogether, our team hosts a series of events during the span of early-voting on campus. These events/parties allow students the opportunity to share their thoughts on the upcoming elections, while playing games & activities, participating in the national campus democracy challenge, and getting free give-aways. Not to mention – at the top of every hour, we “Parade to the Polls” and collectively #VoteTogether as we make our voices heard at the polling booth!",
        "UIC was recognized as the “Most Engaged” campus by the All IN Campus Democracy Challenge for having one of the largest increases in student voter participation among colleges and universities in the 2016 election. In addition, the All IN Campus Democracy Challenge awarded UIC a bronze seal for achieving a student voting rate between 50%-59%. Read the article.",
        "As part of the Challenge, UIC participated in the National Study of Learning, Voting, and Engagement, which showed an increase in UIC student voting rates of nearly 14% between the 2012 and 2016 elections. See the full report for details on voter registration, voter participation, and comparisons to other institutions across the country.",
        "UIC is also designated as a Voter Friendly Campus by the Campus Vote Project and NASPA – Student Affairs Administrators in Higher Education. The program supports campuses in developing plans to facilitate student civic and electoral engagement, and awards the designation to institutions who have successfully committed to promoting democratic engagement on campus."
    ],
    "out_links": [
        "https://slce.uic.edu/",
        "http://uic.edu/",
        "https://slce.uic.edu/leadership/",
        "https://slce.uic.edu/leadership/ignite/",
        "https://slce.uic.edu/leadership/forge/",
        "https://slce.uic.edu/leadership/flashpoint/",
        "https://slce.uic.edu/leadership/leadershipuic/",
        "https://slce.uic.edu/leadership/institute/",
        "https://slce.uic.edu/leadership/leadership-book-club/",
        "https://slce.uic.edu/leadership/workshops/",
        "https://slce.uic.edu/leadership-service-and-civic-engagement-at-home/",
        "https://slce.uic.edu/leadership/awards/",
        "https://slce.uic.edu/service/",
        "https://slce.uic.edu/service/service-leaders/",
        "https://slce.uic.edu/service/welcome/",
        "https://slce.uic.edu/service/mondays/",
        "https://slce.uic.edu/service/give/",
        "https://slce.uic.edu/service/mlk-day-service/",
        "https://slce.uic.edu/service/uic-day/",
        "https://slce.uic.edu/service/expo/",
        "https://slce.uic.edu/service/president/",
        "https://slce.uic.edu/service/hours/",
        "https://slce.uic.edu/service/post-an-opportunity/",
        "https://slce.uic.edu/civic-engagement/",
        "https://slce.uic.edu/civic-engagement/registration/",
        "https://slce.uic.edu/civic-engagement/education/",
        "https://slce.uic.edu/civic-engagement/results/",
        "https://slce.uic.edu/about/",
        "https://slce.uic.edu/about/staff-directory/",
        "https://slce.uic.edu/about/contact/",
        "https://slce.uic.edu/about/donate/",
        "https://slce.uic.edu/about/feedback-suggestions/",
        "http://service.uic.edu/",
        "http://connect.uic.edu/",
        "http://involvement.uic.edu/",
        "https://vcsa.uic.edu/",
        "http://maps.uic.edu/",
        "https://today.uic.edu/uic-wins-national-award-for-student-voter-engagement",
        "http://clce.uic.edu/about/donate/",
        "https://slce.uic.edu/events/",
        "http://vote.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}