{
    "url": "https://slce.uic.edu/civic-engagement/education/",
    "title": "Education | Student Leadership and Civic Engagement | University of Illinois at Chicago",
    "text": [
        "Taking the time to educate yourself about candidates, social issues, and other ballot measures is a crucial step in becoming civically engaged. Use these resources to help you get started.",
        "“As the start of the fall 2018 semester approached, we decided that the best day to roll out this new initiative would be the first day of classes. Although risky, we decided to add an element of surprise in the middle of our campus’ quad and watched the reactions unfold organically. Our risk was a success! The process of constructing the ball-pit was enough to stir attention. However, once assembled, the interest grew stronger and the conversations did not stop.” – NASPA LEAD Initiative",
        "BallotReady",
        "BallotReady aggregates content from candidates’ websites, social media, press, endorsers and board of elections for comprehensive, nonpartisan information about the candidates and referendums on your ballot. They link everything back to its original source so voters can verify any piece of information, and they make every effort to confirm details with the candidates themselves, giving them the opportunity to share even more information.",
        "ballotready.org",
        "Vote Smart",
        "Vote Smart’s mission is to provide free, factual, unbiased information on candidates and elected officials to ALL Americans. Vote Smart compiles voting records, biographical and contact information, issue positions, interest group ratings, public statements, and campaign finances about political candidates. You enter your address or the particular candidate’s name at the top of the page to search.",
        "votesmart.org",
        "Vote for Judges",
        "The VoteForJudges.org website reports the results of 13 bar groups, which receive information about and evaluate candidates’ performances and recommend whether they are qualified to be, or remain, a judge. The Alliance of Bar Associations (Alliance) includes 12 bar associations which work collaboratively, but publish independent results. The site also includes the judicial evaluation results of the Chicago Bar Association, and the judicial endorsements of the Chicago Tribune.",
        "voteforjudges.org",
        "League of Women Voters",
        "With the Illinois Voter Guide, provided by the League of Women Voters of Illinois (LWVIL), which is a nonpartisan political organization that encourages informed and active participation in government, you can explore the background and opinions of every candidate on your actual ballot, and save your choices as you go so you can then bring your saved ballot to the polls. Enter your address into the guide to learn more about what will be on your ballot.",
        "illinoisvoterguide.org",
        "Using a ball-pit as the framework behind this civic-dialogue series, we explore controversial topics and issues in a fun way. Students have the opportunity to jump in and spark up a conversation with a peer on issues that interest them, their points of views on political matters, and their desires to provoke change where they find it necessary.",
        "Student Leadership and Civic Engagement is a proud sponsor of UIC’s Constitution Day, hosted by the Department of Political Science in partnership with other UIC civic organizations. Every September, the Constitution Day program includes a lecture from a distinguished civic scholar, a series of engagement opportunities offered by departments around campus, and the chance to network with students and professionals interested in government, law, and society.",
        "Student Leadership and Civic Engagement understands the importance of access to reliable voter information. Each election, we host Ballot Parties – in partnership with ballotready.org – for students to explore the people and issues on their ballot in an inviting, collaborative space. In the past, we have hosted these events with the Honors College, Richard J. Daley Library, Campus Recreation, and the Latino Cultural Center in order to spread our reach. Students have the opportunity to create a mock ballot, which they can then take with them as a reference at the polling place. Don’t forget, it’s a party after all – so music and food is always provided!",
        "Want to host your own? Contact us at slce@uic.edu and we will get the party planning started!"
    ],
    "out_links": [
        "https://slce.uic.edu/",
        "http://uic.edu/",
        "https://slce.uic.edu/leadership/",
        "https://slce.uic.edu/leadership/ignite/",
        "https://slce.uic.edu/leadership/forge/",
        "https://slce.uic.edu/leadership/flashpoint/",
        "https://slce.uic.edu/leadership/leadershipuic/",
        "https://slce.uic.edu/leadership/institute/",
        "https://slce.uic.edu/leadership/leadership-book-club/",
        "https://slce.uic.edu/leadership/workshops/",
        "https://slce.uic.edu/leadership-service-and-civic-engagement-at-home/",
        "https://slce.uic.edu/leadership/awards/",
        "https://slce.uic.edu/service/",
        "https://slce.uic.edu/service/service-leaders/",
        "https://slce.uic.edu/service/welcome/",
        "https://slce.uic.edu/service/mondays/",
        "https://slce.uic.edu/service/give/",
        "https://slce.uic.edu/service/mlk-day-service/",
        "https://slce.uic.edu/service/uic-day/",
        "https://slce.uic.edu/service/expo/",
        "https://slce.uic.edu/service/president/",
        "https://slce.uic.edu/service/hours/",
        "https://slce.uic.edu/service/post-an-opportunity/",
        "https://slce.uic.edu/civic-engagement/",
        "https://slce.uic.edu/civic-engagement/registration/",
        "https://slce.uic.edu/civic-engagement/participation/",
        "https://slce.uic.edu/civic-engagement/results/",
        "https://slce.uic.edu/about/",
        "https://slce.uic.edu/about/staff-directory/",
        "https://slce.uic.edu/about/contact/",
        "https://slce.uic.edu/about/donate/",
        "https://slce.uic.edu/about/feedback-suggestions/",
        "http://service.uic.edu/",
        "http://connect.uic.edu/",
        "http://involvement.uic.edu/",
        "https://vcsa.uic.edu/",
        "http://maps.uic.edu/",
        "http://clce.uic.edu/about/donate/",
        "https://slce.uic.edu/events/",
        "http://vote.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}