{
    "url": "https://uic.galaxydigital.com/covid19-opportunities",
    "title": "UIC Service Opportunities",
    "text": [
        "Greater Chicago Food Depository - Volunteers aged 18-60 are needed to support our COVID-19 response. Volunteering is an essential service during Illinois' \"Stay-at-Home\" order.",
        "La Casa Norte - La Casa Norte is accepting catered meals, grocery donations, non-perishable goods, and monetary donations. Volunteers can also reach out to volunteer@lacasanorte.org to sign up to volunteer in our Fresh Market Pantry in partnership with Lakeview Pantry.",
        "Lawrence Hall - The Lawrence Hall youth and families of the DCFS, Foster Care, Transitional Living, and residential youth are in need of some supplies and items. Lawrence Hall would love if some volunteers can assemble care packages for them. Please reach out directly to schedule a drop off time.",
        "By The Hand - Write encouraging notes, assemble care packages and more.",
        "Lincoln Park Community Services - LPCS is accepting prepared meals, catered meals, grocery donations, non-perishable goods, and monetary donations. Volunteers are to refrain from cooking inside our facilities.",
        "American Red Cross - Give Blood during a time where the healthcare system is in need.",
        "Lakeview Pantry - Lakeview Pantry is in need of food and monetary donations as well as volunteers to deliver food boxes.",
        "Top Box Foods - Help deliver food to residents who are food insecure.",
        "My Block, My Hood, My City - Donate goods, give a monetary donation, and volunteer to call a senior.",
        "Sittercity - If you are a childcare provider, volunteer to watch the children of Chicago's first responders and essential workers.",
        "UIC School of Public Health - students and alumni are needed for volunteer opportunities involving COVID-19 testing, phone screenings, and data entry, in support of health care, local health department efforts, and the community.",
        "Catholic Charities of the Archdiocese - Volunteers are needed to pack food at pantries.  If you are not in a high-risk category and are willing to help, please email Andrew McKernin at amckernin@catholiccharities.net. Protective gear provided. Health protocols enforced.",
        "Illinoishelps.net - If you are a medical student or in the medical field, find volunteer opportunities in the city that can utilize your skill set!",
        "PADS Emergency Shelter - In order to meet the increased demand for services and provide more space for social distancing during the COVID-19 outbreak, PADS is opening up a 24/7 emergency shelter at Warren Township Park (17801 W. Washington St. Gurnee, IL 60030).",
        "Make a Mask - Through the citywide drive, residents can make and donate homemade cloth masks that will be provided to homeless shelters, community health clinics, essential public sector workers, and other organizations to prevent outbreaks among the City’s most high-risk residents, which data has shown to be vulnerable residents on Chicago’s South and West Side communities. This drive lasts until May 16, 2020!",
        "Illinois State Museum - ISM is requesting personal stories, written works, artwork, photos, or photos of objects from the people of Illinois to document life during the pandemic. The Museum is collecting residents' submissions for preservation in its digital archive via its new online tool at https://bit.ly/347wTle. Additionally, ISM will share some of the stories and photos on its social media platforms and in its online exhibition.",
        "As advised from serve.illinois.gov",
        "Donate. The long-term impact of COVID-19 on the nonprofit sector has the potential to be severe. Your support of front-line organizations caring for vulnerable populations is urgently needed now, while donations are also needed in the long-term to all social impact organizations to weather the long-term consequences of this crisis and our collective recovery.",
        "Complete the Census. The census is now available online. Census data directs billions of dollars of funding into communities each year, and Illinois is at risk of losing significant funding and other impacts. Do your part while you’re at home and be counted!",
        "Check-in on your neighbors through call or text. As more and more people experience isolation, we encourage you to call and check in on your neighbors, especially those who may not have support networks or adequate resources. It’s easy to feel overwhelmed right now but building connections and empathy can go a long way in reducing stress. Calling and texting is a good example of responsible social distancing. “CAP” is a great way to remember your neighbors:",
        "C – Check on your neighbors (through call or text)A – Assess needs and assist when possibleP – Protect self and neighbors by adhering to social distancing guidelines",
        "Multiple organizations are utilizing virtual volunteers. Take a look at this article to see nonprofits and public organizations that you can help from your home!",
        "serve.illinois.gov - Find up to date information on how to stay involved in Illinois",
        "NBC Chicago - A list of local nonprofits that need help amid the COVID-19 Pandemic",
        "Chicago Cares - Up to date volunteer opportunities in Chicago",
        "HandsOn Suburban Chicago - Up to date and ongoing opportunities for students in suburban Chicago",
        "chi.gov/coronavirus - Stay up to date with COVID-19 in Chicago and see other ways to serve in the city",
        "UIC School of Public Health - a library of resources with fact sheets in a diverse array of languages, CDC resources, health and wellness strategies, guidance for businesses and employers resources for workers and more."
    ],
    "out_links": [
        "http://slce.uic.edu/",
        "https://publichealth.uic.edu/about/novel-coronavirus-information/covid-19-volunteer-opportunities/",
        "https://publichealth.uic.edu/uic-covid-19-public-health-response/covid-19-resources/"
    ]
}