{
    "url": "https://slce.uic.edu/news-stories/nicolas-robledo-named-newman-civic-fellow/",
    "title": "Nicolas Robledo Named Newman Civic Fellow | Student Leadership and Civic Engagement | University of Illinois at Chicago",
    "text": [
        "\"UIC Student Honored with National Civic Fellowship\"",
        "Nicolas Robledo says his neighborhood on Chicago’s Southeast Side is similar to many towns across the U.S. that are still dealing with the impact of deindustrialization, crime and lack of investment.",
        "“Our stories are, in many ways, the same. We need to bring more equitable economic development to our neighborhoods, but even before that, to build community and help people develop the confidence to get involved. If we can do that, we can solve any problem,” he said.",
        "Robledo, a third-year finance major at the University of Illinois at Chicago, believes these issues can make residents, particularly local youth, feel powerless, so he’s spearheading community- and campus-based efforts focused on engagement and empowerment.",
        "“My parents migrated to Chicago from the Mexican states of Durango and Michoacán in the late 1980s and early 1990s,” said Robledo, who credits his parents for sharing their interest in community building and politics. “I want to see my neighborhood be a vibrant and welcoming place for everyone and thankfully there’s always been someone there to guide me.”",
        "His works were recently rewarded when Campus Compact, a national nonprofit coalition of more than 1,000 colleges and universities, named him among 262 students nationwide to its 2019-2020 Newman Civic Fellowship cohort.",
        "The fellowship will provide Robledo, who was nominated by UIC Chancellor Michael Amiridis, with a variety of learning and networking opportunities, including a national conference of Newman Civic Fellows in partnership with the Edward M. Kennedy Institute for the U.S. Senate. Exclusive scholarship and post-graduate opportunities are also offered.",
        "As a freshman, he interned with Participatory Budgeting Chicago, an initiative of UIC’s Great Cities Institute that helps local residents vote on how public money is spent. While interning with the initiative back home in Chicago’s 10th Ward, he learned the importance of a shared space and platform for community members to connect, but he felt that not enough residents, particularly youth, were civically engaged.",
        "Last year, with some guidance from the Obama Foundation’s Community Leadership Corps, he partnered with other civic-minded youth to establish the Southeast Youth Alliance. Focused on providing youth a central forum to build community and exchange ideas, the group has hosted events at libraries and schools with local high school and college students, and also aims to link youth to internship and volunteer opportunities.",
        "“We’re in the beginning stages right now and are trying to start a conversation on what can be done in the community, get youth input and connect youth to each other,” he said. “Our mission is to develop the next generation of community leaders on the Southeast Side.”",
        "To expand access to higher education, he is a coordinator with YES APPLY ILLINOIS!, a student-led coalition that is lobbying the university administration to remove conviction history questions from the undergraduate application.",
        "Robledo is also an active member of the Roosevelt Institute, a national student policy organization. As part of the group’s UIC chapter, he works with peers on forming and advocating for progressive policy changes on the local and campus level, with topics ranging from economic development to health care policy.",
        "“It’s an organization where you can take ownership of policy projects that matter to you,” he said. “We have so many great projects going on right now: expanding access to feminine hygiene products on campus, distributing neighborhood inclusivity statements in Pilsen, expanding access to Chicago’s Large Lots program to renters, and many others.”",
        "His other campus activities are as a member of UIC Business Scholars, a four-year leadership development program; an ambassador for the College of Business Administration; a student senator for the UIC Senate, an academic legislative body; and vice president of OneWorld Journal, a UIC student publication that addresses global issues and affairs.",
        "Robledo, who graduated from Jones College Prep in 2016, received the President’s Award Program-Honors Scholarship, which is the Honors College’s most prestigious award and covers four-year tuition and housing for exemplary incoming first-year students. Since arriving on campus he has enjoyed the UIC community’s diversity, activism and spirit to make positive civic changes.",
        "“Everyone has a story that impacted what they are studying or why they chose to come to UIC,” he said. “The key to community work is hearing other people’s stories and trying to understand where they are coming from, sharing your own story, being confident about what you went through, and see how you can work to connect with others.”",
        "The Campus Compact fellowship provides a variety of learning and networking opportunities, including a national conference of Newman Civic Fellows in partnership with the Edward M. Kennedy Institute for the U.S. Senate. Exclusive scholarship and post-graduate opportunities are also offered.",
        "The Newman Civic Fellowship program, which is named in tribute to Campus Compact co-founder Frank Newman, is supported by KPMG Foundation and Newman’s Own Foundation.",
        "Original Story: https://today.uic.edu/uic-student-honored-with-national-civic-fellowship"
    ],
    "out_links": [
        "https://slce.uic.edu/",
        "http://uic.edu/",
        "https://slce.uic.edu/leadership/",
        "https://slce.uic.edu/leadership/ignite/",
        "https://slce.uic.edu/leadership/forge/",
        "https://slce.uic.edu/leadership/flashpoint/",
        "https://slce.uic.edu/leadership/leadershipuic/",
        "https://slce.uic.edu/leadership/institute/",
        "https://slce.uic.edu/leadership/leadership-book-club/",
        "https://slce.uic.edu/leadership/workshops/",
        "https://slce.uic.edu/leadership-service-and-civic-engagement-at-home/",
        "https://slce.uic.edu/leadership/awards/",
        "https://slce.uic.edu/service/",
        "https://slce.uic.edu/service/service-leaders/",
        "https://slce.uic.edu/service/welcome/",
        "https://slce.uic.edu/service/mondays/",
        "https://slce.uic.edu/service/give/",
        "https://slce.uic.edu/service/mlk-day-service/",
        "https://slce.uic.edu/service/uic-day/",
        "https://slce.uic.edu/service/expo/",
        "https://slce.uic.edu/service/president/",
        "https://slce.uic.edu/service/hours/",
        "https://slce.uic.edu/service/post-an-opportunity/",
        "https://slce.uic.edu/civic-engagement/",
        "https://slce.uic.edu/civic-engagement/registration/",
        "https://slce.uic.edu/civic-engagement/education/",
        "https://slce.uic.edu/civic-engagement/participation/",
        "https://slce.uic.edu/civic-engagement/results/",
        "https://slce.uic.edu/about/",
        "https://slce.uic.edu/about/staff-directory/",
        "https://slce.uic.edu/about/contact/",
        "https://slce.uic.edu/about/donate/",
        "https://slce.uic.edu/about/feedback-suggestions/",
        "http://service.uic.edu/",
        "http://connect.uic.edu/",
        "http://involvement.uic.edu/",
        "https://vcsa.uic.edu/",
        "http://maps.uic.edu/",
        "https://today.uic.edu/uic-student-honored-with-national-civic-fellowship",
        "http://clce.uic.edu/about/donate/",
        "https://slce.uic.edu/events/",
        "http://vote.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}