{
    "url": "https://financialaid.uic.edu/faq/",
    "title": "FAQ | Student Financial Aid and Scholarships | University of Illinois at Chicago",
    "text": [
        "FAQ",
        "Yes, an application is required for this program. No additional documentation is required.",
        "If you have been selected to receive the UIC COVID 19 Emergency Grant, please follow the below steps to access your application:",
        "For upload instructions, please click here: https://docs.financialaid.uic.edu/docs/PDF_upload_guide.pdf",
        "$1,000 for Spring Semester. Due to funding limitations, awards will be made on a first-come, first-served basis.",
        "Yes, you must provide your application to the Office of Student Financial Aid and Scholarships via the Student Portal by 5/8/2020. Incomplete applications will be denied. Applications submitted after 5/8/2020 will not be considered.",
        "No, approval of your COVID-19 Emergency Grant will not affect the amount or eligibility for other financial aid that you have already received.",
        "Please note that each student can receive ONLY ONE Emergency Grant per semester from UIC. If you have received a previous Emergency Grant from your department or another UIC source, we will review your eligibility to determine which grant provides the most assistance to you.",
        "No, this grant will not be applied by the University towards any outstanding balance you may owe UIC.   Nor will it decrease any payments owed against your payment plan, or the amount due. You can use it to cover any expenses of your choice that may have resulted due to impacts COVID-19. You will not need to report how you used this funding.",
        "We will begin making disbursements to student accounts after the 5/8/2020 deadline. Emergency Grants will be provided via direct deposit. You must be enrolled in direct deposit to receive a UIC Emergency Grant.",
        "Yes, we plan to extend COVID-19 Emergency Grants during the Summer 2020 Semester but the amount of funding is limited.",
        "No additional application is required at this time; however, funding is limited and will be based on your FASFA received date.",
        "Up to $1,000 for Summer Semester",
        "You will receive a revised award letter listing the COVID-19 Emergency Grant Award in your financial aid information.",
        "No, approval of your COVID-19 Emergency Grant will not affect the amount or eligibility for other financial aid that you have already received.",
        "Please note that each student can receive ONLY ONE Emergency Grant per semester from UIC. If you have received a previous Emergency Grant from your department or another UIC source, we will review your eligibility to determine which grant provides the most assistance to you.",
        "No, this grant will not be applied by the University towards any outstanding balance you may owe UIC.   Nor will it decrease any payments owed against your payment plan, or the amount due. You can use it to cover any expenses of your choice that may have resulted due to impacts COVID-19. You will not need to report how you used this funding.",
        "We will begin making disbursements to student accounts after the final add/drop period for Summer semester, 6/19/2020.",
        "A: Students should submit their Free Application for Federal Student Aid (FAFSA) as soon as possible after the October 1st availability date. Late FAFSA submission can affect eligibility for some financial aid programs.",
        "A: Students and parents who are eligible to use the IRS Data Retrieval Tool (IRS DRT) can access it from within the Free Application for Federal Student Aid (FAFSA) on the student or parent finances pages:",
        "If you use the IRS DRT to transfer your tax return information from the IRS, the information will not display on your FAFSA. For your protection, the answer to each question is replaced with “Transferred from the IRS.”",
        "The IRS DRT allows you to securely transfer original IRS tax return information, but not Form 1040X amended tax return information. If you filed a Form 1040X amended tax return, you may need to work with your Financial Aid Administrator to ensure that any information you corrected on Form 1040X is reflected in the amounts transferred to your FAFSA.",
        "A: For many students, only a completed Free Application for Federal Student Aid (FAFSA) is necessary to receive a financial aid notification. Students are notified via e-mail if we need additional documentation to process financial aid. Students can also view financial aid requirements from the Student Self-Service website under the Finances tab on the UIC Portal: http://my.uic.edu.",
        "A: We recommend submitting outstanding financial aid requirements as soon as possible. The deadline for submitting most outstanding financial aid documents is two weeks before the end of classes for each semester. The specific deadlines can be found on the SFAS Calendar.",
        "A: You can click here to view the PDF Upload Guide.",
        "A: Only students who have completed a Free Application for Federal Student Aid (FAFSA) and submitted any required documentation will receive a UIC financial aid notification.",
        "FAFSA processing time can take 2-3 weeks before a financial aid notification is issued. Students will receive e-mail notifications when their financial aid notification is available online.",
        "If you submitted your FAFSA over two weeks ago and still have not received a financial aid notification, you may have outstanding requirements. Students may need to submit Dependent/Independent Verification Worksheets, US Citizenship documents, Selective Service status, etc. Students will receive e-mail notifications from SFAS requesting additional documentation or they can view requirements at www.my.uic.edu under the “Finances” tab.",
        "Financial aid may be cancelled for students who fail to meet the Satisfactory Academic Progress (SAP).",
        "A: New/transfer students who submitted a FAFSA and any required documentation requested by SFAS will begin to receive financial aid notifications around the middle of March each year. Students with outstanding documentation requests may receive an unofficial estimated financial aid notification that is subject to change until all requirements are satisfied. The SFAS calendar will show published deadlines for submitting financial aid documentation.",
        "A: Continuing students who have submitted their FAFSA and any additional documentation will begin to receive financial aid notifications around early June each year.",
        "A: If a student or family member recently lost a job or experienced financial hardship due to death, divorce, or unexpected medical expenses, they may submit a Change of Financial Situation request. Students must complete the form in its entirety and provide required documentation. Submitting a Change of Financial Situation request does not guarantee an increase in aid.",
        "A: Students apply for federal student loans by completing the Free Application for Federal Student Aid (FAFSA) each academic year",
        "A: Students can accept/decline/reduce any federal loan offered to them through the online financial aid notification. Students access the financial aid notification through the UIC Portal at http://my.uic.edu under the Finances tab. The first page of the financial aid notification will show the Cost of Attendance, Need Calculation and Award Summary. Click the button at the bottom of the page that says “Continue.” On the page that follows, students will report their fall/spring enrollment hours and any other financial resources. By clicking “Continue” on the second page, students come to the final page of the financial aid notification where they choose to accept or decline loans. If a student wishes to accept less than the amount being shown, they can enter a partial amount in a small text box to the right of the accept/decline drop-down menu. After accepting the terms and conditions and submitting a decision, any specific requirements for disbursement will be displayed.",
        "A: The deadline for accepting federal loans in any given semester is generally about two weeks before the end of that semester. Tuition and fee billing due dates are prior to the due dates to accept loans.",
        "A: Yes, previously declined loans can still be accepted. Students must access the financial aid notification online at http://my.uic.edu under the Finances tab. At the bottom of the first page, click the button that says “Request Changes.” On the page that follows, students can submit a request in the text box to have loans re-offered. Click “Continue” to submit the request.",
        "Students will receive a revised financial aid notification after requested changes are updated. Typed requests should be as specific as possible.",
        "A: Students who accepted a partial amount of the federal loans are still able to request an increase in loans. Students must access the financial aid notification online at http://my.uic.edu under the Finances tab. At the bottom of the first page, click the button that says “Request Changes.” On the page that follows, students can submit a request in the text box to have loans increased. Click “Continue” to submit the request.",
        "Students will receive a revised financial aid notification after requested changes are updated. Typed requests should be as specific as possible.",
        "A: Students can reduce loans at any time during the semester if they borrowed more than necessary. Students must access the financial aid notification online at http://my.uic.edu under the “Finances” tab. At the bottom of the first page, click the button that says “Request Changes.” On the page that follows, students can submit a request in the text box to reduce a loan. Click “Continue” to submit the request.",
        "Students will receive an e-mail notification after requested changes are updated. Typed requests should be as specific as possible.",
        "Important: When a loan has already disbursed to a student account, any reduction in funds will be billed back the student’s account and create a balance owed to UIC. Students who received a refund from loans will need to use that refund to pay the resulting balance. Students who used loans to pay tuition and fees but did not receive refunds will be responsible for paying their loan reduction balance.",
        "A: The difference between Subsidized and Unsubsidized loans is the accrual of interest. Subsidized loans will NOT accrue interest while the student remains enrolled in school at least half-time (6 or more credit hours for undergraduate students). Interest on Unsubsidized loans will accrue from the date of disbursement. More detailed information about both Subsidized and Unsubsidized loans can be found here.",
        "A: The payment of financial aid is called disbursement. Financial aid disburses no earlier than 10 days before the beginning of a semester. Disbursement dates and other important dates and deadlines can be found on the SFAS Calendar.",
        "After the initial payment of financial aid, additional payments occur regularly throughout the semester on Wednesday and Friday mornings.",
        "A: Federal Direct loans (Stafford Subsidized/Unsubsidized and Parent/Grad PLUS* loans) and Campus-based loans (Perkins, HPSL and Nursing Student loans) have mandatory requirements. Federal Direct loans require Entrance Counseling and a Master Promissory Note (MPN) before disbursement. Parents approved for a Parent PLUS loan must complete only an MPN. All federal loan requirements can be completed on the Department of Education’s website at http://studentaid.gov. For all campus-based loans, students must have completed a Promissory Note available on the Heartland ECSI website.",
        "Important: Loans will not disburse for students enrolled less than half time, even if all requirements are complete. Half time is 6 or more credit hours for undergraduate and professional students and 5 or more credit hours for graduate students.",
        "*Graduate students who accepted a PLUS are subject to credit approval. An undisbursed PLUS loan may have been denied due to adverse credit. Students can view a PLUS loan denial notification by logging in to http://studentaid.gov and clicking the “View Your Documents” and then”PLUS Correspondence” link from the menu.",
        "A: The Free Application for Federal Student Aid (FAFSA) serves as your application for all federal, state, and institutional grants. Be sure to include UIC’s federal school code (001776) so we receive your application.",
        "A: Yes – students admitted during the spring term will receive full consideration for all institutional grants.",
        "A: Potentially! Please see our UIC Access to Excellence Special Extension section for more information on potential grant funding when you have exhausted your total paid semesters.",
        "A: Potentially! Please see our UIC Access to Excellence Special Extension section for more information on potential grant funding when you have exhausted your total paid semesters.",
        "A: We have combined the UIC Access to Excellence Program and UIC Gateway Grant Program, into the new, UIC Opportunity Grant. For more information, please see our UIC Opportunity Grant section.",
        "A: The UIC Opportunity Grant pays a maximum of $3700 per student annually. For more information please see our UIC Opportunity Grant section.",
        "A: Every year ISAC, the state agency that administers the MAP Grant Program, determine a FAFSA submission deadline for MAP eligibility. Any student who submits their initial FAFSA after the state MAP deadline will not be eligible to receive it for that upcoming academic year. UIC’s priority deadline to submit the FAFSA is February 15th. These deadlines are subject to change. UIC encourages students file as soon as possible after the FAFSA is available on October 1.",
        "The MAP Grant is a need-based award. Financial need is determined using the data submitted on the FAFSA. If there are changes to that data, such as household size and/or household income, it can impact MAP Grant eligibility.",
        "There are limits to MAP Grant eligibility based on grade level and total credit hours. Those details can be found at the bottom of the State Grant page here.",
        "The MAP Grant is available only to Illinois residents and/or the dependents of Illinois residents. If a student or their parents (for dependent students) no longer reside in Illinois, they will no longer be eligible for the MAP Grant.",
        "A: The MAP Grant pays according to the number of enrolled credit hours. Students enrolled in 15 or more credit hours will receive 100% of the MAP Grant award on their financial aid notification. Enrollment below 15 credit hours causes a prorated MAP disbursement. If the number of credit hours changes after the initial disbursement of the MAP Grant, by adding or dropping credit hours, the funds already paid to a student account may be adjusted. Information about how enrollment affects the MAP Grant and is available here.",
        "A: MAP and Pell Grants will be adjusted if students enroll part-time. Loans, work-study, and UIC aid may be adjusted if the reduced enrollment also reduces a student’s financial need. Students must enroll at least half time to receive institutional grants and loans.",
        "A: All students have a Cost of Attendance that is shown on their financial aid notification. Per federal regulations, total financial aid resources cannot be greater than the Cost of Attendance. If an additional scholarship or tuition waiver results in an over-award in excess of the Cost of Attendance, any federal or private loans are subject to reduction or cancellation so that total aid does not exceed the Cost of Attendance.",
        "A: Federal Work Study (FWS) Federal Work Study (FWS) refers to the money used to pay a student for hours worked at a part-time job on campus. The America Reads program offers a limited number of positions as off-campus tutors with the Chicago Public Schools. UIC and the federal government fund the FWS program. FWS shown on a financial aid notification is the total amount a student may earn for the academic year. Students are responsible for finding on-campus employment. To search for a FWS job, visit the Office of Student Employment website.",
        "A: Federal Work Study (FWS) is a need-based program, so students must be eligible for FWS based on their FAFSA data. Students interested in FWS should submit a request online through their financial aid notification.",
        "FWS funding is limited to undergraduate students, and not all requests for funding are granted. Requests are reviewed in the order they are submitted.",
        "A: Students may freely add/drop courses until the 10th day of the semester. If a course is dropped during the add/drop period, the total number of credit hours is reduced which may result in an adjustment of tuition and fees along with eligibility for certain types of aid. Students who received a refund based upon higher enrollment may need to repay funds. For information regarding how enrollment affects the most common types of financial aid, please visit this link.",
        "A: Withdrawing from a course or courses after the add/drop period (not a full withdrawal from a semester) does not affect current term aid or enrollment hours; however, students receive a grade of “W” for the course(s) they withdrew from. Withdrawals can impact future aid eligibility by lowering course completion ratios. See the SAP Policy for information about course completion ratio requirements.",
        "A: When a student withdraws from all of their classes in a given semester, two separate processes occur. The Office of the Registrar prorates tuition and some fees (according to their withdrawal policy and refund schedule), and Student Financial Aid and Scholarships (SFAS) prorates financial aid as required by federal regulations. An explanation of this proration process can be found here.",
        "A: All students who are degree seeking and have a FAFSA on file for the current academic year will be considered for financial aid during the summer semester. Summer financial aid eligibility is evaluated upon enrollment. For more information, view the Summer Financial Aid section found here.",
        "A: The only grant that is available for use during the summer is the Federal Pell Grant. Students are only eligible for summer Pell if they did not receive their full Pell award for the fall and spring semesters. Since the Pell Grant pays 100% of the scheduled award when a student takes 12 or more credit hours in a semester, it means that summer Pell will only be available for a student who took fewer than 12 credit hours for the fall and/or spring semesters and did not receive their full award. Most students are only eligible for loans during the summer semester.",
        "A: For graduate assistants, SFAS can only post and pay waivers after a qualifying employment appointment is processed by university HR confirming that a student meets their eligibility criteria found here; between 25%-67% employment covering at least 91 continuous days of the semester (41 in summer). Graduate Assistants must also be enrolled in a minimum of 8 credit hours (3 for summer) for a waiver to be paid.",
        "For students awarded Board of Trustees (BOT) Tuition Waivers or Graduate College Waivers (as part of a fellowship, traineeship, etc.), these waivers are reported to SFAS by the Graduate College each semester. If a waiver has not paid, it may not have been reported yet. BOT and Grad College Waivers require 12 or more credit hours during the fall and spring semesters and 6 credit hours in the summer, unless specifically indicated otherwise.",
        "For Child of Employee Tuition Waivers, the parent/employee must complete the online application and the student must submit a Benefit Utilization Record to our office. Specific details and policies are found on NESSIE here.",
        "To ask about a different type of waiver, please contact us.",
        "A: Financial aid can be cancelled due to failure to meet Satisfactory Academic Progress (SAP) requirements. Undergraduate, graduate and professional students must maintain a 2.0 GPA and complete at least 67% of their attempted credit hours to meet SAP requirements. SAP evaluations occur at the conclusion of every spring semester, in mid-May, and students who are cancelled are notified by e-mail.",
        "If financial aid is cancelled from failure to meet SAP requirements students may submit an appeal which will be reviewed by a committee. Submitting an appeal does not guarantee that aid will be reinstated.",
        "Outside of an approved appeal, students can regain financial aid eligibility by successfully completing enough coursework to bring their GPA and course completion ratio at or above the required minimums. If students believe they now meet the SAP requirements but aid has been cancelled, they must notify SFAS directly and submit the SAP Review Request Form.",
        "Appeal deadlines are as follows:",
        "Summer – June 1",
        "Fall – October 15",
        "Spring – March 15",
        "SAP_Appeal_Evaluation_Form",
        "A: http://www.uic.edu/depts/oar/financial_matters/tuition.html",
        "A: Students can waive the Campus Care health insurance by completing an online waiver form available through the Campus Care office website. www.campuscare.uic.edu",
        "A: http://paymybill.uillinois.edu/payment/PaymentPlan",
        "A: Click on the USFSCO link for more information.",
        "A: The 1098-T form is made available to students online each year by the USFSCO office. https://paymybill.uillinois.edu/resources/understanding_my_1098-t"
    ],
    "out_links": [
        "https://financialaid.uic.edu/",
        "http://uic.edu/",
        "https://financialaid.uic.edu/cost/",
        "https://financialaid.uic.edu/cost/cost-attendance-coa/",
        "https://financialaid.uic.edu/cost/estimating-efc/",
        "https://financialaid.uic.edu/cost/financial-need/",
        "https://financialaid.uic.edu/cost/paying-your-bill/",
        "https://financialaid.uic.edu/aid-process/",
        "https://financialaid.uic.edu/aid-process/illinois-rise-act/",
        "https://financialaid.uic.edu/aid-process/eligibility/",
        "https://financialaid.uic.edu/aid-process/apply/",
        "https://financialaid.uic.edu/aid-process/verification/",
        "https://financialaid.uic.edu/aid-process/award-notification/",
        "https://financialaid.uic.edu/aid-process/disbursement/",
        "https://financialaid.uic.edu/aid-process/summer-financial-aid/",
        "https://financialaid.uic.edu/aid-process/sap-policy-appeal/",
        "https://financialaid.uic.edu/aid-process/special-circumstances/",
        "https://financialaid.uic.edu/aid-process/rights-responsibilities/",
        "https://financialaid.uic.edu/aid-process/semester-withdrawal/",
        "https://financialaid.uic.edu/aid-process/ferpa/",
        "https://financialaid.uic.edu/aid-process/calendar-list/",
        "https://financialaid.uic.edu/types-of-aid/",
        "https://financialaid.uic.edu/types-of-aid/grants/",
        "https://financialaid.uic.edu/types-of-aid/scholarships/",
        "https://financialaid.uic.edu/types-of-aid/waivers-assistantships/",
        "https://financialaid.uic.edu/types-of-aid/loans/",
        "https://financialaid.uic.edu/types-of-aid/student-employment/",
        "https://financialaid.uic.edu/types-of-aid/study-abroad/",
        "https://financialaid.uic.edu/types-of-aid/veterans/",
        "https://financialaid.uic.edu/types-of-aid/pre-paid-tuition/",
        "https://financialaid.uic.edu/forms/",
        "https://financialaid.uic.edu/forms/2019-2020-forms/",
        "https://financialaid.uic.edu/forms/2020-2021-forms/",
        "https://financialaid.uic.edu/faq/glossary-of-terms/",
        "https://financialaid.uic.edu/faq/contact-us/",
        "https://financialaid.uic.edu/consumer-information/",
        "https://financialaid.uic.edu/consumer-information/academic-programs/",
        "https://financialaid.uic.edu/consumer-information/department-education-complaint-process/",
        "https://financialaid.uic.edu/consumer-information/financial-aid-information/",
        "https://financialaid.uic.edu/consumer-information/semester-withdrawals/",
        "https://financialaid.uic.edu/consumer-information/general-institutional-information/",
        "https://financialaid.uic.edu/consumer-information/health-safety-security/",
        "https://financialaid.uic.edu/consumer-information/intercollegiate-athletic-program-participation-rates-financial-support-data/",
        "https://financialaid.uic.edu/consumer-information/student-outcomes/",
        "https://financialaid.uic.edu/consumer-information/voter-registration/",
        "https://financialaid.uic.edu/consumer-information/notice-availability-institutional-financial-aid-information/",
        "https://financialaid.uic.edu/consumer-information/contact-information-assistance-obtaining-institutional-financial-aid-information/",
        "http://scholarships.uic.edu/",
        "http://connect.uic.edu/",
        "http://sa.uic.edu/",
        "http://maps.uic.edu/",
        "https://my.uic.edu/uPortal/f/welcome/normal/render.uP",
        "http://financialaid.uic.edu/aid-process/calendar-list/",
        "https://my.uic.edu/common/",
        "http://financialaid.uic.edu/aid-process/sap-policy-appeal/",
        "http://financialaid.uic.edu/aid-process/special-circumstances/",
        "http://financialaid.uic.edu/aid-process/disbursement/",
        "http://financialaid.uic.edu/types-of-aid/grants/institutional-grants/",
        "http://financialaid.uic.edu/types-of-aid/grants/state-grants/",
        "http://financialaid.uic.edu/cost/financial-need/",
        "http://financialaid.uic.edu/cost/cost-attendance-coa/",
        "http://financialaid.uic.edu/types-of-aid/student-employment/",
        "http://studentemployment.uic.edu/",
        "https://registrar.uic.edu/tuition/",
        "http://registrar.uic.edu/registration/policies_procedures.html",
        "https://registrar.uic.edu/financial_matters/refund_schedule.php",
        "http://financialaid.uic.edu/consumer-information/semester-withdrawals/",
        "http://financialaid.uic.edu/aid-process/summer-financial-aid/",
        "https://hr.uic.edu/hr-staff-managers/compensation/minima-for-graduate-appointments/",
        "http://financialaid.uic.edu/types-of-aid/waivers-assistantships/",
        "http://financialaid.uic.edu/faq/contact-us/",
        "http://financialaid.uic.edu/forms/",
        "http://campuscare.uic.edu/",
        "https://medicine.uic.edu/financial-aid/",
        "https://dos.uic.edu/studentveteranaffairs.shtml",
        "http://www.emsenterprise.uic.edu/faappointment/",
        "https://registrar.uic.edu/student_records/enrollment-degree-verification-course-descriptions",
        "https://docs.financialaid.uic.edu/npcalc.htm",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}