{
    "url": "https://policies.uic.edu/educational-policy/student-academic-grievance-policy/",
    "title": "Student Academic Grievance Policy | UIC Policy on Policies | University of Illinois at Chicago",
    "text": [
        "Policy Number: Not assigned a number.",
        "Policy Title: Student Academic Grievance Policy",
        "Unit Responsible for Policy: Provost and Vice Chancellor for Academic Affairs",
        "Effective Date: April 27, 2017",
        "Policy Statement: All UIC Students have the right to appeal adverse academic decisions or actions through a formal University of Illinois at Chicago (UIC) Academic Grievance process that is fair, takes a reasonable amount of time, and provides the Student with requisite levels of due process. Across UIC, the Academic Grievance process will include at least three stages: (1) the Student makes a sincere attempt to resolve their complaint informally with the Respondent (except in complaints or grievances that include complaints of unlawful discrimination or sexual misconduct, where an attempt at informal resolution is not required); (2) the Student/Grievant files a formal Academic Grievance with the appropriate Administrative Officer (AO) or their designee, which the AO attempts to resolve; and (3) if the Grievant is not satisfied with the AO’s decision, she/he/they may appeal the decision to the appropriate Grievance Officer (GO). Decisions of the GO are final and cannot be appealed except in matters where a claim of sexual misconduct or unlawful discrimination has been made by the Student in the Academic Grievance and reviewed by the AO/GO, or where the Student has alleged that a significant procedural error(s) occurred in the Academic Grievance process that could substantially affect the outcome of the decision. In these cases, the Chancellor or their designee will review the record and issue a decision. The Chancellor’s decision is final and no further appeal is available.",
        "Depending on the type of decision that is being grieved, the GO, or their designee, may make a decision independently or may convene a hearing. For Academic Grievances of serious adverse decisions (Level 1) that will prevent a Student from continuing their progress toward a degree in good academic standing, GOs are required to convene a three-person Hearing Panel and conduct a Formal Hearing. For Level 2 academic grievances, related to academic decisions that will not prevent a Student from continuing their progress toward a degree in good academic standing, all grievances may be considered, except those involving grades or evaluations that are entirely based on a subjective judgment by a University agent, unless the grievance involves an allegation of unlawful discrimination or sexual misconduct.",
        "To guide the implementation of this policy, a procedures document will outline the expectations for each stage, the responsibilities of the AO and GO, and timelines. The Grievant will be notified about the process for filing a formal Academic Grievance, deadlines for each stage, and the opportunity to appeal the AO’s decision if the Academic Grievance is not resolved at that stage. If there is a claim of unlawful discrimination and/or sexual misconduct, the Office for Access and Equity will review the complaint, conduct an investigation of the unlawful discrimination and/or sexual misconduct as appropriate, determine findings, and advise the AO and GO throughout the process.",
        "Many of UIC’s colleges will use this policy and the associated procedures as written. However, to allow for flexibility across UIC, colleges may create college-level policies and procedures that follow the requirements of the university policy and may further extend or enhance the process in accordance with related accreditation or professional standards. Students must be notified about college-level academic grievance procedures through student handbooks and/or through program websites. These college-specific academic grievance procedures will be submitted to the Provost/Vice Chancellor for Academic Affairs for review and approval.",
        "For undergraduate and professional students, all three stages of the process will remain in their academic college with the appeal to the Chancellor, as described above.  For graduate students filing Level 1 academic grievances, the first two stages of the process (informal and AO) will reside in the academic college, with the third stage (GO) moving to the Graduate College. For graduate students filing Level 2 academic grievances, all three stages of the process will remain in their academic college. Again, for all cases filed by graduate students, the appeal to the Chancellor is limited as set forth above. All colleges must report the number of academic grievances filed to the Provost/Vice Chancellor for Academic Affairs annually, as well as any college-specific modifications to the student academic grievance procedures implemented in the previous year.",
        "Reason for Policy: Although student academic grievance procedures have been in force since 2007, UIC has not previously issued a formal policy indicating that students have the right to grieve adverse academic decisions. The goals with the current policy are to ensure that (1) a single person makes a single decision (e.g., the policy and updated procedures prohibit the Administrative Officer from serving as Grievance Officer or as a member of the Hearing Panel); and (2) to allow the process to vary for undergraduate, graduate, and professional students to accommodate various college structures or college-level procedures that supplement the UIC procedures.",
        "Minority Impact Statement: This policy does not have any disproportionate or unique impact on UIC’s minority students, staff, or faculty.",
        "Who Should Read the Policy:  All students, faculty, staff, and administrators.",
        "Definitions:",
        "Procedures:  View the Student Academic Grievance Procedures.",
        "Forms: View the forms related to the Student Academic Grievance Procedures.",
        "Related Laws, Regulations, Statutes, and Policies: 2007 Student Academic Grievance Procedures"
    ],
    "out_links": [
        "https://policies.uic.edu/",
        "http://uic.edu/",
        "https://policies.uic.edu/uic-policy-library/",
        "https://policies.uic.edu/uic-policy-library/academic-and-enrollment-services/",
        "https://policies.uic.edu/uic-policy-library/access-and-equity/",
        "https://policies.uic.edu/uic-policy-library/budget-and-financial-administration/",
        "https://policies.uic.edu/uic-policy-library/communication-and-branding/",
        "https://policies.uic.edu/uic-policy-library/facilities-and-safety/",
        "https://policies.uic.edu/uic-policy-library/global/",
        "https://policies.uic.edu/uic-policy-library/human-resources/",
        "https://policies.uic.edu/uic-policy-library/research-2/",
        "https://policies.uic.edu/uic-policy-library/student-affairs/",
        "https://policies.uic.edu/educational-policy/",
        "https://policies.uic.edu/non-uic-policy-resources/",
        "https://policies.uic.edu/policy-development/",
        "https://policies.uic.edu/policy-development/policy-on-policies/",
        "https://policies.uic.edu/policy-development/procedures/",
        "https://policies.uic.edu/policy-development/forms/",
        "https://policies.uic.edu/policy-development/faqs/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}