{
    "url": "https://registrar.uic.edu/student_records/enrollment-degree-verification-course-descriptions",
    "title": "Enrollment, Degree Verification or Course Descriptions | UIC Office of the Registrar",
    "text": [
        "Do you need to show that you are enrolled, were previously enrolled, or have earned a degree from the University of Illinois at Chicago?",
        "Due to social distancing mandates related to COVID-19, the Office of the Registrar will be closed to walk-in traffic until further notice. Requests may be submitted using the Online Certificate Request Form and will be emailed back to you or a third party.",
        "",
        "* Certificate Request Form",
        "Student may send necessary verification forms and requests to the Office of the Registrar form completion. Per term there is a limit of 4 requests without a charge being assessed, after the 4th request there will be a $5 charge assessed for each additional form. We accept checks or money orders for payment, if paying with cash exact change is required.",
        "We are located at the Student Services Building, Office of the Registrar, Suite 1200. For parking and directions see https://admissions.uic.edu/book-visit/directions-parking-and-places-stay.",
        "* Please Note: we do not do same day service. If you come in you can either pick up your request in 2 days or we can mail it out.",
        "The office of the Registrar will provide, upon written request, a certified copy of a diploma. A certified copy of a diploma is quality copy of the original that has been stamped as a true copy with the Registrar signature and University Seal.",
        "Please mail or drop off (Student Service Building; Office of the Registrar; 1200 West Harrison, Chicago, IL 60607) the photocopy and complete a walk-in request form at the front desk. Certified copies of diplomas are $5.00 each.",
        "The Council on Teacher Education (CTE) processes all requests for verification of completed teacher and school service personnel certificate programs.  Send your \"verification form*\" to the following address.",
        "*When making a request for verification without an institutional form, contact the CTE Office at (312) 355-0714 or by email at sryan27@uic.edu. For a letter to verify coursework beyond your degree, please contact Ana Valenta, (312) 355-0575 or by email at agarci5@uic.edu. Visit the CTE website for information about teacher certification programs.",
        "If you are a current or past UIC student and require the completion of the Common Application Transfer Registrar Report, please forward that paper form to the Office of the Registrar, and we will complete the section of the form that pertains to our office. Additional information requested on the form will be forwarded to the appropriate office. Please be sure to include with your request the mailing address for each institution(s) to which you will to have the form(s) sent. Requests must be submitted in person or by postal mail.",
        "Requests sent through the mail should be addressed to:",
        "For walk-in requests, we are located at the Student Services Building, Office of the Registrar, Suite 1200.  For parking and directions see https://admissions.uic.edu/book-visit/directions-parking-and-places-stay .",
        "Students occasionally need complete descriptions of courses taken at the University of Illinois at Chicago for foreign degree validations or acceptance of credits at another institution. The fee for course descriptions is $5.00 for each request.",
        "Please fill out, print, SIGN and send in the course description request form. We accept checks, money orders for payment.",
        "Recent academic bulletins may be found through the Campus catalog website or at the University of Illinois main library archives section.",
        "If the course description supplied in the academic bulletin is not sufficient, please contact the appropriate department for a specific course syllabus.",
        "The University of Illinois has authorized the National Student Clearinghouse (NSC) to provide enrollment and degree verification information for all students in attendance or who have completed a degree.",
        "Current domestic and international students, with an active SSN and mailing address recorded in our system, can obtain a free enrollment verification from the National Student Clearinghouse (Enterprise ID and password authentication is required). Please note that verification of enrollment should be available approximately 5 business days after the 10th day of the semester.",
        "Current Student and Alumni who wish to obtain a letter verifying degree awarded can submit their requests via mail, fed-ex, in-person or online (Degree Letter Request System). Per term there is a limit of 4 requests without a charge being assessed, after the 4th request there will be a $5 charge assessed. We accept checks or money order for payment, if paying with cash exact change is required.",
        "In Person:",
        "Student Service Building;",
        "Office of the Registrar;",
        "1200 West Harrison",
        "Please Note: we do  not do same day service if you come in you can either pick up your request in 2  days or we can mail it out.",
        "Online:",
        "For 5 or more requests a fee is required. Request must be submitted either by mail or in person, see above for details.",
        "The University of Illinois at Chicago has authorized the National Student Clearinghouse to provide verification of degrees and enrollment for UIC alumni.  Data is being sent to the Clearinghouse on a regular schedule, allowing employers and agencies to verify official degree information in compliance with the Family Educational Rights and Privacy Act (FERPA).",
        "For more information, instructions, and applicable fees for the National Student Clearinghouse can be found at:",
        "Students, state agencies of Illinois, or employers needing verification for a students’ residency/ fellowship/ internship may submit the request to the Graduate Medical Education Department.",
        "You may contact them at 312-996-2933 or mail your request to:",
        ""
    ],
    "out_links": [
        "https://registrar.uic.edu/index.html",
        "https://registrar.uic.edu/student_records/transcripts/",
        "https://registrar.uic.edu/registration/",
        "https://registrar.uic.edu/contact/",
        "http://www.uic.edu/",
        "https://registrar.uic.edu/current_students/",
        "https://registrar.uic.edu/current_students/calendars/",
        "https://registrar.uic.edu/financial_matters/",
        "https://registrar.uic.edu/student_records/",
        "https://registrar.uic.edu/campus_policies/",
        "https://registrar.uic.edu/uic_faculty_staff/",
        "https://registrar.uic.edu/uic_faculty_staff/classroom_scheduling/",
        "https://registrar.uic.edu/uic_faculty_staff/faculty_self_service/",
        "https://registrar.uic.edu/uic_faculty_staff/calendars/",
        "https://registrar.uic.edu/uic_faculty_staff/classes.html",
        "https://registrar.uic.edu/uic_faculty_staff/grades/",
        "https://registrar.uic.edu/uic_faculty_staff/registration/",
        "https://registrar.uic.edu/uic_faculty_staff/student_records_policy/",
        "https://admissions.uic.edu/undergraduate",
        "https://aes.uic.edu/aes-staff/",
        "https://registrar.uic.edu/student_records/certification-request/",
        "https://admissions.uic.edu/book-visit/directions-parking-and-places-stay",
        "http://cte.uic.edu/",
        "https://catalog.uic.edu/ucat/",
        "https://registrar.uic.edu/contact/form_current_students.html",
        "https://registrar.uic.edu/sitemap"
    ]
}