{
    "url": "https://admissions.uic.edu/undergraduate/tuition-financial-aid",
    "title": "Tuition & Financial Aid | UIC Admissions",
    "text": [
        "What's included in your Tuition & Fees?",
        "Learn more about Residency Status",
        "Excellence — within reach",
        "A college education is a great investment. The good news is that UIC is committed to making college affordable by guiding you through the financial aid process. Last year, UIC undergraduates received nearly $200 million in financial aid and scholarships.",
        "Learn about the types of aid available, eligibility requirements, how to apply and more from the Office of Student Financial Aid and Scholarships.",
        "Go to OSFA",
        "View the Net Price Calculator",
        "The best kind of financial aid — the kind you don't have to pay back!",
        "UIC offers many financial resources for incoming, transfer and continuing students, including scholarships and grants. Last year, nearly two-thirds of UIC students received grants or scholarships.",
        "Once you complete the UIC application, you will automatically be considered for most university and college scholarships and awards; no additional steps are necessary. Your application is then reviewed to determine if any awards are a good fit.",
        "Remember, some scholarships evaluate financial need, so be sure complete the Free Application for Federal Student Financial Aid (FAFSA) to determine what aid you may be eligible to receive.",
        "The Honors College offers numerous both merit-based and need-based scholarships for incoming freshmen, transfer and continuing students. To be considered for Honors College scholarships, you must complete an Honors College application in addition to your UIC application.",
        "In addition to scholarships and tuition assistance offered directly from the ROTC programs, Illinois residents can apply for state ROTC tuition waivers. Each ROTC program has 40 of these waivers active during each semester. This assistance is available to freshmen and sophomores without a military obligation. Prospective and current ROTC cadets may contact the appropriate ROTC branch to obtain information about their scholarships:",
        "Several offices and departments across campus offer scholarships to both new and continuing UIC students.",
        "Also, take a look at fastweb.com for scholarships not affiliated with UIC.",
        "Outstanding Illinois students from underrepresented groups may qualify for the President's Award Program. High school records and performance, standardized test scores and other materials determine a student’s eligibility. Qualifying underrepresented students are defined as those that fall under one or more of these categories:",
        "The Honors College offers a full range of scholarships for incoming first-year and transfer students. Scholarships are awarded based on the competitiveness of a student’s admissions application and the strength of their interview, an additional requirement for the college. (Supplemental Honors College application is required).",
        "College- and program-specific awards are also available. These opportunities are offered after a student’s application for admission has been reviewed. Examples include:",
        "UIC Business Scholars may receive scholarships based on unmet need. Students must apply to UIC, select a major within the UIC College of Business Administration, and complete the supplemental honors college application to be considered.",
        "Several departments and colleges offer scholarships upon review of the application.",
        "This is an merit-based tuition award for high-achieving nonresident applicants. To be considered, applicants are required to be U.S. citizens or permanent residents who do not qualify for in-state tuition. Students’ grade point average, standardized test scores, and major selection are taken into consideration.",
        "Transfer students to UIC may be eligible for the following scholarships once they are enrolled at UIC:",
        "Eligible students are contacted during the fall semester with application and deadline information. See Honors College for details.",
        "Many on- and off-campus organizations offer scholarships to current UIC students. Of particular note is the Office of Scholarships, which awards multiple awards to currently enrolled UIC students every year.",
        "1200 West Harrison Street",
        "Chicago, IL 60607-7161",
        "Phone: (312) 996-4350Contact UIC Admissions",
        "1220 West Harrison Street",
        "Chicago, IL 60607-7161",
        "Phone: (312) 413-1726",
        "Office of Undergraduate Admissions (MC 018)",
        "University of Illinois at Chicago",
        "1200 West Harrison Street, Suite 1100",
        "Chicago, IL 60607-7161 Contact Undergraduate Admissions",
        "",
        "The graduate and professional application process is paperless. Please do not mail materials unless expressly requested.Contact Graduate and Professional Admissions",
        "Copyright © 2020 The Board of Trustees of the University of Illinois"
    ],
    "out_links": [
        "https://admissions.uic.edu/",
        "https://admissions.uic.edu/explore-uic",
        "https://nexus.admissions.uic.edu/",
        "https://admissions.uic.edu/apply-now",
        "https://admissions.uic.edu/undergraduate",
        "https://registrar.uic.edu/tuition/undergrad/",
        "https://admissions.uic.edu/undergraduate/tuition-financial-aid/tuition-fees",
        "https://admissions.uic.edu/undergraduate/tuition-financial-aid/residency",
        "https://financialaid.uic.edu/",
        "https://financialaid.uic.edu/aid-process/apply/",
        "https://docs.financialaid.uic.edu/npcalc.htm",
        "https://admissions.uic.edu/undergraduate/requirements-deadlines/deadlines/priority-scholarship-date",
        "https://honors.uic.edu/scholarships/",
        "https://honors.uic.edu/admissions/first-year/",
        "https://financialaid.uic.edu/types-of-aid/scholarships/",
        "https://snap.uic.edu/",
        "https://las.uic.edu/advising/honors-scholarships/",
        "http://business.uic.edu/undergraduate-programs/uic-business-scholars",
        "http://www.honors.uic.edu/scholarships/",
        "https://aes.uic.edu/programs/presidents-award-program.html",
        "https://honors.uic.edu/resources/scholarships/",
        "https://business.uic.edu/undergraduate-programs/uic-business-scholars/",
        "http://scholarships.uic.edu/",
        "https://financialaid.uic.edu/aid-process/illinois-rise-act/",
        "https://scholarships.uic.edu/",
        "https://admissions.uic.edu/graduate-professional",
        "https://admissions.uic.edu/contact-admissions",
        "https://admissions.uic.edu/undergraduate/contact-undergraduate-admissions",
        "https://admissions.uic.edu/graduate-professional/contact-graduate-and-professional-admissions",
        "http://www.uic.edu/",
        "http://uic.edu/",
        "https://policies.uic.edu/uic-policy-library/access-and-equity/nondiscrimination-policy-statement/",
        "https://admissions.uic.edu/sitemap",
        "https://disabilityresources.uic.edu/",
        "https://admissions.uic.edu/Shibboleth.sso/Login?target=https%3A%2F%2Fadmissions.uic.edu%2F%3Fq%3Dshib_login%2Fnode%2F5",
        "http://disabilityresources.uic.edu/"
    ]
}