{
    "url": "https://catalog.uic.edu/ucat/colleges-depts/applied-health-sciences/",
    "title": "College of Applied Health Sciences < University of Illinois at Chicago",
    "text": [
        "Nationally prominent in research, service, and education, the College of Applied Health Sciences (AHS) is a leader in applied rehabilitation and disability studies. The college houses five departments and one program (hereafter referred to as units):",
        "A variety of degree programs is offered in the areas of biomedical visualization, disability studies, health informatics, health information management, nutrition, kinesiology, occupational therapy, physical therapy, and rehabilitation sciences. The college offers five bachelor’s degrees, seven master’s degrees, and five doctoral programs.",
        "The research efforts of the multidisciplinary faculty are directed toward new and applied knowledge in aging and disability studies, health information sciences, and health promotion and disease prevention. The college’s research and educational programs are substantially strengthened by the unification of the academic departments with their clinical counterparts in the University of Illinois at Chicago Medical Center.",
        "The mission of the College of Applied Health Sciences is to prepare professionals for the advancement of health and of healthcare and its related aspects of human development, performance, and adaptation. The principal means through which this mission is accomplished is by actively integrating teaching, research, and service. The college’s first priority is the education of its students, which includes fostering their capacity for compassion, dedication, and advocacy. As a major component of an urban land grant institution, the college is committed to diversity, community needs, and the creation and dissemination of new knowledge.",
        "The college encourages and accommodates the participation of persons with disabilities in all of its programs.",
        "Each of the college’s professional programs is accredited by the appropriate accrediting agency and most serve as national models in education. For information on specific accreditation, refer to the appropriate program in the following sections of this catalog.",
        "The College of Applied Health Sciences houses both traditional undergraduate BS programs as well as professional BS programs. Students can pursue an undergraduate professional course of study in either the Health Information Management program or the Nutrition Coordinated Program. The undergraduate professional course of study is arranged in two phases: completion of preprofessional course work and two years of professional course work at UIC leading to professional baccalaureate degrees in health information management or nutrition. Prerequisite courses equivalent to those offered by the University of Illinois at Chicago may be completed at any accredited college or university. The college’s professional programs coordinate classroom instruction with clinical experience in a variety of healthcare facilities in Chicago and surrounding areas throughout the two years of the program. The two-year, campus-based professional programs begin with the fall semester of each academic year. Completion of professional program graduation requirements culminating in a baccalaureate degree qualifies the graduate to take the appropriate national certification examinations. Information about the examinations will be provided by the academic program during matriculation. Professional certification is necessary and in most cases mandatory for practice. A Health Information Management online degree completion program is also available for students who have successfully completed the program prerequisites and earned an associate's degree in a healthcare discipline, information technology, or business.",
        "Traditional BS programs are offered in Disability and Human Development, Kinesiology, Nutrition Science, and Rehabilitation Sciences, and students are admitted to these programs at the freshman and transfer levels. The BS in Disability and Human Development, BS in Health Information Management, BS in Kinesiology, BS in Nutrition, and BS in Rehabilitation Sciences degrees are awarded. The Disability and Human Development, online Health Information Management, Kinesiology, Nutrition Science, and Rehabilitation Sciences programs admit students for the fall and spring terms. The on-campus Health Information Management and Nutrition Coordinated programs admit students for the fall term only.  The Kinesiology program helps prepare students for professional studies at the graduate level in areas such as physical therapy, nutrition, medicine, dentistry, and nursing, or direct entry into careers in the health and fitness industries. There are two concentrations available in the Kinesiology program: Movement Science or Exercise Science and Health Promotion. Both programs encourage undergraduate participation in research; there are ample opportunities for undergraduates to become engaged in exciting research projects in state-of-the-art laboratories that are under the direction of world-class scientists. The Exercise Science and Health Promotion concentration includes an optional internship. The Nutrition Science program is an accredited “Didactic Program in Dietetics,” enabling graduates to apply for a dietetic internship at sites approved by the American Dietetic Association. The BS in Disability and Human Development offers a comprehensive curriculum that fosters understandings of disability as a social, political, historical, cultural, and environmental phenomenon, not just a medical or biological condition.  The BS in Rehabilitation Sciences is an interdisciplinary social science degree offered through the College of Applied Health Sciences that is a unique integration of the research and educational expertise of all of the college’s departments.",
        "The professional occupational therapy program is offered at the master’s (MS in Occupational Therapy) and doctoral (OTD, Doctor of Occupational Therapy) levels. The professional physical therapy entry-level program is offered through the Doctor of Physical Therapy (DPT) program. For more information about these programs, contact the Department of Occupational Therapy at (312) 996-6901 or the Department of Physical Therapy at (312) 996-1501 or visit the college website.",
        "Students planning to pursue a professional degree in Occupational Therapy or Physical Therapy should consult the Preprofessional Studies section of the catalog for information on recommended courses.",
        "To earn a College of Applied Health Sciences degree from UIC, students need to complete university, college, and department degree requirements. University and college degree requirements for all College of Applied Health Sciences students are outlined below. Students should consult the major department section for additional degree requirements.",
        "Since the catalog is published in alternate years, changes to the graduation requirements may be announced in an online format. If requirements change, continuing students in AHS and those whose attendance at UIC has been interrupted for no more than two years, may continue to meet those requirements in effect at the time of their initial registration or may choose to complete the revised requirements. Students who return to UIC after an absence of more than two years are responsible for meeting the requirements of the university and college as well as the major or curriculum in effect at the time of the student’s reenrollment. For all students, however, if courses originally required are no longer offered or if external accrediting or certifying agencies modify their requirements, the college or department will specify course substitutes.",
        "The College of Applied Health Sciences semester hour requirement varies by degree program.",
        "General Education at UIC is designed to serve as a foundation for lifelong learning. Students are required to complete a minimum of 24 semester hours in the General Education Core with at least one course from each of the following categories:",
        "For a description and a list of courses for each General Education Core category, students should consult the General Education section of the catalog. Information on meeting the General Education requirements for each degree program is provided in the College of Applied Health Sciences department sections.",
        "Applied Health Sciences students meet the requirement by achieving a passing grade in ENGL 160 and ENGL 161.",
        "All first-year students enrolled in the College of Applied Health Sciences are required to participate in a first-year seminar course. First-year seminar courses include AHS 100, AHS 101, and KN 100.",
        "At least 9 hours of the elective course work taken by students in the Kinesiology curriculum must be taken at the 300- or 400-level. Nutrition and Health Information Management students follow a prescribed curriculum.",
        "Candidates for a bachelor’s degree from the College of Applied Health Sciences must earn the last 30 semester hours of credit in enrollment residence uninterrupted by any work at another institution. Concurrent attendance at the University of Illinois at Chicago and another collegiate institution or enrollment during the summer at another institution, when approved by the student’s college, does not interrupt the UIC enrollment residence requirement for graduation. A student must complete at least one-half of the course work required for their major field, excluding collateral course requirements, in enrollment residence at the University of Illinois at Chicago. The major course work completed in enrollment residence must include 12 hours at the advanced level. Students enrolled in professional programs, Health Information Management, and Nutrition, must complete all of their professional course work at the University of Illinois at Chicago. Upon successful completion of a proficiency examination, exceptions may be made to the major requirement for students in the Health Information program who are currently Registered Health Information Technicians (RHIT).",
        "Work taken at the Springfield and Urbana-Champaign campuses of the University of Illinois does not satisfy enrollment residence requirements. Credit earned through proficiency examinations including the College Level Examination Program (CLEP), UIC extension courses, and Urbana-Champaign distance-learning courses does not apply toward the minimum 30-semester-hour enrollment residence requirement. Study abroad and distance-learning courses that have been approved by the student’s major department and by the college are not considered an interruption of enrollment residence for students.",
        "The Nutrition—Coordinated Program is a full-time, day program. The Disability and Human Development, Kinesiology, Nutrition Science, and Rehabilitation Sciences programs can be completed on a part-time basis. The Health Information Management program is available on a full- or part-time basis. The campus-based program is a day program with classes from morning to early afternoon. An online program is also available in Health Information Management. Enrollment is limited. Although health information technology course credits do not count toward the required 60 semester or 90 quarter hours of prerequisites, an RHIT can attempt to competency test out of the specific courses during the junior year.",
        "Certain academic programs may require a minimum grade of C in selected, specific courses or a higher overall GPA. Students are informed of such requirements in writing at the beginning of the first term they are registered in the college (through program handbooks). All candidates for a degree must have a GPA of at least 2.00/4.00 for all UIC credits counted for graduation requirements and at least 2.00 for the combined transfer and UIC credits counted for graduation requirements. A minimum GPA of 2.00/4.00 for all courses in the major field is also required. Some academic programs within the college require a higher GPA for graduation. Refer to the student handbook for each program’s specific requirements.",
        "Students declare their intent to graduate online using the my.UIC portal. The deadline for submission of the application for graduation is the end of the third week (fall and spring) or second week (Summer Session 2) of the term in which graduation is sought. Failure to submit the request at this time may delay the awarding of the degree. A final review will be made following the close of the term. If a student has satisfactorily completed all the degree requirements, the student’s name will be placed on the official degree list.",
        "Students in the Department of Kinesiology and Nutrition must also declare their intent to graduate with their academic advisor at least one term prior to their intended graduation date.",
        "When transferring credit from a community college, a student must earn at least 60 hours from UIC or another approved four-year college or university. Students are obligated to report all work from other institutions once enrolled at UIC.",
        "Continuing students who would like to take a course at another institution must petition their academic department for approval prior to enrolling in the course. In some cases, transfer credit will not be applied toward a student’s degree if a student fails to obtain prior approval.",
        "The following statements define general academic policies of the College of Applied Health Sciences, and include the procedures involving determination of academic probation and failure and channels for appeal of adverse decisions. Students should refer to their program handbooks for specific information.",
        "Students registered for 12 or more hours during the fall or spring terms or for 6 hours or more in the summer term are considered full time. Students must request permission from their academic department to exceed 18 hours of enrolled course work.",
        "It is required that students of the college achieve a minimum level of academic performance, which is assessed periodically during the prescribed course of study. Academic programs may require a minimum grade of C in selected, specific courses or a higher overall GPA. A student who receives a grade below C in any required academic course may be dismissed from the program, even if not on academic probation. Refer to the specific program student handbook. Students must complete all required courses with a grade of C or better prior to progression to clinical instruction and practice. Courses with clinical components must be completed with a satisfactory grade.",
        "Academic probation designates the status of a student who has failed to attain the acceptable level of academic achievement as defined below:a",
        "Academic probation at UIC cannot be removed by course work from other colleges or universities, including programs of the Springfield and Urbana-Champaign campuses.",
        "Removal from probationary status is dependent upon earning a minimum 2.00 grade point average (GPA) during the probation semester, and in subsequent terms achieving a grade point average that is sufficiently above 2.00 to maintain a GPA of 2.00 or above for all work in the College of Applied Health Sciences.",
        "The probation guidelines described above apply to the Disability and Human Development, Kinesiology, Nutrition Science, and Rehabilitation Sciences. Students enrolled in the Nutrition Coordinated program must maintain a 3.00/4.00 for professional/major, UIC, semester, and cumulative grade point averages. Health Information Management students must meet the academic standing conditions described in their Student Handbook.",
        "The College of Applied Health Sciences reserves the right to terminate a student’s enrollment. When dismissed, a student is ineligible to enroll at the university for subsequent semesters. Such action will be initiated when the faculty of the program in which the student is enrolled deems it inadvisable for the student to continue toward completion of the course of study. The conditions contributing to this determination by the faculty may include but are not limited to:",
        "Undergraduate students may drop courses using the my.UIC portal through the end of the second week of classes for fall and spring semesters, the first Wednesday of Summer Session 1, or the first Friday of Summer Session 2. During weeks 3 through 10 of the fall and spring semesters (first Thursday through the second Wednesday of Summer Session 1 or weeks 2 through 5 of Summer Session 2), students may drop courses with the permission of their major college. If the drop occurs between 0 and 2 weeks in fall and spring, there will be no notation on the transcript. If the drop occurs during weeks 3 through 10 in fall and spring (first Thursday through the second Wednesday of Summer Session 1 or weeks 2 through 5 of Summer Session 2), a W is noted on the transcript. Undergraduate students may drop a maximum of four UIC individual courses that result in a W notation on their transcript during their entire undergraduate degree program.",
        "College of Applied Health Sciences students should contact their individual programs, at the following locations, to make changes to their schedule: Disability and Human Development, Room 215 DHSPB, 312-996-1508, Health Information Management, Room 250 AHSB, (312) 996-3530; Kinesiology and Nutrition, for Kinesiology programs, Room 337 PEB, (312) 996-4600, for Nutrition programs, Room 632 AHSB, (312) 996-7890; for Rehabilitation Programs, Room 516 AHSB, (312) 996-2079. Since W grades will impact a student’s completion ratio for financial aid, it is recommended that they consult their financial aid counselor to determine the financial implications of dropping a class.",
        "In order for a student to be admitted to professional programs in the college, a student must complete supplemental application materials available in the individual departments prior to the specified deadline dates. Students are only admitted into the Nutrition Coordinated program and campus-based Health Information Management programs in the fall term. Students are admitted to the Disability and Human Development, online Health Information Management, Kinesiology, Nutrition Science, and Rehabilitation Sciences programs in the fall and spring terms. Students who would like to change their major should consult with the academic advisor in their program of interest and complete the intercollege transfer process.",
        "It is expected that students will attend all lectures and laboratory sessions. Prompt and regular attendance is required for all scheduled activities. An absence may be excused if it is unavoidable or justified. The student is responsible for notifying the academic program and clinic each day that he or she will be absent from class or clinic, prior to the absence when possible. Excused absences will generally be given if a student has a documented serious illness or if there is a death of a family member.",
        "Unexcused absences may be reflected in the course grade in a manner determined by the course instructors and in accordance with the policies of the university. Students with unexcused absences may be asked to leave the program.  Students should consult their program handbooks for additional information.",
        "Students must complete all prerequisite course work prior to beginning their professional programs in Health Information Management and Nutrition. In exceptional cases, a department may waive prerequisite course work for a student. In some cases, a proficiency examination will be given.  All prerequisites must be completed prior to enrolling in a course for which the prerequisite is required.  Students who enroll in a course without the appropriate prerequisite(s) will be dropped from the course.",
        "The credit/no credit option will not be accepted for prerequisite or required course work as specified by the department. Grades for credit/no credit are not used in the computation of the grade point average. Students must apply at their college office no later than the tenth day of the term (first Wednesday of Summer Session 1 or first Friday of Summer Session 2) to have a course designated for credit/no credit grading option. Grades of CR and NC are final and cannot be reconverted to letter grades, except under extenuating circumstances. Students interested in health professional programs are advised not to complete any science or other prerequisite courses as credit/no credit.",
        "Admission to the Disability and Human Development, Rehabilitation Sciences, Health Information Management and Nutrition programs provides automatic declaration of a major. Students in the Kinesiology programs must make an appointment with an academic advisor in the department to declare their major. A student must declare a major no later than upon completion of 60 semester hours. Transfer students entering with 60 semester hours or more must declare a major by the end of their first term at UIC. However, earlier declaration is recommended.  For students who apply as Applied Health Sciences Undeclared, it is expected that they apply to their major of interest by the end of their first year of enrollment.  Advisors in the Applied Health Sciences Office of Student Affairs can assist students with the major declaration process.",
        "This option is not available in the College of Applied Health Sciences. Students interested in completing multiple degrees in the college should follow the instructions under the Double Degrees section below.",
        "Double degrees consist of two bachelor’s degrees completed concurrently. Students seeking two bachelor’s degrees concurrently must formally request acceptance into the second degree program. Students must complete a minimum of 30 semester hours beyond those required for the first degree and all requirements for each of the degree programs as specified by the college and major department. All students interested in double degrees should discuss this option with an advisor.",
        "Double degrees are not permitted when there is substantial course overlap between the first and second degrees.",
        "Students who plan to earn two degrees concurrently in separate colleges must choose a primary college (the college of record), enroll at the university through that college, and then follow one of the relevant procedures below.",
        "AHS students who want to complete a second degree in another college should consult that college to determine the options available and applicable rules. AHS students who want to complete a second degree in AHS should follow one of the procedures listed above.",
        "Students who obtain double degrees receive a diploma for each degree. No more than two bachelor’s degrees may be awarded concurrently.",
        "Students who have already earned a bachelor’s degree at UIC or another institution are required to follow the same application procedures as all other applicants in order to pursue a second bachelor’s degree. Students must complete all requirements for the second degree as specified by the college and the major department, including a minimum of 30 semester hours beyond those required for the first degree. The UIC enrollment residence requirement must also be met, i.e., the last 30 semester hours for the second degree must be taken at UIC. A second bachelor’s degree is not permitted when there is substantial course overlap between the first and second degrees.",
        "With department approval, an undergraduate student may enroll in a graduate-level course (500-level) for undergraduate credit. Students should obtain approval from their academic department and the instructor prior to enrollment. Graduate-level courses taken by an undergraduate student are generally not applicable toward a graduate degree.",
        "Undergraduates are encouraged to participate in research programs. Students must consult with the faculty member offering the independent study prior to registering for the section. A student can register for a range of hours depending on the Independent Study. Students in the Kinesiology programs who would like to participate in the Senior Research Seminar and Project must achieve a grade point average of 3.25/4.00 by their senior year of study. Students are required to register for two semesters of research seminar to participate.",
        "Students may file a written petition with their individual department to request an exception to college policies. The department will make a recommendation to the college for granting or denying the request. Petitions are generally only approved for exceptional cases. The general petition form is available on the AHS website.",
        "The Kinesiology program offers proficiency examinations for some of its courses. The Health Information Management Program (HIM) offers proficiency examinations for some of its professional courses. Students interested in proficiency examinations should contact the respective department.",
        "Students must complete required course work prior to assignment to clinical/fieldwork experience. They must show readiness for the experience by having achieved performance levels that are related to the clinical fieldwork and are consistent with safety and technical standards defined in specific program objectives.  Students who do not meet minimum performance standards may be asked to complete a remediation experience.  Failure to demonstrate minimum clinical competencies could result in dismissal from the program.",
        "Prompt and regular attendance is required for all clinical fieldwork experiences. All time lost must be made up. The affiliation clinical supervisor and the faculty member must be notified when a student cannot attend.",
        "The broad range of learning experiences required to prepare for careers in the applied health sciences involves some work in various community settings and healthcare facilities. Some of the assignments for these learning experiences are in the Chicago metropolitan area; others are outside the Chicago area. Students should plan for additional living expenses and transportation for assignments outside the Chicago area. Every effort is made to make the assignments equitable, to meet individual student requests, and to provide appropriate instructions for safe conduct. With the limited resources available and the number of students to be accommodated among all the professions represented, it is not always possible to offer alternate choices.",
        "Students in their first year of enrollment at UIC or those on probation must meet with an academic advisor prior to registering for the next term. Students in professional programs must complete their courses in the sequence prescribed by their academic department. Failure to complete the appropriate course work in a given term could result in dismissal from the program.",
        "Students may repeat a course to increase their knowledge of the subject matter. There are circumstances under which repeating a course is advisable and to a student’s advantage. There are also circumstances where repeating a course may disadvantage a student and narrow a student’s options. The College of Applied Health Sciences requires students to discuss any plan to repeat a course with their academic advisor before they register to repeat the course.",
        "Courses with A or B grades may not be repeated. Normally, courses with a C grade may not be repeated. Courses with D or F grades may be repeated once without written permission. In all cases, the original grade for the course and the grade for each repeat will appear on the transcript. The original grade and the grade for each repeat will be calculated into the grade point average. Only one registration for the course counts toward the total number of credits required for graduation. A course cannot be repeated after receiving credit in a course for which the repeat course is a prerequisite.",
        "To repeat a course more than once requires written permission from the student's college dean. Students who have been dismissed may not appeal on the grounds of intention to repeat courses. Certain courses may not be repeated; students should consult their college before repeating a course.",
        "Students enrolled in the College of Applied Health Sciences participate in a rigorous course of academic and clinical instruction. The students’ successful participation in the instructional programs requires maintenance of a level of physical and mental well-being sufficient to achieve course objectives. Should the faculty of a given program find that a student’s mental or physical well-being is a contributing factor to substandard achievement, they are obligated to counsel the student to seek help from the Health Service, Counseling Services, or private services. The faculty shall refer the case to the dean if the student resists such counseling. The dean shall determine the course of further action. Recommendations resulting from the Health Service or Counseling Services evaluation of the student’s health and well-being may be considered in overall assessment of a student’s capacity to participate in the instructional program. The student may accept the faculty’s assessment, or appeal to the dean, who will determine the course of further action.",
        "UIC students from other colleges may apply to College of Applied Health Sciences programs. Students who would like to transfer to the Disability and Human Development, Kinesiology, or Rehabilitation Sciences programs should submit the Change of College/Major form found on the AHS website to initiate the intercollege transfer request. Each program has specific deadlines for applying as an intercollege transfer.  Refer to the AHS website for specific deadlines. Final approval of intercollege transfers is contingent upon good academic standing and minimum GPA requirements",
        "All other AHS programs require a program-specific application form and admission is competitive and offered only in the fall term. These forms are available from the individual departments and online under each program’s admissions page. Intercollege transfer students should consult the college and academic department sections of the catalog for admission requirements.",
        "Interested transfer students should consult the admissions, college, and department sections of the catalog for admission requirements.",
        "All applicants who meet the admission requirements and have completed applicant files are considered for admission. Application files are used to determine the position of each applicant in a selection system based on both academic and nonacademic criteria.",
        "The Admissions Committee may waive specific course prerequisites for applicants who can demonstrate that they already possess appropriate knowledge or skills that would be gained through taking the required courses. The Admissions Committee reserves the right to waive other specific nonessential requirements when indicated by unusual circumstances.",
        "Students who would like to transfer out of the College of Applied Health Sciences should schedule an exit interview with their academic advisor. Students should then meet with an academic advisor in their new college to request a change of curriculum.",
        "The College of Applied Health Sciences offers minors in Disability and Human Development, Kinesiology, Life Science Visualization, and Nutrition. The minors are open to majors from other departments and colleges. Refer to the list of eligibility requirements in the departments sections of the catalog. Requests to complete the minors can be submitted online through the AHS website.",
        "One-half of the hours required for the minor must be completed in enrollment residence at UIC.",
        "Academic advising is provided at the department level. Students should contact their unit’s program coordinator or academic advisor for more information on advising.",
        "All Applied Health Sciences students are required to meet with their academic advisor once each term, or as specified in their program handbook. Students on academic probation are required to meet with their academic advisor prior to registering for the next term. Students interested in applying to professional programs in the College of Applied Health Sciences are encouraged to schedule an advising appointment at least one year prior to their expected admission date. Monthly advising sessions are offered for most professional programs in the college. Some programs assign a faculty advisor during the year of matriculation. Students should contact their individual departments or the Office of Student Affairs for further details.",
        "The college recognizes and conforms with the campus-wide honors program. University Honors are awarded to graduating students whose UIC grade point average falls within the following honors categories:",
        "The college will reserve the right to make permanent adjustments to the list of students receiving Latin Honors based on final semester grade point average.",
        "Each semester the Dean’s List honors the academic excellence of students enrolled in the college’s undergraduate programs. Students must be full time and earn at least 12 semester hours of letter grades in his or her respective department to be eligible. Students must also earn a semester grade point average of 3.50/4.00 or higher.",
        "Applied Health Sciences students have a variety of student organizations available to them, ranging from student government to professional societies and organizations to groups organized around a specific focus.  Involvement in student organizations is encouraged as experiences gained can enhance learning and contribute to development of valuable leadership skills.  All students, upon admission, become members of the Urban Allied Health Academy. Students can also serve on various college committees.",
        "Abbreviated Listing:",
        "AHS Student Council",
        "Disabled Students Union",
        "Disability History and Culture Club",
        "Diverse Student Organization",
        "Health and Diversity Academy",
        "Health Professions Student Council",
        "Kinesiology Club",
        "Pre-Occupational Therapy Club",
        "Pre-Physical Therapy Club",
        "Rehabilitation Sciences Club",
        "Student Nutrition Association",
        "",
        "Apply Online | Contact Admissions | Privacy Statement",
        "Having problems accessing this site? Contact the Webmaster.",
        "© 2018-2019 The Board of Trustees of the University of Illinois",
        "",
        "Print this page.",
        "",
        "The PDF will include all information unique to this page.",
        "",
        "All pages in the campus catalog.",
        ""
    ],
    "out_links": [
        "https://catalog.uic.edu/azindex/",
        "https://catalog.uic.edu/",
        "http://www.uic.edu/",
        "https://catalog.uic.edu/ucat/",
        "https://catalog.uic.edu/gcat",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://catalog.uic.edu/ucat/the-university/",
        "https://catalog.uic.edu/ucat/admissions-registration-finances/",
        "https://catalog.uic.edu/ucat/degree-programs/",
        "https://catalog.uic.edu/ucat/colleges-depts/",
        "https://catalog.uic.edu/ucat/colleges-depts/applied-health-sciences/bhis/",
        "https://catalog.uic.edu/ucat/colleges-depts/applied-health-sciences/dhd/",
        "https://catalog.uic.edu/ucat/colleges-depts/applied-health-sciences/kn/",
        "https://catalog.uic.edu/ucat/colleges-depts/applied-health-sciences/rs/",
        "https://catalog.uic.edu/ucat/colleges-depts/applied-health-sciences/preprofessional-studies/",
        "https://catalog.uic.edu/ucat/colleges-depts/architecture-design-arts/",
        "https://catalog.uic.edu/ucat/colleges-depts/business-administration/",
        "https://catalog.uic.edu/ucat/colleges-depts/education/",
        "https://catalog.uic.edu/ucat/colleges-depts/engineering/",
        "https://catalog.uic.edu/ucat/colleges-depts/honors-college/",
        "https://catalog.uic.edu/ucat/colleges-depts/liberal-arts-sciences/",
        "https://catalog.uic.edu/ucat/colleges-depts/nursing/",
        "https://catalog.uic.edu/ucat/colleges-depts/pharmacy/",
        "https://catalog.uic.edu/ucat/colleges-depts/public-health/",
        "https://catalog.uic.edu/ucat/colleges-depts/urban-planning-public-affairs/",
        "https://catalog.uic.edu/ucat/colleges-depts/council-teacher-education/",
        "https://catalog.uic.edu/ucat/course-descriptions/",
        "https://catalog.uic.edu/ucat/archive-links/",
        "https://catalog.uic.edu/gcat/",
        "https://catalog.uic.edu/all-course-descriptions/",
        "http://www.ahs.uic.edu/",
        "https://catalog.uic.edu/ucat/degree-programs/general-education/",
        "https://catalog.uic.edu/search/?P=ENGL+160",
        "https://catalog.uic.edu/search/?P=ENGL+161",
        "https://catalog.uic.edu/search/?P=AHS+100",
        "https://catalog.uic.edu/search/?P=AHS+101",
        "https://catalog.uic.edu/search/?P=KN+100",
        "https://my.uic.edu/",
        "http://ahs.uic.edu/inside-ahs/student-resources/advising/",
        "http://ahs.uic.edu/inside-ahs/student-resources/",
        "http://ahs.uic.edu/inside-ahs/student-resources/advising",
        "http://admissions.uic.edu/apply-now",
        "http://admissions.uic.edu/contact-admissions"
    ]
}