{
    "url": "https://admissions.uic.edu/undergraduate/faq",
    "title": "FAQs | UIC Admissions",
    "text": [
        "There are none. Quantitative factors like GPA and test scores are key pieces of the undergraduate review, but the rest of your application is as important. Other pieces like your counselor and teacher recommendations, essays, activities, and volunteer experience are all considered as well.",
        "A minimum 2.50 GPA based on all attempted college coursework is recommended for transfer applicants. Competitive transfer applications will have a higher GPA and have completed all or most of the prerequisite coursework required by the college. View the Transfer Guide for more details.",
        "First Year applications are accepted for the Fall term between August 1st-January 15th and for the Spring term (on a limited basis) between August 1st-October 1st. The Common Application opens on August 1st.",
        "Transfer, Readmission, Second Bachelor's and Nondegree applications are accepted by all programs for the Fall term and by most programs for the Spring term. The UIC Application for Fall is typically available by August 1st of the preceeding year and open through March. The UIC Application for Spring is typically available by June 1st and open through October.",
        "Requirements and Deadlines vary based on the term and type of application you’re submitting.",
        "Some programs may accept applications after the deadline. All late application requests for all colleges should be submitted using our online petition form. If a late application is granted, you wll be notified through email and given instructions on submitting the application within a new deadline period, so be sure to check your email after submitting the late application petition.",
        "Official electronic documents are accepted through the following services: The Common Application, Parchment, Naviance, Escrip-Safe, and The National Student Clearinghouse. The electronic delivery method will be determined by your sending institution’s agreements with one of these third party servicers. As is the case with all three servicers, you should select The University of Illinois at Chicago as the recipient. No email address should be provided. We have database accounts with each of these providers and will receive access to the transcripts through our database.",
        "Official paper documents can be mailed, or hand delivered, to the Office of Admissions in the originally sealed envelope. Official documents that have been opened and/or resealed or repackaged will not be accepted as official.",
        "Office of Undergraduate Admissions, MC 018",
        "University of Illinois at Chicago",
        "Suite 1100 Student Services Building",
        "1200 West Harrison Street",
        "Chicago, Illinois 60607-7161",
        "",
        "The payment of the application fee is part of the submission process. You must pay the application fee or request a qualified fee waiver when you apply. The application cannot be submitted without payment or a waiver selected.",
        "Please keep in mind that we do not offer fee waivers for international applicants at this time. If an international applicant selects a fee waiver, the fee will be assessed upon receipt of the application and can be paid in the applicant portal.Once paid, the review process will begin.",
        "If you qualify for a fee waiver, select the appropriate waiver type on your application. The application will automatically bypass the payment step when a fee waiver is requested.",
        "You can monitor the status of your application online to see if further documentation is required. At this time, fee waivers are not accepted for international applicants.",
        "If you are unable to secure official documents from any previous institution due to a transcript hold, you will be unable to complete the transfer application process and we highly recommend waiting to apply until the hold has been cleared. We are unable to offer admission with unofficial transcripts and our application fee is non-refundable. We use the National Student Clearinghouse as part of our review process and any previous institutions that were not reported on the application are added to the checklist of requirements. Exceptions to this policy are very rare and only granted in the case where a school has closed and an official transcript is unavailable. We cannot waive this requirement for financial holds at this time.",
        "Answers on your application will determine the initial Illinois residency status. See the Residency page for more details.",
        "A Social Security Number is a government issued identification number generally used for tracking working individuals for taxation purposes. An SSN is required for students who apply for federal financial aid or who are subject to IRS reporting requirements, but is not required for applicants or admission to the University. International students who do not have a SSN should not provide other national ID numbers in attempt to fully complete the application. Please see the Social Security Administration’s website for more complete details.",
        "First Year applicants need high school transcripts and ACT/SAT scores for review. See the First Year requirements.",
        "Transfer applicants need college transcripts and, in some cases, high school transcripts and ACT/SAT scores for review. See the Transfer Requirements.",
        "Transfer applicants to the following majors must also upload program-specific supplemental requirements for review:",
        "International applicants will also upload documents for the I-20 process with the Office of International Services. View the initial I-20 requirements.",
        "View the Undergraduate Upload Guide for a step-by-step walk-through of the upload process.",
        "First Year applicants to the Honors College or Guaranteed Professional Program Admissions (GPPA) are required to submit two letters of recommendation. Recommendations for first year applicants are encouraged, but not required. You may invite your recommenders to submit on your behalf via the Common Application.",
        "Transfer applicants to the following majors must also submit letters of recommendation:",
        "For other transfer programs, recommendations are welcome, but not required. Applicants may invite recommenders from the application checklist within a couple days of application submission.",
        "The Office of Admissions does not require you to submit your original documents to the university. We understand that many universities only issue one set of original documents to students. Students should plan to submit attested copies of all original documents to UIC. This can be done by making copies of your transcripts, marksheets, and/or degrees and having them stamped (certified) by the registrar or Controller of Examinations at your school. The school official must also certify that they sealed the envelope by stamping the envelope flap.",
        "If your school refuses to issue the required documents, you will need to request a letter from the registrar or Controller of Examinations explaining their policy. This letter should be submitted to UIC in a sealed envelope which bears the stamp of the individual who is issuing the statement.",
        "Please note that this exception will only be considered by the Office of Admissions in extreme circumstances. UIC has experience working with applicants from around the world and realizes that circumstances vary, but submitting such a letter will not guarantee that the request for official documents will be lifted.",
        "All documents submitted to UIC become the property of the University. Documents will not be released to the applicant or forwarded to other institutions or agencies. Please do not submit your original or only set of academic credentials. No documents will be returned to you.",
        "Yes, the use of English in your country or school does not determine TOEFL requirements.",
        "TOEFL exemptions are only granted for the following circumstances:",
        "Acceptable documents for select countries:",
        "People's Republic of China (excluding Hong Kong)",
        "Hong Kong",
        "South Korea",
        "India",
        "Singapore",
        "Malaysia",
        "Your high school GPA and ACT/SAT scores are only the beginning of your application. UIC evaluates your strength of schedule, grade trends, counselor and teacher recommendations, and essays at every step of the review process. Any additional information may be submitted if you think it paints a clearer picture of you as a student or individual.",
        "Your overall, cumulative college grade point average (GPA) and prerequisite coursework are the most important pieces of information in the review process. We review coursework from all institutions attended to determine an overall GPA. The various Colleges at UIC have unique admission requirements, so choice of major is considered while reviewing your completed coursework. Letters of recommendation and personal essays are also considered.",
        "Most applicants do not need an interview or audition on campus. A few specific programs listed below may require it as part of their review process.",
        "Some programs  in the College of Architecture, Design, and the Arts",
        "Interviews",
        "For First Year applicants, most applicants who apply by UIC’s Early Action deadline will receive their decision on or before December 1. EA applicants who are deferred to the regular process and applicants who apply under regular decision will usually receive a decision between the end of January and the end of March, although some exceptions do apply if programs require an interview or audition. These dates are only for undergraduate applications and do not pertain to Honors College/GPPA decisions.",
        "For Transfer applicants, a majority of the application decisions for fall applications will be released between the March deadline and the end of April. Decisions for spring applications are generally issued between October and early December. A small percentage of applications will receive decisions during the initial review while most transfer applications undergo multiple reviews. UIC does not offer early decisions or a priority decision date for transfer applicants.",
        "Decisions appear online as soon as they are made available in our system and are viewable when you check the status of your application. A physical decision letter is mailed out the day following the decision. Admission decisions will not be given over the phone.",
        "Denied applicants may appeal their decision, however they should have a new and compelling reason to do so. If you have new test scores, updated grades, or other documented reasons (illness, trauma, extenuating circumstances) that were not disclosed when you originally applied and would have significantly changed your application, you may follow the instructions for submitting an appeal. We do consider students for alternate programs during the review process, so requesting consideration for another program will not likely change the outcome.",
        "Neither disciplinary nor criminal history are a factor in the decision to admit an applicant. While we do ask about disciplinary history on the application, responses are reviewed separately, outside of the admission process. Applicants may be asked for further information after a decision has been made, but this is not common.",
        "We do not ask about criminal history on our applications. Once admitted, students are asked about any relevant history upon accepting the offer of admission and declaring intent to enroll. For more information, please review the University of Illinois Policy for Consideration of Criminal History in Undergraduate Admissions.",
        "1200 West Harrison Street",
        "Chicago, IL 60607-7161",
        "Phone: (312) 996-4350Contact UIC Admissions",
        "1220 West Harrison Street",
        "Chicago, IL 60607-7161",
        "Phone: (312) 413-1726",
        "Office of Undergraduate Admissions (MC 018)",
        "University of Illinois at Chicago",
        "1200 West Harrison Street, Suite 1100",
        "Chicago, IL 60607-7161 Contact Undergraduate Admissions",
        "",
        "The graduate and professional application process is paperless. Please do not mail materials unless expressly requested.Contact Graduate and Professional Admissions",
        "Copyright © 2020 The Board of Trustees of the University of Illinois"
    ],
    "out_links": [
        "https://admissions.uic.edu/",
        "https://admissions.uic.edu/explore-uic",
        "https://nexus.admissions.uic.edu/",
        "https://admissions.uic.edu/apply-now",
        "https://admissions.uic.edu/undergraduate",
        "https://applynow.uic.edu/apply/",
        "http://go.uic.edu/petition",
        "https://admissions.uic.edu/undergraduate/undergraduate-requirements-deadlines/transfer-requirements/transfer",
        "https://admissions.uic.edu/undergraduate/requirements-deadlines",
        "https://nursing.uic.edu/programs/bachelor-science-nursing/",
        "http://ahs.uic.edu/kinesiology-nutrition/admissions-and-programs/bs-in-nutrition/applying/",
        "http://ahs.uic.edu/biomedical-health-information-sciences/admissions-and-programs/bs-in-health-information-management/applying/",
        "http://publichealth.uic.edu/admissions/undergraduate-degree-program",
        "https://www.ois.uic.edu/students/prospective/obtaining_an_initial_i-20__d_s-2019/",
        "https://admissions.uic.edu/undergraduate/application-process/document-upload-guide",
        "https://admissions.uic.edu/undergraduate/application-process/undergraduate-application-status",
        "https://admissions.uic.edu/undergraduate/application-process/appeal-process",
        "http://financialaid.uic.edu/",
        "https://admissions.uic.edu/program-finder/view-by-interest",
        "https://admissions.uic.edu/graduate-professional/faq",
        "https://admissions.uic.edu/graduate-professional",
        "https://admissions.uic.edu/contact-admissions",
        "https://admissions.uic.edu/undergraduate/contact-undergraduate-admissions",
        "https://admissions.uic.edu/graduate-professional/contact-graduate-and-professional-admissions",
        "http://www.uic.edu/",
        "http://uic.edu/",
        "https://policies.uic.edu/uic-policy-library/access-and-equity/nondiscrimination-policy-statement/",
        "https://admissions.uic.edu/sitemap",
        "https://disabilityresources.uic.edu/",
        "https://admissions.uic.edu/Shibboleth.sso/Login?target=https%3A%2F%2Fadmissions.uic.edu%2F%3Fq%3Dshib_login%2Fnode%2F5",
        "http://disabilityresources.uic.edu/"
    ]
}