{
    "url": "https://catalog.uic.edu/ucat/colleges-depts/business-administration/",
    "title": "College of Business Administration < University of Illinois at Chicago",
    "text": [
        "The College of Business Administration transforms student potential into success. We provide a proven, research-based education, real­-world skills, and professional experiences that add up to exciting career opportunities. For the past four years U.S. News & World Report has ranked the University of Illinois at Chicago College of Business Administration the #1 business program among accredited undergraduate business programs in Chicago.",
        "The ranking places UIC among the top 15 percent of the 467 programs accredited by the Association to Advance Collegiate Schools of Business (AACSB), the primary accreditation organization for business schools. Over 2,500 undergraduate students annually pursue degrees in seven areas:",
        "In addition to our campus-based programs UIC Business offers a Bachelor of Business Administration degree completion program that is offered both on campus and online. More information about this program can be found in the Bachelor of Business Administration section.",
        "UIC’s proximity to the urban business community in Chicago connects students to Chicago’s living classroom and provides constant contact with the college's 33,000 alumni.",
        "The undergraduate program's diverse student body and rigorous programs help students develop the skills they need to become the business leaders of the future. The knowledgeable faculty and the quality of their research and scholarly work are evidenced by publications in the leading journals in their fields.",
        "In addition to course work in their degree program, the curriculum includes core courses in all functional areas of business, and supporting course work in mathematics, communications, statistics, and information systems. UIC's program allows graduates to go on to pursue management and leadership positions in business and nonbusiness settings, or start and own their own businesses. The undergraduate program provides students with the skills necessary for a successful career in business and is also an excellent preparation for graduate training in business, law, or any business-related discipline.",
        "UIC Business provides a proven education that is enhanced through academically challenging course work, innovative theoretical and applied research, active professional development programs, a full-service Business Career Center, and an array of research and outreach centers.",
        "The College of Business Administration is accredited by AACSB International—The Association to Advance Collegiate Schools of Business. AACSB International accreditation represents the highest standard of achievement for business schools worldwide. Institutions that earn accreditation confirm their commitment to quality and continuous improvement through a rigorous and comprehensive peer review. The accreditation ensures that the business program delivers what is promised. AACSB accreditation is the hallmark of excellence in management education.",
        "To earn a College of Business Administration degree from UIC, students need to complete university, college, and department degree requirements. General university and college degree requirements for all College of Business Administration students are outlined below. Students should consult the academic department section for major course requirements.",
        "The College of Business Administration minimum semester hour requirement is 120 semester hours for all degree programs.",
        "The Bachelor of Business Administration online program follows a different curriculum. More information can be found in the Bachelor of Business Administration section.",
        "Students in the College of Business Administration pursuing the Bachelor of Science degrees in any of the seven majors and the on-campus BBA Program will be required to participate in a minimum of 10 hours of service learning per calendar year for a total of 40 hours in four years or for a total of 20 hours over two years for transfer students. Students in the BBA online program are exempt from the service requirement.",
        "Students should take ENGL 160 and ENGL 161, the courses of one of the mathematics tracks, and ECON 120 and ECON 121 as early as possible, since these courses are prerequisites for most of the business core courses.",
        "BA 100, BA 220, and BA 320 are one-semester-hour courses that are required for graduation for students who start as first year students in the College of Business Administration and transfer students who enter with less than 24 hours. The hours count in the calculation of tuition, full- or part-time enrollment status, and financial aid eligibility. The hours do not count towards the 120 hours necessary to graduate.",
        "Minimum grades of C must be earned in these courses.",
        "Students should select the mathematics track that matches their preparation and career goals.",
        "Required for students who enter the College of Business Administration as transfer students. BA 420 will be applied as credit toward the degree for all Bachelor of Science programs, reducing the hours of general electives.",
        "Students must satisfy the university’s General Education requirements by taking classes from various subject areas. The requirement in some of these subject areas may be fulfilled through the required courses listed above. For the categories with additional hours, students should consult the General Education section of the catalog for a list of courses in each category.",
        "MATH 125, MATH 165, MATH 180, and MATH 181 listed in the preceding General and Basic Education Requirements table are approved General Education Core courses for the Analyzing the Natural World General Education requirement. Students must take one additional course in this category.",
        "COMM 100 satisfies the Understanding the Individual and Society course requirement.",
        "ECON 120 satisfies the Understanding U.S. Society course requirement.",
        "Kinesiology and music skills courses cannot count in this category.",
        "Finance majors must take FIN 330. IDS majors must take IDS 371. Students may substitute another quantitative course with permission of the department in which they major.",
        "Students may also use an approved Study Abroad or International Exchange to satisfy this requirement.",
        "These courses have the same prerequisites—senior standing and completion of all other Business Core courses. Students may take the integrative course in any department, not necessarily in their major.",
        "All entering freshmen in the college must successfully complete BA 100 during the fall semester. This first-year experience and professional development course is designed to help students successfully transition from high school to a university environment as well as teach professional development skills needed for leadership. BA 100 includes an introduction to study strategies and techniques as well as an orientation to resources available at UIC. Students will be given an overview of the CBA degree programs and careers in business. Additionally, this course provides ample opportunities to connect with other students, faculty, staff, and organizations and activities on campus. In their second year, students must successfully complete BA 220.  BA 220 is to be taken in students’ fourth semester and is intended to develop “professional presence”—the verbal and nonverbal skills necessary to excel professionally. In either semester of their third year, students must successfully complete BA 320. The primary goal of BA 320 is to understand and practice the value of serving the community. A secondary goal of the class is to learn and practice building effective teams.",
        "BA 100, BA 220, and BA 320 are one-semester-hour courses required for graduation. The hours count in the calculation of tuition, full- or part-time enrollment status, and financial aid eligibility. However, the hours do not count towards the 120 hours necessary to graduate.",
        "The College of Business Administration requires at least two years of a single foreign language in high school with minimum grades of C as a criterion for admission. Students who are admitted with a deficiency in this area must take two semesters of a single foreign language at the college level with minimum grades of C or prove proficiency in a foreign language.",
        "General Education at UIC is designed to serve as a foundation for lifelong learning. Students are required to complete a minimum of 24 semester hours in the General Education Core with at least one course from each of the following categories:",
        "For a description and a list of courses for each General Education Core category, students should consult the General Education section of the catalog. Information on meeting the General Education requirements for each College of Business Administration degree program is detailed in the previous section on General Course Requirements.",
        "A minimum grade of C in ENGL 160 and ENGL 161 is a degree requirement. Transfer students who have taken the equivalent of ENGL 160 and/or ENGL 161 at other institutions may only receive graduation credit for these courses if they earned minimum grades of C.",
        "Business students must register for a mathematics course every semester beginning with their first semester of enrollment until one of the required mathematics tracks has been completed. After completing the required math courses, students must enroll in Business Statistics (IDS 270). Some students may be required to take prerequisite math courses prior to enrolling in the required math courses.",
        "Satisfactory grades are required in MATH 090 to progress to the next math course.",
        "Credit earned for these prerequisite courses will not count toward the hours required for graduation, and the grades earned are not included in the grade point average (GPA). Students may place anywhere in this sequence",
        "Courses that duplicate previous course work do not count toward graduation, nor do courses in which failing grades are received. Furthermore, credit earned in the following courses does not count towards graduation:",
        "The only exception is that students may earn 3 semester hours of credit in ENGL 070 or ENGL 071 and a waiver of ENGL 160 if written authorization is received from the Department of English. BA 100, BA 200, BA 289, BA 320, ESL courses, MATH 090, and Academic Skills Program courses do not carry academic credit and will not be used in computing the grade point average, but will be used for the purpose of determining full- or part-time status, and for financial aid eligibility.",
        "In addition to meeting all University requirements for the degree, students must earn a minimum cumulative GPA of 2.00/4.00 in each of the following to qualify for graduation:",
        "The College of Business Administration is dedicated to assisting students with the achievement of both their academic and professional goals in a timely manner. One semester before graduation, CBA students are required to meet with their academic advisor to complete a graduation review. In the semester of graduation, students will receive a graduation check via their UIC email account verifying they are cleared to graduate. When students register for their final semester of courses, they will also declare their intent to graduate online using Student Self-Service. The deadline to declare graduation in the my.UIC system is the end of the third week (fall and spring) or second week (Summer Session 2) of the term in which graduation is sought. Failure to complete these two steps may delay the awarding of the degree to the next semester. A final review of the records will be made following the close of the term.",
        "Students completing all degree requirements for their declared major will need permission from their college to enroll in additional undergraduate courses. See the University Degree Requirements section of the catalog for a complete description of this policy.",
        "The following college enrollment residence requirements apply to all CBA students:",
        "All students are required to demonstrate understanding of business ethics through completion of an online ethics examination or by taking an ethics course offered in the CBA.",
        "To ensure the quality of the academic program and to assist in continuous improvement efforts, all students must participate in one assessment event prior to graduation. Students will register for a non-credit course (BA 395) to complete this requirement.",
        "Business students are required to have a laptop computer that can run the latest versions of Microsoft Windows and Office and has Wi-Fi or wireless Internet access.",
        "To be considered a full-time student during the fall and spring semesters, a student must be registered for a minimum of 12 semester hours. For Summer Session 1 (Four-Week) and Summer Session 2 (Eight-Week), UIC considers a total aggregate of 6 semester hours as the minimum number necessary to constitute full-time enrollment. A maximum of 18 semester hours may be taken in a semester (12 hours between the two summer sessions). To complete a CBA degree within four years, a student must take an average course load of 15–16 hours per semester. Students requiring prerequisite math or English courses should plan to attend summer school to ensure timely graduation and meet this goal. For each hour of registered course work, students should expect to complete three hours of homework, studying, and reading.",
        "Students’ academic status will be based on their semester or cumulative grade point average. Students are in “good standing,” “on probation,” or “dismissed.” Students can check their academic status after each semester on my.UIC. Students who are on academic probation or who have been dismissed are informed of their status by UIC email from the college following the end of the semester.",
        "Students will be placed on academic probation in any term in which they earn either a cumulative or semester grade point average of less than 2.00/4.00. They will then be expected to earn at least a 2.00/4.00 semester grade point average and to raise their cumulative grade point average to a 2.00/4.00 to achieve good academic standing.",
        "Academic probation at UIC can only be removed by successfully completing additional course work at UIC. Probation is broken down as follows.",
        "The following rules are applied to determine the academic status of a student on probation:",
        "CBA Undergraduate Programs determines the conditions of probation. In addition to specifying the grade point average, the college may require the completion of specific courses, limit the number of hours for which students register, and exclude students from taking certain courses while on probation.",
        "All students on probation are required to adhere to the following terms of probation (academic restrictions). Failure to do so will result in registration holds and possible academic dismissal.",
        "Undergraduate students may drop courses using my.UIC through the end of the second week of classes for fall and spring semesters, the first Wednesday of Summer Session 1, or the first Friday of Summer Session 2. During weeks 3 through 10 of the fall and spring semesters (first Thursday through the second Wednesday of Summer Session 1 or weeks 2 through 5 of Summer Session 2), students may drop courses with the permission of their major college. If the drop occurs between 0 and 2 weeks in fall and spring, there will be no notation on the transcript. If the drop occurs during weeks 3 through 10 in fall and spring (first Thursday through the second Wednesday of Summer Session 1 or weeks 2 through 5 of Summer Session 2), a W is noted on the transcript. Undergraduate students may drop a maximum of 4 UIC individual courses that result in a W notation on their transcript during their entire undergraduate degree program.",
        "To avoid difficulty, CBA suggests that students do the following:",
        "Students are encouraged to discuss their options for majors within the College of Business Administration with faculty, career advisors, and academic advisors. CBA students must declare a major by the end of their sophomore year. Declaring or changing a major is done by making an appointment with an academic advisor.",
        "CBA’s expectation is that students will attend all classes because it is necessary for achieving academic success. Each instructor may establish specific attendance requirements for his/her course. The instructor is responsible for making the attendance policy clear to the students. An instructor cannot drop a student from a course due to nonattendance. It is the student’s responsibility to make certain that all courses are added and dropped properly by the published deadlines.",
        "Courses close because a maximum enrollment capacity is placed on each course. This limit cannot be exceeded due to fire code, safety and environmental regulations. It is necessary that students register at their assigned time to ensure the preferred course schedule.",
        "UIC awards credit on the basis of scores earned on the College Level Examination Program (CLEP). When seeking credit for a CLEP exam taken at another institution, a student's official score will be evaluated on UIC's credit-granting policy.",
        "CLEP credit will not count toward general education credit, university writing, quantitative reasoning, foreign language, residency, major, or minor requirements. A student cannot take a CLEP exam in a subect in which they have earned credit. Three elective credit hours will be awarded per exam. A maximum of 30 credit hours is allowed.",
        "The full list of CLEP exams available is available online. The Office of Testing Services administers CLEP exams on campus and can be reached at (312) 996-0919 for further information on CLEP examinations.",
        "Students must meet all course prerequisites. The most up-to-date prerequisites for courses are listed on my.UIC. Prerequisites are put on courses to ensure students’ success in the course and to maximize understanding and comprehension of the academic material. Students who do not meet published prerequisites may be dropped from the course.",
        "Students may elect to take courses on the credit/no credit option under the following conditions:",
        "To elect this option, students must complete a Credit/No Credit Form in the CBA Undergraduate Programs office. The form must be submitted to 1118 UH by 4:15 p.m. (the close of business) on the tenth day of instruction (or the first Friday of Summer Session 1 or the second Friday of Summer Session 2). No exceptions will be made to this policy.",
        "Students pursuing a double major or dual major must submit a double major petition through Business Connect on the CBA website.",
        "Students interested in pursuing a dual degree should submit a formal request via general petition to the undergraduate programs office. If a student’s request is approved, the College of Business Administration will serve as the primary college.",
        "Applicants who have already earned a bachelor’s degree must apply to the graduate program.",
        "The College of Business Administration prohibits undergraduate students from registering for graduate-level courses and the use of graduate-level credit applied toward the undergraduate degree. Students should understand that graduate-level courses taken by an undergraduate student are not applicable toward a future graduate or professional degree.",
        "Students are required to contact an instructor in their major field of study to propose a topic for independent study. If approved, a Request for Independent Study Form must be completed and approved by the academic department before registering for an independent study course. In addition, if the course is to be applied toward the major, a formal petition must be approved by the department head and the Undergraduate Programs Office of the college. Students should consult the department office for specific procedures regarding enrollment in independent study courses.",
        "Students who want to make formal requests or appeal college policies do so by using a petition process. CBA has various types of petitions available for different types of appeals, requests, or clarifications of policies and requirements. Petition forms and advice for completing these forms are available in the Undergraduate Programs Office in 1111 UH or on the CBA website.",
        "Students interested in earning proficiency credit should contact the department for information concerning eligibility and availability of a proficiency exam. This is subject to the university, college, and departmental policy on proficiency examinations. Proficiency credit cannot be earned by CBA students for major-level courses, nor can proficiency credit earned for a foreign language be used towards the degree. A student who earns proficiency credit is given the amount of credit toward graduation regularly allowed in the course. Proficiency credit is not considered an interruption of the enrollment residence requirement, nor a satisfaction of the last 30-semester-hour enrollment residence requirement for graduation.",
        "Each semester, all Accounting majors, who have started taking major-level accounting courses, are required to meet with an academic advisor and an assigned faculty advisor in their major department prior to receiving approval to register. Students on academic probation must also meet with an academic advisor prior to registering for the next semester. Registration holds will not be removed from the student’s account until these conditions have been met.",
        "Students may repeat a course to increase their knowledge of the subject matter. There are circumstances under which repeating a course is advisable and to a student’s advantage. There are also circumstances where repeating a course may disadvantage a student and narrow a student’s options. The College of Business Administration requires students to discuss any plan to repeat a course with their academic advisor before they register to repeat the course.",
        "Courses with A, B, or C grades may not be repeated. Courses with D or F grades may be repeated once without written permissions. In all cases, the original grade for the course and the grade for each repeat will appear on the transcript. The original grade and the grade for each repeat will be calculated into the grade point average.",
        "Only one registration for the course counts toward the total number of credits required for graduation. A course cannot be repeated after receiving credit in a course for which the repeat course is a prerequisite.",
        "To repeat a course more than once requires written permission from the academic department head from which the course is being offered. Students who have been dismissed may not appeal on the grounds of intention to repeat courses. Certain courses may not be repeated; students should always consult their CBA academic advisor before repeating a course.",
        "The College of Business Administration may elect to implement this policy as early as the end of the junior year, or as late as the final semester during degree certification.",
        "The college will evaluate each student unable to graduate because of an academic grade point average deficit. The deficit may occur in the UIC GPA, the program GPA, or both.",
        "A student's academic record is examined so as to determine if courses, deemed appropriate by each college, with grades of F or grades of D, may be excluded from the student’s grade point average.",
        "A total of four courses may be excluded, with one course excluded at a time until the necessary quality points are obtained to meet the UIC GPA requirement and/or degree program minimum GPA. The credit hours associated with excluded course grades will not count towards graduation requirements.",
        "CBA academic advisors and departments will have discretion in choosing courses that impact the student's major or degree program.",
        "This policy will apply to all entering students for Fall 2017. Current and continuing students (who have entered prior to Fall 2017) are able to continue using the 2009 Grade Point Average Recalculation Policy until graduation or dismissal from the university.  The new proposed policy could be applied to any current or continuing student who has not utilized the 2009 Recalculation Policy.",
        "UIC students from other colleges may apply for transfer to the College of Business Administration. Admission is competitive and based on space availability.",
        "The following is a list of the minimum criteria needed to be considered for admission:",
        "Admission into the college is competitive. The college reserves the right to adjust admissions criteria based on number of applications received and space availability.",
        "The following guidelines list the minimum requirements to be considered for admission to the College of Business Administration:",
        "See the Office of Admission Transfer Guide for more information about transfer admission requirements.",
        "It is highly recommended that students complete their required Academic Writing courses, Finite Math or Linear Algebra, and either Business Calculus or Calculus I with minimum grades of C by the time of enrollment at UIC.",
        "Students should follow the process of the receiving college when requesting a transfer out of the College of Business Administration.",
        "The College of Business Administration offers the following minors for students within the college. Completion of one of these programs will be noted on the official UIC transcript upon graduation. Students seeking one of these minors are required to have a 2.50/4.00 GPA.",
        "The College of Business Administration offers the following minors for students outside of the college. Completion of one of these programs will be noted on the official UIC transcript upon graduation. Students seeking one of these minors are required to have a 2.50/4.00 GPA.",
        "Academic advisors are located in the CBA Undergraduate Programs Office located on the 11th floor of University Hall, room 111. Office hours are Monday through Friday, 8:30 to 4:45. Additional information can be found on the CBA website.",
        "The CBA Student Services Office provides academic advising regarding course selection and registration, transfer credit, academic probation, and progress made toward the degree. It is the student’s responsibility to make certain that the degree requirements are fulfilled. The college strongly recommends that all students meet with an advisor each semester to plan a manageable course schedule to stay on track for graduation.",
        "Students should meet with an advisor for any of the situations listed below:",
        "Individual academic advising is by appointment. General questions can be answered by phone and email. Students faced with an emergency situation should contact CBA Student Services at (312) 996-2700.",
        "College Honors are awarded when a student graduates and are noted on both the diploma and transcript. To qualify for College Honors, students must do the following:",
        "Students are eligible for the Dean’s List if they have completed a minimum of 12 graded hours, or 6 graded hours during the summer term, and if they earn a term grade point average of 3.50 or higher. Although the grade point average excludes courses taken on the credit/no credit option, a student who fails a course taken under this option is ineligible for the Dean’s List.",
        "Department Honors are awarded when a student graduates and are noted on the UIC official transcript. Department honors are awarded if the student meets the grade point average criteria listed below:",
        "The Undergraduate Business Career Center (BCC) encourages students to participate in many activities that are designed to prepare future business leaders for their careers. Information can be found on the CBA website.",
        "Career advising services include:",
        "We Coach students:",
        "We Expose students to employers through our:",
        "We Connect students to employers via our:",
        "The Undergraduate Business Career Center is located on the first floor of Douglas Hall.",
        "As an academic community, the College of Business Administration at the University of Illinois at Chicago is committed to providing an environment in which teaching, learning, research, and scholarship can flourish and in which all endeavors are guided by academic and professional integrity. All members of the college community—students, faculty, staff, and administrators—share the responsibility of insuring that high standards of integrity are upheld so that such an environment exists.",
        "In pursuit of these high ideals and standards of academic life, students will be expected to respect and uphold the UIC College of Business Administration Honor Code throughout their academic life at UIC. They will be expected to maintain the highest moral and ethical standards in all academic and business endeavors and to conduct themselves honorably as responsible members of the college academic community. This includes the following:",
        "Violations of the Honor Code are just causes for discipline under the University of Illinois at Chicago Student Disciplinary Policy, and all allegations of Honor Code violations shall be handled pursuant to that Policy.",
        "Student organizations related to each of the business majors provide opportunities for students to interact with faculty, alumni, and corporate professionals. To learn more about student organizations please visit the UIC Business Connect website.",
        "The College of Business Administration annually invites the upper 10 percent of the junior class and senior class to accept membership in Beta Gamma Sigma, the national scholastic honor society in the field of business administration. Inductees must have completed at least 30 semester hours at UIC and are chosen on the basis of their UIC and cumulative grade point averages.",
        "BA 100, BA 220, and BA 320 are required one-semester-hour courses, but the hours do not count toward the total hours required for graduation.",
        "Courses may be taken in any semester in any order.",
        "Accounting and Finance students may start with the core courses in their major.",
        "Apply Online | Contact Admissions | Privacy Statement",
        "Having problems accessing this site? Contact the Webmaster.",
        "© 2018-2019 The Board of Trustees of the University of Illinois",
        "",
        "Print this page.",
        "",
        "The PDF will include all information unique to this page.",
        "",
        "All pages in the campus catalog.",
        ""
    ],
    "out_links": [
        "https://catalog.uic.edu/azindex/",
        "https://catalog.uic.edu/",
        "http://www.uic.edu/",
        "https://catalog.uic.edu/ucat/",
        "https://catalog.uic.edu/gcat",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://catalog.uic.edu/ucat/the-university/",
        "https://catalog.uic.edu/ucat/admissions-registration-finances/",
        "https://catalog.uic.edu/ucat/degree-programs/",
        "https://catalog.uic.edu/ucat/colleges-depts/",
        "https://catalog.uic.edu/ucat/colleges-depts/applied-health-sciences/",
        "https://catalog.uic.edu/ucat/colleges-depts/architecture-design-arts/",
        "https://catalog.uic.edu/ucat/colleges-depts/business-administration/actg/",
        "https://catalog.uic.edu/ucat/colleges-depts/business-administration/fin/",
        "https://catalog.uic.edu/ucat/colleges-depts/business-administration/ids/",
        "https://catalog.uic.edu/ucat/colleges-depts/business-administration/mgmt/",
        "https://catalog.uic.edu/ucat/colleges-depts/business-administration/bba/",
        "https://catalog.uic.edu/ucat/colleges-depts/business-administration/minors/",
        "https://catalog.uic.edu/ucat/colleges-depts/education/",
        "https://catalog.uic.edu/ucat/colleges-depts/engineering/",
        "https://catalog.uic.edu/ucat/colleges-depts/honors-college/",
        "https://catalog.uic.edu/ucat/colleges-depts/liberal-arts-sciences/",
        "https://catalog.uic.edu/ucat/colleges-depts/nursing/",
        "https://catalog.uic.edu/ucat/colleges-depts/pharmacy/",
        "https://catalog.uic.edu/ucat/colleges-depts/public-health/",
        "https://catalog.uic.edu/ucat/colleges-depts/urban-planning-public-affairs/",
        "https://catalog.uic.edu/ucat/colleges-depts/council-teacher-education/",
        "https://catalog.uic.edu/ucat/course-descriptions/",
        "https://catalog.uic.edu/ucat/archive-links/",
        "https://catalog.uic.edu/gcat/",
        "https://catalog.uic.edu/all-course-descriptions/",
        "http://business.uic.edu/",
        "http://business.uic.edu/ugrad",
        "https://catalog.uic.edu/search/?P=ENGL+160",
        "https://catalog.uic.edu/search/?P=ENGL+161",
        "https://catalog.uic.edu/search/?P=ECON+120",
        "https://catalog.uic.edu/search/?P=ECON+121",
        "https://catalog.uic.edu/search/?P=BA+100",
        "https://catalog.uic.edu/search/?P=BA+220",
        "https://catalog.uic.edu/search/?P=BA+320",
        "https://catalog.uic.edu/search/?P=BA+420",
        "https://catalog.uic.edu/search/?P=MATH+180",
        "https://catalog.uic.edu/search/?P=MATH+181",
        "https://catalog.uic.edu/search/?P=MATH+125",
        "https://catalog.uic.edu/search/?P=MATH+165",
        "https://catalog.uic.edu/search/?P=COMM+100",
        "https://catalog.uic.edu/search/?P=BA+395",
        "https://catalog.uic.edu/ucat/degree-programs/general-education/",
        "https://catalog.uic.edu/search/?P=ACTG+210",
        "https://catalog.uic.edu/search/?P=ACTG+211",
        "https://catalog.uic.edu/search/?P=BA+200",
        "https://catalog.uic.edu/search/?P=FIN+301",
        "https://catalog.uic.edu/search/?P=FIN+302",
        "https://catalog.uic.edu/search/?P=IDS+200",
        "https://catalog.uic.edu/search/?P=IDS+270",
        "https://catalog.uic.edu/search/?P=IDS+355",
        "https://catalog.uic.edu/search/?P=MGMT+340",
        "https://catalog.uic.edu/search/?P=MGMT+350",
        "https://catalog.uic.edu/search/?P=MKTG+360",
        "https://catalog.uic.edu/search/?P=ECON+300",
        "https://catalog.uic.edu/search/?P=FIN+330",
        "https://catalog.uic.edu/search/?P=IDS+371",
        "https://catalog.uic.edu/search/?P=MKTG+462",
        "https://catalog.uic.edu/search/?P=ACTG+484",
        "https://catalog.uic.edu/search/?P=ECON+333",
        "https://catalog.uic.edu/search/?P=FIN+442",
        "https://catalog.uic.edu/search/?P=MGMT+460",
        "https://catalog.uic.edu/search/?P=MKTG+469",
        "https://catalog.uic.edu/search/?P=IDS+495",
        "https://catalog.uic.edu/search/?P=MGMT+495",
        "https://catalog.uic.edu/search/?P=MATH+090",
        "https://catalog.uic.edu/search/?P=MATH+110",
        "https://catalog.uic.edu/search/?P=BA+289",
        "https://catalog.uic.edu/search/?P=ENGL+070",
        "https://catalog.uic.edu/search/?P=ENGL+071",
        "https://catalog.uic.edu/search/?P=MATH+118",
        "https://catalog.uic.edu/search/?P=MATH+121",
        "https://catalog.uic.edu/search/?P=MATH+140",
        "https://catalog.uic.edu/search/?P=MATH+141",
        "http://www.catalog.uic.edu/ucat/degree-programs/univ-degree-requirements-graduation",
        "http://my.uic.edu/common/",
        "http://businessconnect.uic.edu/",
        "http://business.uic.edu/liautaud-graduate-school-business-uic",
        "https://businessconnect.uic.edu/student-services/academic-resources",
        "https://catalog.uic.edu/search/?P=MATH+160",
        "https://admissions.uic.edu/undergraduate/undergraduate-requirements-deadlines/transfer-requirements/transfer",
        "https://businessconnect.uic.edu/undergraduate",
        "https://businessconnect.uic.edu/student-services/scholarships",
        "http://campusprograms.uic.edu/",
        "https://businessconnect.uic.edu/business-career-center",
        "https://businessconnect.uic.edu/business-career-center/services",
        "https://businessconnect.uic.edu/undergrad/current-undergrad-students/",
        "http://admissions.uic.edu/apply-now",
        "http://admissions.uic.edu/contact-admissions"
    ]
}