{
    "url": "https://catalog.uic.edu/ucat/colleges-depts/urban-planning-public-affairs/",
    "title": "College of Urban Planning and Public Affairs < University of Illinois at Chicago",
    "text": [
        "The College of Urban Planning and Public Affairs (CUPPA) promotes just, resilient, and livable communities in the world’s cities and metropolitan areas.  As an internationally recognized leader in education, research, and engagement, it provides innovative education in urban planning, public administration, urban studies, and public policy. It strives for academic excellence to provide inspirational learning experiences for our students and to make contributions beyond the university.",
        "To earn a College of Urban Planning and Public Affairs degree from UIC, students need to complete university, college, and department degree requirements. University and college degree requirements for all College of Urban Planning and Public Affairs students are outlined below. Students should consult their academic department section for major course requirements.",
        "The College of Urban Planning and Public Affairs semester hour requirement is determined by program:",
        "See academic department sections for specific course requirements.",
        "General Education at UIC is designed to serve as a foundation for lifelong learning. Students are required to complete a minimum of 24 semester hours in the General Education Core with at least one course from each of the following categories:",
        "For a description and a list of courses for each General Education Core category, students should consult the General Education section of the catalog. Information on meeting the General Education requirements for CUPPA programs are listed in the respective academic department sections.",
        "College of Urban Planning and Public Affairs students must meet the University Writing Requirement. Students in the Urban Studies program must also meet a Foreign Language requirement.",
        "All students must earn a passing grade in ENGL 160 and ENGL 161 or equivalent.",
        "Urban Studies students must earn 8 hours in a single language or the equivalent.",
        "All incoming first-year students, including transfer students who enter with less than 24 hours and those admitted in the spring semester, must take the two-course first-year seminar, UPA 120 and UPA 121, during their first and second term at UIC. Satisfactory completion of the seminar is a graduation requirement.",
        "Students must earn a cumulative grade point average of 2.00/4.00 in all work applied to CUPPA’s undergraduate degrees. In addition, the combined average of a student’s transfer work and work taken at UIC must be at least 2.00. The grade point average for all degree-specific course work must be at least 2.50. This includes 45 hours of core program requirements for the BA in Public Policy and 60 hours of required courses and selectives for the BA in Urban Studies (see departmental pages for additional information on these courses).",
        "A student must earn a minimum of 40 semester hours in advanced-level courses (those numbered 200 and above at UIC) at any accredited four-year college or university. At least 12 semester of these 40 advanced hours must be taken in the major field while in enrollment residence at UIC. Community college work, regardless of the course number, is not considered advanced for the purposes of this requirement.",
        "Students declare their intent to graduate online using my.UIC. The deadline for submission to the Pending Degree List is the end of the third week (fall and spring) or second week (Summer Session 2) of the term in which graduation is sought. Failure to submit the request at this time may delay the awarding of the degree. A final review will be made following the close of the term. If a student has satisfactorily completed all the degree requirements, the student’s name will be placed on the official degree list.",
        "See the University Degree Requirements, Graduation, and Commencement section of the catalog for a complete description of this requirement.",
        "Transfer guides are available for most colleges in the Chicago area and can be found on the Admissions website.",
        "The following policies apply to undergraduate students enrolled in the College of Urban Planning and Public Administration.",
        "Students may enroll in either a part-time or full-time program of study, in either day or evening classes. During the fall and spring semesters, a minimum full-time program is 12 semester hours. A program of 19 semester hours or more must be approved by the appropriate director of undergraduate studies. For Summer Session 1 (four-week) and Summer Session 2 (eight-week), UIC considers a total aggregate of 6 semester hours (5 hours for graduate students) as the minimum number necessary to constitute full-time enrollment. A program of 13 semester hours or more during the summer session must be approved by the appropriate director of undergraduate studies.",
        "Students will be placed on academic probation in any term in which either a cumulative or semester grade point average of less than 2.00/4.00 is earned. A student on probation is expected to earn greater than a 2.00 in the next term and have a UIC cumulative grade point average of 2.00 by the end of the second term on probation.",
        "Students failing to earn the cumulative grade point average required by their program by the end of two terms on probation will be dismissed from the university following a careful review of their situation; in very exceptional cases, upon the discretion of the program director, students may be given extra time to bring their grade point average to the required level. In any term, a student may be dismissed for one or more of the following reasons:",
        "The dean may waive the dismissal rules in extraordinary circumstances.",
        "Students who have been dismissed by the college may apply for readmission after two terms (excluding the summer session). Students who can document that poor academic performance was the result of significant extenuating circumstances, such as a long-term or debilitating illness or personal crisis, may petition for immediate reinstatement. The student must make arrangements for an interview, with supporting documentation, with the director of undergraduate studies or dean prior to the first day of instruction of the new term.",
        "Undergraduate students may drop courses using my.UIC through the end of the second week of classes for fall and spring semesters, the first Wednesday of Summer Session 1, or the first Friday of Summer Session 2. During weeks 3 through 10 of the fall and spring semesters (first Thursday through the second Wednesday of Summer Session 1 or weeks 2 through 5 of Summer Session 2) students may drop courses with the permission of their major college. If the drop occurs between 0 and 2 weeks in fall and spring, there will be no notation on the transcript. If the drop occurs during weeks 3 through 10 in fall and spring (first Thursday through the second Wednesday of Summer Session 1 or weeks 2 through 5 of Summer Session 2), a W is noted on the transcript. Undergraduate students may drop a maximum of 4 UIC individual courses that result in a W notation on their transcript during their entire undergraduate degree program.",
        "Each instructor establishes the attendance policy for the class, including penalties for nonattendance. Failure to attend classes does not result in automatic withdrawal from a course. The college expects that students will attend all classes.",
        "A student must satisfy the prerequisites before enrolling in a course. A student enrolling in a course without having met the prerequisites may be withdrawn from the course. Course prerequisites are listed in both the course descriptions in this catalog and the Schedule of Classes. Only the instructor may waive the prerequisite, if given evidence that the student is adequately prepared to pursue the subject.",
        "The credit/no credit option allows the student to complete a course with a grade of credit (CR) or no credit (NC) instead of a letter grade. Courses completed with a grade of CR carry credit and apply toward degree requirements. In general, grades of CR and NC are final and cannot be changed to letter grades. The Public Policy and Urban Studies programs’ policy coincides with campus policy with the following conditions:",
        "Students must apply to take a course credit/no credit, no later than the tenth day of the term (first Wednesday of Summer Session 1 or first Friday of Summer Session 2). After that date, students may not request courses on a credit/no credit basis nor may they change a credit/no credit request previously submitted. It is the responsibility of the student to determine eligibility under the regulations. Students will be informed if they are ineligible and will receive a grade for the course. Students with questions concerning their eligibility should make an appointment with the appropriate director of undergraduate studies.",
        "Students must declare a major that leads to a degree after earning 45 semester hours. Failure to do so will result in a registration hold which will not be lifted until the student has changed their major to one that leads to a degree. Transfer students entering with 45 semester hours or more must declare a major by the end of their first term at UIC. Failure to do so will result in a registration hold which will not be lifted until the student has changed their major to one that leads to a degree. Students who have earned 45 semester hours or more may not change their major to an Undecided Major.",
        "This option is not available in the College of Urban Planning and Public Affairs.",
        "Double degrees consist of two bachelor’s degrees completed concurrently. Double degrees may be possible. Students should consult the college section of the catalog for the second degree program to determine if this option is available.",
        "Students seeking two bachelor’s degrees concurrently must formally request acceptance into the second degree program. Students must complete a minimum of 30 semester hours beyond those required for the first degree and all requirements for each of the degree programs as specified by the college and major department. All students interested in double degrees should discuss this option with an advisor.",
        "Double degrees are not permitted when there is substantial course overlap between the first and second degrees.",
        "Students who obtain double degrees receive a diploma for each degree. No more than two bachelor’s degrees may be awarded concurrently.",
        "Students who have already earned a bachelor’s degree at UIC or another institution are required to follow the same application procedures as all other applicants in order to pursue a second bachelor’s degree. Students must complete all requirements for the second degree as specified by the college and the major department, including a minimum of 30 semester hours beyond those required for the first degree. The UIC enrollment residence requirement must also be met, i.e., the last 30 semester hours for the second degree must be taken at UIC. A second bachelor’s degree is not permitted when there is substantial course overlap between the first and second degrees.",
        "A student must have a minimum 2.00/4.00 grade point average in all course work taken at UIC and must obtain consent of the instructor and the degree program prior to registration. No student may enroll in an independent study course after the tenth day of the term without approval of the director of undergraduate studies.",
        "Any rule, regulation, or action of the Public Policy or Urban Studies programs may be appealed in writing. Petitions are submitted to the appropriate department head. It is the student’s responsibility to provide documentation in support of the petition. Submission of a petition does not imply approval.",
        "All new students are required to either receive advising or attend an orientation program prior to registration.",
        "The undergraduate programs require students to discuss any plan to repeat a course with their academic advisor before they register to repeat the course.",
        "Courses with A or B grades may not be repeated. Normally, courses with a C grade may not be repeated. Courses with D or F grades may be repeated once without written permission. In all cases, the original grade for the course and the grade for each repeat will appear on the transcript. The original grade and the grade for each repeat will be calculated into the grade point average. Only one registration for the course counts toward the total number of credits required for graduation. A course cannot be repeated after receiving credit in a course for which the repeat course is a prerequisite.",
        "To repeat a course more than once due to a grade of D or F requires written permission from the student’s college dean. Students who have been dismissed may not appeal on the grounds of intention to repeat courses. Certain courses may not be repeated; students should consult their college before repeating a course",
        "Students currently enrolled at UIC who want to transfer into the College of Urban and Public Affairs should complete an Intercollege Transfer Application available at the appropriate CUPPA undergraduate program office or from the Dean's office. Students are welcome to discuss possible admission to the Public Policy or Urban Studies degree program with the director of undergraduate studies or the program’s appointed staff advisor. Admission to degree programs in CUPPA is limited to those students in good academic standing who have a UIC grade point average of at least 2.00/4.00 and whose combined UIC and transfer grade point average is at least 2.00. Those students who are accepted into either the Public Policy or Urban Studies degree program are expected to enroll immediately in courses that fulfill degree requirements.",
        "Provided space is available, a minimum 2.50/4.00 grade point average is required for consideration. Please consult the Admissions section of the catalog for more information. See the Office of Admissions Transfer Guide for more information about transfer admission requirements.",
        "A CUPPA undergraduate student who wants to transfer into another UIC college must follow the procedures of that college.",
        "Students may earn a maximum of three semester hours of 100-level Military Science and Naval Science courses. An additional one hour of credit in basic military science is allowed for students who have served for a minimum of six months of extended active duty in any branch of the armed forces for the United States. Students in the BA in Public Policy may be able to apply 200-, 300-, and 400-level Military Science courses to a specialization with approval of an advisor or director of undergraduate studies.",
        "The College of Urban Planning and Public Affairs offers the following minors. Please see departmental listings for more information.",
        "The CUPPA undergraduate programs encourage the intellectual growth and development of the student as an individual. Newly admitted students are required to participate in an advising session prior to their initial registration. To arrange an advising appointment, students may contact the director of undergraduate studies or appropriate departmental staff.",
        "New first-year students entering UIC are required to meet with their academic advisor three times each semester. CUPPA recommends that all transfer students to meet with their academic advisor at least once per semester. The student’s advisor assists students in individual program planning and course selection, as well as discusses with students the feasibility of various career paths based on interest and academic performance. Additionally, advisors can explain college and program rules and requirements and can help resolve special registration problems. In conjunction with this, advisors refer students to additional resources on campus.",
        "The responsibility for selecting courses and meeting graduation requirements rests with the students, who must plan intelligently to make their programs consistent with their goals and with college requirements.",
        "The college recognizes and conforms with the campus-wide honors program. University Honors are awarded to graduating students who satisfy UIC hours residency requirements with a UIC grade point average that falls within the following honors categories:",
        "University Honors will be awarded based on UIC GPA at the end of the term prior to the term of graduation for commencement ceremony purposes. UIC will make permanent adjustments to student transcripts and diploma related to University Honors based on final grades.",
        "Exceptional academic achievement in the College of Urban Planning and Public Affairs is recognized each term by inclusion on the Dean’s List. Eligibility is based on a 3.50/4.00 term GPA with a minimum program of 12 semester hours, exclusive of basic military science and basic activity courses in physical education. At least 9 semester hours must be earned for letter grades, in addition to a grade of Credit earned in any course taken on a credit/no credit basis.",
        "Apply Online | Contact Admissions | Privacy Statement",
        "Having problems accessing this site? Contact the Webmaster.",
        "© 2018-2019 The Board of Trustees of the University of Illinois",
        "",
        "Print this page.",
        "",
        "The PDF will include all information unique to this page.",
        "",
        "All pages in the campus catalog.",
        ""
    ],
    "out_links": [
        "https://catalog.uic.edu/azindex/",
        "https://catalog.uic.edu/",
        "http://www.uic.edu/",
        "https://catalog.uic.edu/ucat/",
        "https://catalog.uic.edu/gcat",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://catalog.uic.edu/ucat/the-university/",
        "https://catalog.uic.edu/ucat/admissions-registration-finances/",
        "https://catalog.uic.edu/ucat/degree-programs/",
        "https://catalog.uic.edu/ucat/colleges-depts/",
        "https://catalog.uic.edu/ucat/colleges-depts/applied-health-sciences/",
        "https://catalog.uic.edu/ucat/colleges-depts/architecture-design-arts/",
        "https://catalog.uic.edu/ucat/colleges-depts/business-administration/",
        "https://catalog.uic.edu/ucat/colleges-depts/education/",
        "https://catalog.uic.edu/ucat/colleges-depts/engineering/",
        "https://catalog.uic.edu/ucat/colleges-depts/honors-college/",
        "https://catalog.uic.edu/ucat/colleges-depts/liberal-arts-sciences/",
        "https://catalog.uic.edu/ucat/colleges-depts/nursing/",
        "https://catalog.uic.edu/ucat/colleges-depts/pharmacy/",
        "https://catalog.uic.edu/ucat/colleges-depts/public-health/",
        "https://catalog.uic.edu/ucat/colleges-depts/urban-planning-public-affairs/pa/",
        "https://catalog.uic.edu/ucat/colleges-depts/urban-planning-public-affairs/upp/",
        "https://catalog.uic.edu/ucat/colleges-depts/council-teacher-education/",
        "https://catalog.uic.edu/ucat/course-descriptions/",
        "https://catalog.uic.edu/ucat/archive-links/",
        "https://catalog.uic.edu/gcat/",
        "https://catalog.uic.edu/all-course-descriptions/",
        "http://www.uic.edu/cuppa",
        "https://catalog.uic.edu/ucat/degree-programs/general-education/",
        "https://catalog.uic.edu/search/?P=ENGL+160",
        "https://catalog.uic.edu/search/?P=ENGL+161",
        "https://catalog.uic.edu/search/?P=UPA+120",
        "https://catalog.uic.edu/search/?P=UPA+121",
        "https://catalog.uic.edu/ucat/degree-programs/univ-degree-requirements-graduation/",
        "https://admissions.uic.edu/undergraduate/undergraduate-requirements-deadlines/transfer-requirements/transfer",
        "https://my.uic.edu/",
        "https://catalog.uic.edu/ucat/admissions-registration-finances/admissions/",
        "http://admissions.uic.edu/apply-now",
        "http://admissions.uic.edu/contact-admissions"
    ]
}