{
    "url": "https://admissions.uic.edu/undergraduate/application-process/newly-admitted-students/first-year-students",
    "title": "First Year Students | UIC Admissions",
    "text": [
        "The checklist and timeline will help you make sure you're on track to enroll at the university.",
        "Immediately",
        "Start by setting up your NetID to access the my.uic.edu portal and other enrollment functions.",
        "ACTIVATE ACCOUNT",
        "You'll need your UIN and token. They are included on admitted student emails.",
        "Any time after you are admitted, but no later than June 1",
        "The deadline has been extended to June 1.",
        "You have until June 1 to accept your offer of admission. Submit your Intent to Enroll at the my.uic.edu portal. UIC does not have an enrollment fee or deposit.",
        "ACCEPT OFFER",
        "It’s important to complete all of the following steps before registration.",
        "",
        "February - July (as soon as possible)",
        "Starting in February, you will be prompted to take placement exams in the my.uic.edu portal. Completing these tests will help guide your course selection for your first semester.",
        "PLACEMENT EXAMS",
        "Early June (Fall)",
        "In response to COVID-19, all new student orientation programs will occur online for Summer 2020. Please check your UIC email account regularly for updates about orientation, academic advising, and registration procedures timelines.",
        "SIGN UP",
        "MORE INFORMATION",
        "Registration begins in April after you complete placement exams",
        "Upon completion of online orientation,you will receive an email from your academic college with instructions about the advising process. Advisors will work with you to register for classes on the my.uic.edu portal.",
        "REGISTRATION",
        "Funding your education can be one of the most difficult parts of earning your degree—but there are resources available. Take advantage of everything we have to offer.",
        "After October 1 and before February 1 (or as soon as possible).",
        "U.S. citizens and permanent residents may apply for need-based federal and state grants, scholarships, loans and work-study. Students who submit FAFSA will also be considered for any institutional aid for which they may be eligible.",
        "FAFSA FORM",
        "FINANCIAL AID INFORMATION",
        "UIC’s federal school code is 001776.",
        "January 1",
        "Tuition is assessed in August, but students can review payment options and set up optional payment plans beginning in January.",
        "PAYMENT PLANS",
        "TUITION & FEES INFORMATION",
        "Over the summer",
        "The university employs thousands of students in a variety of campus positions. There are many different jobs available, including office support aides, tutors, gym personnel, tour guides, call center employees, researchers, production assistants, etc.  UIC Student Employment maintains a job board of available positions.",
        "Student Employment",
        "UIC students can live on campus in a residence hall, or commute from the area. Check out the available resources whether you plan to live on or off campus.",
        "Before March 15, or as soon as possible",
        "Placement for student housing is first come, first served. If you are considering living on campus, you should apply early to maximize your chances for your preferred residence.",
        "CAMPUS HOUSING",
        "Anytime",
        "UIC considers anyone who is not living in university housing a commuter. Students who are considered commuters can live just five minutes away in an apartment or at home with their parents.  The Commuter Student Resource Center can help connect you with other commuting students and provide you with information to improve your experience.",
        "COMMUTER INFORMATION",
        "Before August 1",
        "Send any AP exam scores, official ACT or SAT scores, and your final transcripts once you have graduated from high school.",
        "Registration begins in May",
        "Get ahead by joining us for Summer College. Our programs are tuition free and fun, but they also prep you for the fall.",
        "UIC does not currently have an enrollment deposit. You can secure your space in the incoming class by responding \"yes\" to the Intent to Enroll section in the my.uic.edu student portal.",
        "Scholarships are one of several forms of assistance that may be offered to applicants as part of their financial award. Scholarships may be included in the award package, or may come independently from different sources (the Honors College, a particular college or department, an outside organization, etc.). There is not a single schedule that determines when these awards are announced. Generally, most scholarship notifications will be sent by the end of April.  See the Office of Financial Aid for more information.",
        "Recommended courses will depend on the results of your placement tests, your major and your availability. Classes are selected in the my.uic.edu portal. Prepare for registration by reviewing the undergraduate catalog.",
        "Advanced placement credit is awarded as a result of the scores received on the appropriate exams, not by taking the class alone. Please review our Credit by Examination page for detailed information.",
        "No need to worry! All the necessary information to begin at UIC is available on this website. Additionally:",
        "Cost of attendance is a term used by federal government to capture all costs associated with attending a university. The amount is a total of both billable fees (costs that are charged by the university, like tuition and fees), and costs that a student is expected to incur like transportation, living expenses, books and others. It is used primarily for the calculation of your financial aid.",
        "Student tuition is assessed beginning in mid-August but is not officially billed to your account until after the end of the add/drop period (the second week of classes). Tuition and fees are due at the end of September for the fall semester.",
        "Yes, you can still apply to the Honors College even after you've been admitted! If you applied to UIC without indicating your interest in the Honors College, please visit the Honors College website for requirements and a link to a secondary Honors College application. View the Deadlines page for the latest Honors College priority and final deadlines.",
        "1200 West Harrison Street",
        "Chicago, IL 60607-7161",
        "Phone: (312) 996-4350Contact UIC Admissions",
        "1220 West Harrison Street",
        "Chicago, IL 60607-7161",
        "Phone: (312) 413-1726",
        "Office of Undergraduate Admissions (MC 018)",
        "University of Illinois at Chicago",
        "1200 West Harrison Street, Suite 1100",
        "Chicago, IL 60607-7161 Contact Undergraduate Admissions",
        "",
        "The graduate and professional application process is paperless. Please do not mail materials unless expressly requested.Contact Graduate and Professional Admissions",
        "Copyright © 2020 The Board of Trustees of the University of Illinois"
    ],
    "out_links": [
        "https://admissions.uic.edu/",
        "https://admissions.uic.edu/explore-uic",
        "https://nexus.admissions.uic.edu/",
        "https://admissions.uic.edu/apply-now",
        "https://admissions.uic.edu/undergraduate",
        "https://admissions.uic.edu/undergraduate/application-process",
        "https://admissions.uic.edu/undergraduate/application-process/newly-admitted-students",
        "http://my.uic.edu/",
        "http://orientation.uic.edu/",
        "http://financialaid.uic.edu/",
        "https://admissions.uic.edu/undergraduate/tuition-financial-aid",
        "http://studentemployment.uic.edu/",
        "http://housing.uic.edu/",
        "https://csrc.uic.edu/faq/",
        "https://financialaid.uic.edu/types-of-aid/scholarships/",
        "https://catalog.uic.edu/ucat/degree-programs/degree-minors/",
        "https://admissions.uic.edu/explore-uic/information-guidance-counselors/credit-examination",
        "https://honors.uic.edu/admissions/first-year/",
        "https://admissions.uic.edu/undergraduate/requirements-deadlines/deadlines",
        "https://my.uic.edu/",
        "https://admissions.uic.edu/graduate-professional",
        "https://admissions.uic.edu/contact-admissions",
        "https://admissions.uic.edu/undergraduate/contact-undergraduate-admissions",
        "https://admissions.uic.edu/graduate-professional/contact-graduate-and-professional-admissions",
        "http://www.uic.edu/",
        "http://uic.edu/",
        "https://policies.uic.edu/uic-policy-library/access-and-equity/nondiscrimination-policy-statement/",
        "https://admissions.uic.edu/sitemap",
        "https://disabilityresources.uic.edu/",
        "https://admissions.uic.edu/Shibboleth.sso/Login?target=https%3A%2F%2Fadmissions.uic.edu%2F%3Fq%3Dshib_login%2Fnode%2F5",
        "http://disabilityresources.uic.edu/"
    ]
}