{
    "url": "https://catalog.uic.edu/ucat/course-descriptions/cl/",
    "title": "Classics (CL) < University of Illinois at Chicago",
    "text": [
        "CL 101.  Roman Civilization.  3 hours.",
        "",
        "An introduction to the life, society and culture of the ancient Romans. Course Information: All readings are in English.  Past course.",
        "",
        "CL 102.  Introduction to Classical Literature.  3 hours.",
        "",
        "The main literary forms of Classical Antiquity: epic, tragedy, comedy, the philosophical dialogue, history. Course Information: All readings are in English.  Creative Arts course, and  Past course.",
        "",
        "CL 103.  Introduction to Classical and Mediterranean Archaeology.  3 hours.",
        "",
        "Contributions of archaeological excavations to the study of ancient Greece, Rome, Egypt and the Near East; architecture, painting, and sculpture in their social and historical contexts. Course Information: All readings are in English.  Creative Arts course, and  Past course.",
        "",
        "CL 104.  Mediterranean Traditions: Family, Society and the Divine.  3 hours.",
        "",
        "Designed as an introduction to the varieties of cultural, social and religious traditions that collectively constitute Western civilization's foundations.  Past course, and  World Cultures course.",
        "",
        "CL 120.  Introduction to Ancient Philosophy.  3 hours.",
        "",
        "Introduction to issues and methods of philosophy through engagement with classic Greek and Roman texts (read in translation). Course Information: Same as PHIL 120.  Class Schedule Information:  To be properly registered, students must enroll in one Discussion/Recitation and one Lecture.  Individual and Society course, and  Past course.",
        "",
        "CL 124.  Introduction to the Hebrew Bible.  3 hours.",
        "",
        "A study of the Five Books of Moses (a.k.a Torah or Pentateuch) within the contexts of the ancient Near East and biblical literature.  Course Information:  Same as JST 124 and RELS 124.  Taught in English.  Past course.",
        "",
        "CL 201.  Classical Etymology in the Life Sciences.  3 hours.",
        "",
        "The structure and formation of technical terms used in the health sciences, based on roots and elements from Greek and Latin. Course Information: Same as LING 201. Prerequisite(s): Any 100-level biological sciences sequence.",
        "",
        "CL 202.  The Ancient World: Greece.  3 hours.",
        "",
        "Greece from the Mycenaean through the Hellenistic periods; political, social, economic, and religious life of the Greek city-state and the Hellenistic kingdoms. Course Information: Same as HIST 202.  Past course, and  World Cultures course.",
        "",
        "CL 203.  Ancient Rome.  3 hours.",
        "",
        "History of Rome from its origins to the end of the Roman Empire; emphasis on transformation of Rome from city-state to world empire, with attention to social, cultural, and economic background.Course Information: Same as HIST 203.  Past course, and  World Cultures course.",
        "",
        "CL 204.  Greek Art and Archaeology.  3 hours.",
        "",
        "Contributions of archaeological excavations to the study of ancient Greece, 600 BC to 31 BC. Architecture, sculpture and painting in their social and historical contexts. Course Information: Same as AH 204, and HIST 204.  Credit is not given for CL 204 if the student has credit in CL 215. Taught in English.  Creative Arts course, and  Past course.",
        "",
        "CL 205.  Roman Art and Archaeology.  3 hours.",
        "",
        "Contributions of archaeological excavations to the study of ancient Rome and her empire 1000 BC-400 AD. Architecture, sculpture and painting in their social and historical contexts. Course Information: Same as AH 205, and HIST 205.  Creative Arts course, and  Past course.",
        "",
        "CL 208.  Greek Mythology.  3 hours.",
        "",
        "Intensive study of the gods and heroic sagas of the Greeks, through original sources in translation. Course Information: Same as RELS 208. All readings are in English. Prerequisite(s): CL 100 or CL 102 or CL 103 or the equivalent.  Individual and Society course, and  Past course.",
        "",
        "CL 211.  Gender and Sexual Orientation in Greek and Roman Literature.  3 hours.",
        "",
        "Ancient perceptions of gender roles and sexual orientation as they appear in the major authors of Greece and Rome. Course Information: Same as GWS 211. Prerequisite(s): Sophomore standing or above. Recommended background: CL 102.",
        "",
        "CL 218.  Pompeii: Everyday Life in a Roman Town.  3 hours.",
        "",
        "Examination of the Roman town of Pompeii, including its history, society, politics, economy, religion, art, architecture, and entertainments. Course Information: Same as AH 218 and HIST 218. Prerequisite(s): CL 101 or CL 103 or CL 205 or AH 110 or; or consent of the instructor.  Past course.",
        "",
        "CL 219.  Sport in the Ancient World.  3 hours.",
        "",
        "Survey of Greek and Roman sport from the Bronze Age to the demise of pagan athletic festivals in late antiquity (c. fifth century CE). Course Information: Same as HIST 219. Prerequisite(s): Any course in Classics or History. Recommended background: CL 100; CL 101; CL 103; CL 202 or HIST 202; CL 203 or HIST 203; CL 204 or HIST or AH 204; or CL 205 or HIST 205 or AH 205.",
        "",
        "CL 220.  Ancient Philosophy I: Plato and His Predecessors.  3 hours.",
        "",
        "Introduction to Plato and his predecessors in the ancient period. Course Information: Same as PHIL 220. It is recommended that PHIL 220/CL 220 and PHIL 221/CL 221 be taken as a sequence in successive terms. Prerequisite(s): One course in philosophy or consent of the instructor. Class Schedule Information:  To be properly registered, students must enroll in one Discussion/Recitation and one Lecture.",
        "",
        "CL 221.  Ancient Philosophy II: Aristotle and His Successors.  3 hours.",
        "",
        "Introduction to Aristotle and his successors in the ancient period. Course Information: Same as PHIL 221. It is recommended that PHIL 220/CL 220 and PHIL 221/CL 221 be taken as a sequence in successive terms. Prerequisite(s): One course in philosophy or consent of the instructor. Class Schedule Information:  To be properly registered, students must enroll in one Discussion/Recitation and one Lecture.",
        "",
        "CL 225.  Topics in Muslim-Jewish Relations.  3 hours.",
        "",
        "Muslim-Jewish interactions from the rise of Islam until contemporary times, the relationship between Biblical and Quranic materials, the Jewish and Islamic interpretive tradition and the legal systems of the two religious traditions.  Course Information:  Same as JST 225 and RELS 225.",
        "",
        "CL 230.  Italian and Italian American Culture and Civilization.  3 hours.",
        "",
        "Italian and Italian American culture and civilization will explore key moments in Italian social history and its connection to the Italian diaspora. Course Information: Same as ITAL 230. Taught in English. No knowledge of Italian required.  Past course, and  World Cultures course.",
        "",
        "CL 235.  Introduction to Jewish Thought I.  3 hours.",
        "",
        "Introduces students to the fundamental Jewish texts, theology, and thought of the Rabbinic period (100CE - 900 CE). Topics include: ethics, authority, sexuality, exegesis, and law. Course Information: Same as JST 235 and RELS 235. Prerequisite(s): Sophomore standing or above.",
        "",
        "CL 242.  The History of Jewish Biblical Interpretation.  3 hours.",
        "",
        "Jewish interpretation of the Hebrew bible. A survey of the span of Jewish history and the wide range of cultural contexts that have impacted the understanding of the Torah.  Same as JST 242 and RELS 242.  Past course.",
        "",
        "CL 250.  Greek and Roman Epic Poetry.  3 hours.",
        "",
        "The epic poems of Homer, Apollonius of Rhodes, Vergil, and others in the Greco-Roman tradition. Course Information: All readings are in English. Prerequisite(s): CL 100 or CL 101 or CL 102 or CL 103 or the equivalent.  Creative Arts course, and  Past course.",
        "",
        "CL 251.  Greek Tragedy.  3 hours.",
        "",
        "The plays of Aeschylus, Sophocles, and Euripides. Course Information: All readings are in English. Prerequisite(s): CL 100 or CL 102 or CL 103 or CL 106 or the equivalent.  Creative Arts course, and  Past course.",
        "",
        "CL 252.  Greek and Roman Comedy.  3 hours.",
        "",
        "The plays of Aristophanes, Menander, Plautus, and Terence. Course Information: All readings are in English. Prerequisite(s): CL 100 or CL 101 or CL 102 or CL 103 or CL 106 or the equivalent.  Creative Arts course, and  Past course.",
        "",
        "CL 253.  Roman Satire and Rhetoric.  3 hours.",
        "",
        "A survey of Roman literature with special emphasis on satire and rhetoric. Course Information: All readings are in English. Prerequisite(s): CL 100 or CL 101 or CL 102 or CL 103 or CL 106 or the equivalent.  Creative Arts course, and  Past course.",
        "",
        "CL 254.  Prophets in Judaism and Islam.  3 hours.",
        "",
        "A cross-cultural survey of prophets. Texts include the Hebrew Bible, the Quran and Islamic and Jewish exegetical material.  Course Information:  Same as JST 254 and RELS 254.  Past course.",
        "",
        "CL 260.  Near Eastern Myths & Epic.  3 hours.",
        "",
        "Literature and religious traditions from the ancient Near East and Egypt in the first and second millennia BCE. Course Information: All texts read in translation. Prerequisite(s): Completion of the English Composition requirement; or consent of the instructor. Recommended Background:",
        "ARST 209 or ARST 210.",
        "",
        "CL 291.  Topics in Latin Prose Authors.  3 hours.",
        "",
        "Readings in Latin prose chosen from a single author, period, or single genre. Course Information: Same as LAT 291. May be repeated to a maximum of 9 hours if topics vary. Taught in English. Students who register in CL 291 will complete assignments in English translation. Students who register in LAT 291 will complete more than half of the readings in Latin. Prerequisite(s): LAT 104 or equivalent for students who register in LAT 291 only. Recommended background: CL 102. Class Schedule Information: To be properly registered, students must enroll in one Lecture-Discussion and one Discussion.",
        "",
        "CL 297.  Studies in the Classical Tradition.  3 hours.",
        "",
        "Examination of selected texts of ancient Greek and Roman literature, such as the novel, drama, and epic, and how they inform English and American literature and culture.  Course Information:  Same as ENGL 297.  Prerequisite(s):  CL 102; or consent of the instructor.  Creative Arts course, and  Past course.",
        "",
        "CL 298.  Topics in Classical Civilization.  3 hours.",
        "",
        "Selected topics at an intermediate level in Greek and Roman civilization. Course Information: May be repeated. Students may register in more than one section per term. All readings are in English. Prerequisite(s): Any 100-level classics course or the equivalent.",
        "",
        "CL 299.  Independent Reading: Special Topics in Classics in Translation.  3 hours.",
        "",
        "Individual study under faculty direction. Reading and papers on chosen topics for qualified students based on preparation and interest; students must confer with faculty. Course Information: May be repeated. Students may register in more than one section per term. Prerequisite(s): Consent of the instructor and department. Class Schedule Information: This course counts toward the limited number of independent study hours accepted toward the degree and the major.",
        "",
        "CL 304.  Alexander the Great and the Hellenistic World.  3 hours.",
        "",
        "Examines the career of Alexander the Great of Macedon and his legacy in Greece, Egypt and the Near East, up until the arrival of the Romans. Course Information: Same as AH 304. Prerequisite(s): Sophomore standing or above.",
        "",
        "CL 340.  The Iliad of Homer.  3 hours.",
        "",
        "Examines the Iliad of Homer. It involves analysis of the structure of the narrative, close examination of characters and a historical commentary of the Archaic period of Greece.",
        "",
        "CL 390.  Seminar in Mediterranean Literature.  3 hours.",
        "",
        "Comparative readings in selected texts from the literatures of Ancient Greece, Judaism, Christianity and Islam with an emphasis on writing and research skills.  Course Information:  May be repeated to a maximum of 6 hours.  Recommended background:  Grade of B or better in CL 104.",
        "",
        "CL 391.  Topics in Latin Poetry.  3 hours.",
        "",
        "Advanced readings in Latin poetry chosen from a single author, period, or single genre in different periods. Course Information: Same as LAT 391. May be repeated to a maximum of 9 hours if topics vary. Taught in English. Students who register in CL 391 will complete assignments in English translation. Students who register in LAT 391 will complete more than half of the readings in Latin. Prerequisite(s): CL 250 or CL 252 or CL 253; or consent of the instructor; and LAT 291 or the equivalent for students who register for LAT 391 only. Recommended background: CL 102. Class Schedule Information: To be properly registered, students must enroll in one Lecture-Discussion and one Discussion.",
        "",
        "CL 398.  Advanced Topics in Classical Civilization.  3 hours.",
        "",
        "Advanced study of topics in Greek and Roman civilization. Emphasis on writing and research skills. Sample topic: Latin historiography. Course Information: May be repeated. Students may register in more than one section per term. Prerequisite(s): At least two classics courses at the 100- or 200-level.",
        "",
        "CL 399.  Independent Study: Honors Project.  1-3 hours.",
        "",
        "Selected topics for individual study. Course Information: Restricted to students seeking Highest Distinction in Classics. Prerequisite(s): A minimum 3.75/4.00 GPA in major courses and the completion of and/or concurrent registration in four advanced 200- and/or 300-level courses in the major, in consultation with the academic advisor.",
        "",
        "CL 401.  Topics in Greek History.  3 or 4 hours.",
        "",
        "Specific topics are announced each term. Course Information: Same as HIST 401. 3 undergraduate hours. 4 graduate hours. May be repeated. Prerequisite(s): 3 hours of history or classics.",
        "",
        "CL 405.  Herodotus and His World.  3 or 4 hours.",
        "",
        "Examines the Histories of Herodotus - both the text and the culture of Classical Greece compared to the Near East and Egypt. Course Information: Same as HIST 405. 3 undergraduate hours. 4 graduate hours. Prerequisite(s): Sophomore standing or above.",
        "",
        "CL 408.  Athenian Democracy and Society in the Age of Aristophanes.  3 or 4 hours.",
        "",
        "A careful examination of the comedies of Aristophanes, his acute criticism of Athenian politics, and his account of the war between Athens and Sparta. Course Information: Same as HIST 408. 3 undergraduate hours. 4 graduate hours. Prerequisite(s): CL 202. Recommended background: one of the following courses: CL 251, CL 252, CL 405 or HIST 405.",
        "",
        "CL 466.  Material Worlds: Topics in Material Culture Studies.  3 or 4 hours.",
        "",
        "Examines current theories of material culture, drawn from art history, archaeology and anthropology to reflect on technologies of production and social life of things. Case studies  will be drawn from ancient, medieval and modern historical context. Course Information: Same as AH 466 and ANTH 466. 3 undergraduate hours. 4 graduate hours.",
        "",
        "CL 499.  Advanced Independent Study.  3 or 4 hours.",
        "",
        "Advanced independent study under faculty direction. Reading and papers on chosen topics for qualified students based on preparation and interest. Students must consult with faculty. Course Information: 3 undergraduate hours. 4 graduate hours. May be repeated. Students may register in more than one section per term. Prerequisite(s): Consent of the faculty member and department. Class Schedule Information: This course counts toward the limited number of independent study hours accepted toward the undergraduate degree and the major.",
        "",
        "Apply Online | Contact Admissions | Privacy Statement",
        "Having problems accessing this site? Contact the Webmaster.",
        "© 2018-2019 The Board of Trustees of the University of Illinois",
        "",
        "Print this page.",
        "",
        "The PDF will include all information unique to this page.",
        "",
        "All pages in the campus catalog.",
        ""
    ],
    "out_links": [
        "https://catalog.uic.edu/azindex/",
        "https://catalog.uic.edu/",
        "http://www.uic.edu/",
        "https://catalog.uic.edu/ucat/",
        "https://catalog.uic.edu/gcat",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://catalog.uic.edu/ucat/the-university/",
        "https://catalog.uic.edu/ucat/admissions-registration-finances/",
        "https://catalog.uic.edu/ucat/degree-programs/",
        "https://catalog.uic.edu/ucat/colleges-depts/",
        "https://catalog.uic.edu/ucat/course-descriptions/",
        "https://catalog.uic.edu/ucat/course-descriptions/asp/",
        "https://catalog.uic.edu/ucat/course-descriptions/actg/",
        "https://catalog.uic.edu/ucat/course-descriptions/aast/",
        "https://catalog.uic.edu/ucat/course-descriptions/anat/",
        "https://catalog.uic.edu/ucat/course-descriptions/anth/",
        "https://catalog.uic.edu/ucat/course-descriptions/ahs/",
        "https://catalog.uic.edu/ucat/course-descriptions/arab/",
        "https://catalog.uic.edu/ucat/course-descriptions/arst/",
        "https://catalog.uic.edu/ucat/course-descriptions/arch/",
        "https://catalog.uic.edu/ucat/course-descriptions/art/",
        "https://catalog.uic.edu/ucat/course-descriptions/ah/",
        "https://catalog.uic.edu/ucat/course-descriptions/bcmg/",
        "https://catalog.uic.edu/ucat/course-descriptions/bioe/",
        "https://catalog.uic.edu/ucat/course-descriptions/bios/",
        "https://catalog.uic.edu/ucat/course-descriptions/bhis/",
        "https://catalog.uic.edu/ucat/course-descriptions/bps/",
        "https://catalog.uic.edu/ucat/course-descriptions/bstt/",
        "https://catalog.uic.edu/ucat/course-descriptions/ba/",
        "https://catalog.uic.edu/ucat/course-descriptions/cc/",
        "https://catalog.uic.edu/ucat/course-descriptions/cst/",
        "https://catalog.uic.edu/ucat/course-descriptions/cees/",
        "https://catalog.uic.edu/ucat/course-descriptions/che/",
        "https://catalog.uic.edu/ucat/course-descriptions/chem/",
        "https://catalog.uic.edu/ucat/course-descriptions/chin/",
        "https://catalog.uic.edu/ucat/course-descriptions/cme/",
        "https://catalog.uic.edu/ucat/course-descriptions/comm/",
        "https://catalog.uic.edu/ucat/course-descriptions/chsc/",
        "https://catalog.uic.edu/ucat/course-descriptions/cs/",
        "https://catalog.uic.edu/ucat/course-descriptions/clj/",
        "https://catalog.uic.edu/ucat/course-descriptions/ci/",
        "https://catalog.uic.edu/ucat/course-descriptions/des/",
        "https://catalog.uic.edu/ucat/course-descriptions/dlg/",
        "https://catalog.uic.edu/ucat/course-descriptions/dhd/",
        "https://catalog.uic.edu/ucat/course-descriptions/eaes/",
        "https://catalog.uic.edu/ucat/course-descriptions/econ/",
        "https://catalog.uic.edu/ucat/course-descriptions/ed/",
        "https://catalog.uic.edu/ucat/course-descriptions/edps/",
        "https://catalog.uic.edu/ucat/course-descriptions/epsy/",
        "https://catalog.uic.edu/ucat/course-descriptions/ece/",
        "https://catalog.uic.edu/ucat/course-descriptions/engr/",
        "https://catalog.uic.edu/ucat/course-descriptions/engl/",
        "https://catalog.uic.edu/ucat/course-descriptions/entr/",
        "https://catalog.uic.edu/ucat/course-descriptions/fin/",
        "https://catalog.uic.edu/ucat/course-descriptions/fr/",
        "https://catalog.uic.edu/ucat/course-descriptions/gws/",
        "https://catalog.uic.edu/ucat/course-descriptions/geog/",
        "https://catalog.uic.edu/ucat/course-descriptions/ger/",
        "https://catalog.uic.edu/ucat/course-descriptions/glas/",
        "https://catalog.uic.edu/ucat/course-descriptions/gka/",
        "https://catalog.uic.edu/ucat/course-descriptions/gkm/",
        "https://catalog.uic.edu/ucat/course-descriptions/gamd/",
        "https://catalog.uic.edu/ucat/course-descriptions/him/",
        "https://catalog.uic.edu/ucat/course-descriptions/heb/",
        "https://catalog.uic.edu/ucat/course-descriptions/hnur/",
        "https://catalog.uic.edu/ucat/course-descriptions/hist/",
        "https://catalog.uic.edu/ucat/course-descriptions/hon/",
        "https://catalog.uic.edu/ucat/course-descriptions/hn/",
        "https://catalog.uic.edu/ucat/course-descriptions/hum/",
        "https://catalog.uic.edu/ucat/course-descriptions/ie/",
        "https://catalog.uic.edu/ucat/course-descriptions/ids/",
        "https://catalog.uic.edu/ucat/course-descriptions/it/",
        "https://catalog.uic.edu/ucat/course-descriptions/idea/",
        "https://catalog.uic.edu/ucat/course-descriptions/iphs/",
        "https://catalog.uic.edu/ucat/course-descriptions/isa/",
        "https://catalog.uic.edu/ucat/course-descriptions/inst/",
        "https://catalog.uic.edu/ucat/course-descriptions/ital/",
        "https://catalog.uic.edu/ucat/course-descriptions/jpn/",
        "https://catalog.uic.edu/ucat/course-descriptions/jst/",
        "https://catalog.uic.edu/ucat/course-descriptions/kn/",
        "https://catalog.uic.edu/ucat/course-descriptions/kor/",
        "https://catalog.uic.edu/ucat/course-descriptions/lat/",
        "https://catalog.uic.edu/ucat/course-descriptions/lals/",
        "https://catalog.uic.edu/ucat/course-descriptions/las/",
        "https://catalog.uic.edu/ucat/course-descriptions/lib/",
        "https://catalog.uic.edu/ucat/course-descriptions/ling/",
        "https://catalog.uic.edu/ucat/course-descriptions/lcsl/",
        "https://catalog.uic.edu/ucat/course-descriptions/lith/",
        "https://catalog.uic.edu/ucat/course-descriptions/mgmt/",
        "https://catalog.uic.edu/ucat/course-descriptions/mktg/",
        "https://catalog.uic.edu/ucat/course-descriptions/meng/",
        "https://catalog.uic.edu/ucat/course-descriptions/mcs/",
        "https://catalog.uic.edu/ucat/course-descriptions/math/",
        "https://catalog.uic.edu/ucat/course-descriptions/mtht/",
        "https://catalog.uic.edu/ucat/course-descriptions/me/",
        "https://catalog.uic.edu/ucat/course-descriptions/pmmp/",
        "https://catalog.uic.edu/ucat/course-descriptions/mim/",
        "https://catalog.uic.edu/ucat/course-descriptions/mils/",
        "https://catalog.uic.edu/ucat/course-descriptions/movi/",
        "https://catalog.uic.edu/ucat/course-descriptions/muse/",
        "https://catalog.uic.edu/ucat/course-descriptions/mus/",
        "https://catalog.uic.edu/ucat/course-descriptions/nast/",
        "https://catalog.uic.edu/ucat/course-descriptions/nats/",
        "https://catalog.uic.edu/ucat/course-descriptions/ns/",
        "https://catalog.uic.edu/ucat/course-descriptions/neus/",
        "https://catalog.uic.edu/ucat/course-descriptions/nurs/",
        "https://catalog.uic.edu/ucat/course-descriptions/nuel/",
        "https://catalog.uic.edu/ucat/course-descriptions/ot/",
        "https://catalog.uic.edu/ucat/course-descriptions/path/",
        "https://catalog.uic.edu/ucat/course-descriptions/pcol/",
        "https://catalog.uic.edu/ucat/course-descriptions/phar/",
        "https://catalog.uic.edu/ucat/course-descriptions/pmpr/",
        "https://catalog.uic.edu/ucat/course-descriptions/psop/",
        "https://catalog.uic.edu/ucat/course-descriptions/phil/",
        "https://catalog.uic.edu/ucat/course-descriptions/pt/",
        "https://catalog.uic.edu/ucat/course-descriptions/phys/",
        "https://catalog.uic.edu/ucat/course-descriptions/phyb/",
        "https://catalog.uic.edu/ucat/course-descriptions/pol/",
        "https://catalog.uic.edu/ucat/course-descriptions/pols/",
        "https://catalog.uic.edu/ucat/course-descriptions/port/",
        "https://catalog.uic.edu/ucat/course-descriptions/psch/",
        "https://catalog.uic.edu/ucat/course-descriptions/pa/",
        "https://catalog.uic.edu/ucat/course-descriptions/pubh/",
        "https://catalog.uic.edu/ucat/course-descriptions/ppol/",
        "https://catalog.uic.edu/ucat/course-descriptions/ppa/",
        "https://catalog.uic.edu/ucat/course-descriptions/rels/",
        "https://catalog.uic.edu/ucat/course-descriptions/russ/",
        "https://catalog.uic.edu/ucat/course-descriptions/slav/",
        "https://catalog.uic.edu/ucat/course-descriptions/sj/",
        "https://catalog.uic.edu/ucat/course-descriptions/soc/",
        "https://catalog.uic.edu/ucat/course-descriptions/span/",
        "https://catalog.uic.edu/ucat/course-descriptions/sped/",
        "https://catalog.uic.edu/ucat/course-descriptions/stat/",
        "https://catalog.uic.edu/ucat/course-descriptions/sabr/",
        "https://catalog.uic.edu/ucat/course-descriptions/thtr/",
        "https://catalog.uic.edu/ucat/course-descriptions/upa/",
        "https://catalog.uic.edu/ucat/course-descriptions/upp/",
        "https://catalog.uic.edu/ucat/course-descriptions/us/",
        "https://catalog.uic.edu/ucat/archive-links/",
        "https://catalog.uic.edu/gcat/",
        "https://catalog.uic.edu/all-course-descriptions/",
        "https://catalog.uic.edu/search/?P=PHIL+120",
        "https://catalog.uic.edu/search/?P=JST+124",
        "https://catalog.uic.edu/search/?P=RELS+124",
        "https://catalog.uic.edu/search/?P=LING+201",
        "https://catalog.uic.edu/search/?P=HIST+202",
        "https://catalog.uic.edu/search/?P=HIST+203",
        "https://catalog.uic.edu/search/?P=AH+204",
        "https://catalog.uic.edu/search/?P=HIST+204",
        "https://catalog.uic.edu/search/?P=CL+204",
        "https://catalog.uic.edu/search/?P=AH+205",
        "https://catalog.uic.edu/search/?P=HIST+205",
        "https://catalog.uic.edu/search/?P=RELS+208",
        "https://catalog.uic.edu/search/?P=CL+100",
        "https://catalog.uic.edu/search/?P=CL+102",
        "https://catalog.uic.edu/search/?P=CL+103",
        "https://catalog.uic.edu/search/?P=GWS+211",
        "https://catalog.uic.edu/search/?P=AH+218",
        "https://catalog.uic.edu/search/?P=HIST+218",
        "https://catalog.uic.edu/search/?P=CL+101",
        "https://catalog.uic.edu/search/?P=CL+205",
        "https://catalog.uic.edu/search/?P=AH+110",
        "https://catalog.uic.edu/search/?P=HIST+219",
        "https://catalog.uic.edu/search/?P=CL+202",
        "https://catalog.uic.edu/search/?P=CL+203",
        "https://catalog.uic.edu/search/?P=PHIL+220",
        "https://catalog.uic.edu/search/?P=CL+220",
        "https://catalog.uic.edu/search/?P=PHIL+221",
        "https://catalog.uic.edu/search/?P=CL+221",
        "https://catalog.uic.edu/search/?P=JST+225",
        "https://catalog.uic.edu/search/?P=RELS+225",
        "https://catalog.uic.edu/search/?P=ITAL+230",
        "https://catalog.uic.edu/search/?P=RELS+235",
        "https://catalog.uic.edu/search/?P=JST+242",
        "https://catalog.uic.edu/search/?P=RELS+242",
        "https://catalog.uic.edu/search/?P=RELS+254",
        "https://catalog.uic.edu/search/?P=ARST+209",
        "https://catalog.uic.edu/search/?P=ARST+210",
        "https://catalog.uic.edu/search/?P=LAT+291",
        "https://catalog.uic.edu/search/?P=CL+291",
        "https://catalog.uic.edu/search/?P=LAT+104",
        "https://catalog.uic.edu/search/?P=ENGL+297",
        "https://catalog.uic.edu/search/?P=AH+304",
        "https://catalog.uic.edu/search/?P=CL+104",
        "https://catalog.uic.edu/search/?P=LAT+391",
        "https://catalog.uic.edu/search/?P=CL+391",
        "https://catalog.uic.edu/search/?P=CL+250",
        "https://catalog.uic.edu/search/?P=CL+252",
        "https://catalog.uic.edu/search/?P=CL+253",
        "https://catalog.uic.edu/search/?P=HIST+401",
        "https://catalog.uic.edu/search/?P=HIST+405",
        "https://catalog.uic.edu/search/?P=HIST+408",
        "https://catalog.uic.edu/search/?P=CL+251",
        "https://catalog.uic.edu/search/?P=CL+405",
        "https://catalog.uic.edu/search/?P=AH+466",
        "https://catalog.uic.edu/search/?P=ANTH+466",
        "http://admissions.uic.edu/apply-now",
        "http://admissions.uic.edu/contact-admissions"
    ]
}