{
    "url": "https://catalog.uic.edu/ucat/course-descriptions/econ/",
    "title": "Economics (ECON) < University of Illinois at Chicago",
    "text": [
        "ECON 111.  Freakonomics.  3 hours.",
        "",
        "Introduction to how economists think about problems;  how economic analysis illuminates current events and puzzles by focusing on people's responses to incentives.  Individual and Society course.",
        "",
        "ECON 120.  Principles of Microeconomics.  0-4 hours.",
        "",
        "Scarcity and choice, price system, decision making by consumers, individual and market demand, optimal input decisions by firms, perfect and imperfect competition, international trade. Course Information: College of Business Administration undergraduate students will enroll for 3 hours and all other students will enroll for 4 hours. Class Schedule Information: To be properly registered, students must enroll in one Lecture and one Discussion.  Individual and Society course, and  US Society course.",
        "",
        "ECON 121.  Principles of Macroeconomics.  0-4 hours.",
        "",
        "Determinants of the level of economic activity, inflation, unemployment, interest rates, the roles of fiscal and monetary policies, exchange rates, international trade. Course Information: College of Business Administration undergraduate students will enroll for 3 hours and all other students will enroll for 4 hours. ECON 121 may be taken before or after taking ECON 120 - this is not a sequence. Class Schedule Information: To be properly registered, students must enroll in one Lecture and one Discussion.  Individual and Society course, and  US Society course.",
        "",
        "ECON 212.  Law and Economics.  3 hours.",
        "",
        "Economic analysis of law and legal processes; economic theory and applications of property law, contract law, and criminal law. Course Information: Previously listed as ECON 320. Prerequisite(s): ECON 120.",
        "",
        "ECON 213.  Economic History of the United States.  3 hours.",
        "",
        "Growth and structural changes in the American economy from colonial times to the present; special emphasis on economic causes and consequences of major events in U.S. history. Course Information: Previously listed at ECON 324. Prerequisite(s): ECON 120.",
        "",
        "ECON 214.  Economics of Education.  3 hours.",
        "",
        "Treatment of educational sector as an industry; demand and supply of education; issues in educational finance;  teacher labor market; school choice. Course Information: Previously listed as ECON 351. Prerequisite(s): ECON 120.",
        "",
        "ECON 215.  Health Economics.  3 hours.",
        "",
        "Supply and demand for health services, the role of insurance in the health care industry, public policy issues, cost and quality regulation. Course Information: Previously listed as ECON 354. Prerequisite(s): ECON 120.",
        "",
        "ECON 216.  Economics of Sports and Entertainment.  3 hours.",
        "",
        "Analysis of economic issues in the sports and entertainment  industries--industrial organization, financing, pricing, labor, and regulatory issues.  Course Information: Previously listed as ECON 350. Prerequisite(s):  ECON 120.",
        "",
        "ECON 220.  Microeconomics: Theory and Applications.  3 hours.",
        "",
        "The price system, consumer behavior, market demand, the firm's technology and costs, perfect and imperfect competition, government regulation, general equilibrium and resource allocation, applications. Course Information: Prerequisite(s): ECON 120; and MATH 121.",
        "",
        "ECON 221.  Macroeconomics in the World Economy: Theory and Applications.  3 hours.",
        "",
        "Determinants of the level of economic activity, inflation, unemployment, international economics, impact of domestic and world economy on business decisions, applications of the theory. Course Information: Same as INST 221. Prerequisite(s): ECON 120 and ECON 121; and MATH 121.",
        "",
        "ECON 270.  Statistics for Economics.  4 hours.",
        "",
        "Descriptive statistics, probability theory, discrete and continuous probability distributions, sampling distributions, estimation, hypothesis testing. Course Information:  Credit is not given for ECON 270 if the student has credit for IDS 270.   Prerequisite(s): MATH 121.  Class Schedule Information:  To be properly registered, students must enroll in one Discussio/Recitation and one Lecture.",
        "",
        "ECON 300.  Econometrics.  3 hours.",
        "",
        "Casual estimation of economic relationships and testing of economic hypotheses; ordinary least squares regression and extensions; evaluating empirical research; specification of econometric models. Course Information: Credit is not given for ECON 300 if the student has credit in ECON 400. Previously listed as ECON 346. Prerequisite(s): ECON 120 or ECON 121; and ECON 270 or IDS 270 or STAT 101.",
        "",
        "ECON 311.  Introduction to Urban Real Estate.  3 hours.",
        "",
        "Introductory survey of urban real estate; business, legal, economic and financial perspectives. Course Information: Same as FIN 311. Previously listed as ECON 371. Prerequisite(s): ECON 120.",
        "",
        "ECON 322.  Managerial Economics.  3 hours.",
        "",
        "Application of economic theory to decision making by business firms; demand and cost analysis, demand forecasts; pricing policies; capital budgeting; production analysis; globalization, multinational corporations, game theory, and market structures. Course Information: Prerequisite(s): ECON 220; and IDS 270 or ECON 270.",
        "",
        "ECON 323.  Business Conditions Analysis.  3 hours.",
        "",
        "Application of economic theory to analysis of changes in aggregate income and employment; quantitative economic models and their uses in the prediction of aggregate and more refined levels of business activity; stabilization theory and policy. Course Information: Prerequisite(s): ECON 221;and ECON 300 or ECON 400 or IDS 371.",
        "",
        "ECON 326.  History of Economic Thought.  3 hours.",
        "",
        "Selected topics in the evolution of positive and normative economics from the seventeenth century to the present. Course Information: Prerequisite(s):  ECON 220 or ECON 221.",
        "",
        "ECON 328.  Public Finance.  3 hours.",
        "",
        "The economic effects of taxes and government expenditures on the allocation of resources and income distribution, public goods and externalities, public choice, the principles and application of cost-benefit analysis; optimal taxation. Course Information: Prerequisite(s): ECON 220.",
        "",
        "ECON 329.  Industrial Organization.  3 hours.",
        "",
        "Theory of the structure of markets; measures of industrial concentration; monopoly power; mergers and takeovers; price discrimination; product differentiation, advertising; research and development. Course Information: Prerequisite(s): ECON 220.",
        "",
        "ECON 330.  Government and Business.  3 hours.",
        "",
        "Theory and survey of U.S. market structure; antitrust policy and monopoly power; economic regulation including price and quality regulation; social regulation. Course Information: Prerequisite(s): ECON 220.",
        "",
        "ECON 331.  Labor Economics.  3 hours.",
        "",
        "Application of economic theory to labor markets and related economic phenomena; earnings, employment, unemployment, immigration, education, minimum wages, discrimination. Course Information: Prerequisite(s): ECON 220.",
        "",
        "ECON 332.  Urban Economics.  3 hours.",
        "",
        "Survey of economic problems of cities; demand for and supply of housing and urban land; residential segregation; suburbanization; impact of government programs. Course Information: Prerequisite(s):  ECON 220.",
        "",
        "ECON 333.  International Economics.  3 hours.",
        "",
        "The balance of payments; fixed and flexible exchange rates; capital flows; comparative advantage; tariffs and quotas; the costs and benefits of international trade. Course Information: Same as INST 333. Prerequisite(s):  ECON 220 or ECON 221 or INST 221.",
        "",
        "ECON 334.  Economic Development.  3 hours.",
        "",
        "Characteristics of poor countries, past experience and its relevance, analytical approaches, the role of exposure to foreign factors, planning and other policies. Course Information: Same as INST 334. Prerequisite(s):  ECON 220 or ECON 221 or INST 221.",
        "",
        "ECON 339.  Monetary Theory.  3 hours.",
        "",
        "Modern money supply and demand theory; the role of money in domestic and international financial markets and in determining economic growth and inflation. Course Information: Prerequisite(s): ECON 221 or FIN 300.",
        "",
        "ECON 342.  Regional Economics.  3 hours.",
        "",
        "Location of economic activity, systems of cities, economic base theory, regional input-output analysis, neo-classical models of factor mobility and local area economic development. Course Information: Prerequisite(s): ECON 220 or ECON 221 or INST 221.",
        "",
        "ECON 344.  Behavioral Economics.  3 hours.",
        "",
        "Systematic analysis of how people actually make economic decisions, combining microeconomic models with insights from psychology; study of predictably irrational behaviors. Course Information: Prerequisite(s): ECON 220.",
        "",
        "ECON 353.  Economic Demography.  3 hours.",
        "",
        "Analysis of family decision making focusing on the economics of time allocation, marriage, divorce, fertility, and mortality; relationship between population growth and economic development. Course Information: Prerequisite(s): ECON 220.",
        "",
        "ECON 370.  Environmental Economics.  3 hours.",
        "",
        "Analysis of major environmental problems as market and policy failures. Benefit-cost methods evaluated. Equity and efficiency aspects of market-based approaches to environmental policy evaluated. Course Information: Prerequisite(s): ECON 220.",
        "",
        "ECON 390.  Special Topics in Economics.  3 hours.",
        "",
        "Exploration of an area not covered in existing course offerings, or study in greater depth of a subject covered in an existing course. Course Information: Prerequisite(s): Consent of the instructor.",
        "",
        "ECON 395.  Research and Writing in Economics.  1 hour.",
        "",
        "This course is used to identify the \"Writing in the Disciplines\" requirement. Development of analytical and writing skills in economics. Course Information: Satisfactory/Unsatisfactory grading only. May be repeated. Students may register in more than one section per term. Prerequisite(s): Concurrent registration in a designated 300-level economics course.",
        "",
        "ECON 399.  Independent Study in Economics.  1-3 hours.",
        "",
        "Independent study in an area not covered by existing courses or exploration in greater depth of issues covered in a previously taken course. Course Information: May be repeated up to 1 time(s). Prerequisite(s): 9 hours of economics courses at the 300-level or above, an overall GPA of at least 3.25 (A=4.00), and consent of a faculty member and the director of undergraduate studies. Class Schedule Information: This course counts toward the limited number of independent study hours accepted toward the LAS degree and the major.",
        "",
        "ECON 400.  Honors Econometrics.  3 or 4 hours.",
        "",
        "Estimation of economic relationships and testing of economic hypotheses;  ordinary least square regression and extensions;  derivations of estimators, proofs of theorems. Course Information: 3 undergraduate hours; 4 graduate hours. Credit is not given for ECON 400 if the student has credit in ECON 300. Prerequisite(s): ECON 120 or ECON 121; and MATH 180; and either ECON 270 or IDS 270.",
        "",
        "ECON 436.  Mathematical Economics.  3 or 4 hours.",
        "",
        "Application of mathematics to theories of consumer and producer behavior, determination of prices in markets, growth and stability features of macroeconomic models. Course Information: 3 undergraduate hours. 4 graduate hours. Prerequisite(s): ECON 220; and MATH 180 or MATH 165.",
        "",
        "ECON 450.  Business Forecasting Using Time Series Methods.  3 or 4 hours.",
        "",
        "Autoregressive, moving average, and seasonal models for time series analysis and business forecasting. Forecasting using multi-variable transfer function models. Course Information: Same as IDS 476. 3 undergraduate hours. 4 graduate hours. Prerequisite(s): IDS 371 or ECON 300 or ECON 400; or consent of the instructor.",
        "",
        "ECON 472.  Real Estate Finance.  3 or 4 hours.",
        "",
        "Finance principles applied to real estate; financing of residential and income-producing real estate; real estate development finance; secondary mortgage market; taxation and real estate finance. Course Information: Same as FIN 472. 3 undergraduate hours. 4 graduate hours.  May not be used to satisfy the Economics credit requirement for the MA in Economics and PhD in Economics.  Elective credit only will be applied toward these degrees. Prerequisite(s): ECON 220.",
        "",
        "ECON 473.  Game Theory.  3 or 4 hours.",
        "",
        "Introduction to the basic ideas of game theory. Static and dynamic games; mixed strategies, imperfect information; economic, political and biological applications. Course Information: Same as STAT 473. 3 undergraduate hours. 4 graduate hours. Prerequisite(s): STAT 381; or ECON 270; or equivalents.",
        "",
        "ECON 481.  Mathematical Methods for Economics.  4 hours.",
        "",
        "Survey of mathematical techniques used in applied economics theory and econometrics courses.",
        "",
        "ECON 482.  Probability and Statistics for Econometrics.  4 hours.",
        "",
        "Introduction to methods in probability and statistics that provide a foundation for the applied econometrics and research design courses.",
        "",
        "ECON 499.  Independent Study in Economics.  1-3 hours.",
        "",
        "Independent study of a topic not covered in a graduate-level course. Course Information: Prerequisite(s): Graduate standing and consent of the director of graduate studies and the instructor.",
        "",
        "Apply Online | Contact Admissions | Privacy Statement",
        "Having problems accessing this site? Contact the Webmaster.",
        "© 2018-2019 The Board of Trustees of the University of Illinois",
        "",
        "Print this page.",
        "",
        "The PDF will include all information unique to this page.",
        "",
        "All pages in the campus catalog.",
        ""
    ],
    "out_links": [
        "https://catalog.uic.edu/azindex/",
        "https://catalog.uic.edu/",
        "http://www.uic.edu/",
        "https://catalog.uic.edu/ucat/",
        "https://catalog.uic.edu/gcat",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://catalog.uic.edu/ucat/the-university/",
        "https://catalog.uic.edu/ucat/admissions-registration-finances/",
        "https://catalog.uic.edu/ucat/degree-programs/",
        "https://catalog.uic.edu/ucat/colleges-depts/",
        "https://catalog.uic.edu/ucat/course-descriptions/",
        "https://catalog.uic.edu/ucat/course-descriptions/asp/",
        "https://catalog.uic.edu/ucat/course-descriptions/actg/",
        "https://catalog.uic.edu/ucat/course-descriptions/aast/",
        "https://catalog.uic.edu/ucat/course-descriptions/anat/",
        "https://catalog.uic.edu/ucat/course-descriptions/anth/",
        "https://catalog.uic.edu/ucat/course-descriptions/ahs/",
        "https://catalog.uic.edu/ucat/course-descriptions/arab/",
        "https://catalog.uic.edu/ucat/course-descriptions/arst/",
        "https://catalog.uic.edu/ucat/course-descriptions/arch/",
        "https://catalog.uic.edu/ucat/course-descriptions/art/",
        "https://catalog.uic.edu/ucat/course-descriptions/ah/",
        "https://catalog.uic.edu/ucat/course-descriptions/bcmg/",
        "https://catalog.uic.edu/ucat/course-descriptions/bioe/",
        "https://catalog.uic.edu/ucat/course-descriptions/bios/",
        "https://catalog.uic.edu/ucat/course-descriptions/bhis/",
        "https://catalog.uic.edu/ucat/course-descriptions/bps/",
        "https://catalog.uic.edu/ucat/course-descriptions/bstt/",
        "https://catalog.uic.edu/ucat/course-descriptions/ba/",
        "https://catalog.uic.edu/ucat/course-descriptions/cc/",
        "https://catalog.uic.edu/ucat/course-descriptions/cst/",
        "https://catalog.uic.edu/ucat/course-descriptions/cees/",
        "https://catalog.uic.edu/ucat/course-descriptions/che/",
        "https://catalog.uic.edu/ucat/course-descriptions/chem/",
        "https://catalog.uic.edu/ucat/course-descriptions/chin/",
        "https://catalog.uic.edu/ucat/course-descriptions/cme/",
        "https://catalog.uic.edu/ucat/course-descriptions/cl/",
        "https://catalog.uic.edu/ucat/course-descriptions/comm/",
        "https://catalog.uic.edu/ucat/course-descriptions/chsc/",
        "https://catalog.uic.edu/ucat/course-descriptions/cs/",
        "https://catalog.uic.edu/ucat/course-descriptions/clj/",
        "https://catalog.uic.edu/ucat/course-descriptions/ci/",
        "https://catalog.uic.edu/ucat/course-descriptions/des/",
        "https://catalog.uic.edu/ucat/course-descriptions/dlg/",
        "https://catalog.uic.edu/ucat/course-descriptions/dhd/",
        "https://catalog.uic.edu/ucat/course-descriptions/eaes/",
        "https://catalog.uic.edu/ucat/course-descriptions/ed/",
        "https://catalog.uic.edu/ucat/course-descriptions/edps/",
        "https://catalog.uic.edu/ucat/course-descriptions/epsy/",
        "https://catalog.uic.edu/ucat/course-descriptions/ece/",
        "https://catalog.uic.edu/ucat/course-descriptions/engr/",
        "https://catalog.uic.edu/ucat/course-descriptions/engl/",
        "https://catalog.uic.edu/ucat/course-descriptions/entr/",
        "https://catalog.uic.edu/ucat/course-descriptions/fin/",
        "https://catalog.uic.edu/ucat/course-descriptions/fr/",
        "https://catalog.uic.edu/ucat/course-descriptions/gws/",
        "https://catalog.uic.edu/ucat/course-descriptions/geog/",
        "https://catalog.uic.edu/ucat/course-descriptions/ger/",
        "https://catalog.uic.edu/ucat/course-descriptions/glas/",
        "https://catalog.uic.edu/ucat/course-descriptions/gka/",
        "https://catalog.uic.edu/ucat/course-descriptions/gkm/",
        "https://catalog.uic.edu/ucat/course-descriptions/gamd/",
        "https://catalog.uic.edu/ucat/course-descriptions/him/",
        "https://catalog.uic.edu/ucat/course-descriptions/heb/",
        "https://catalog.uic.edu/ucat/course-descriptions/hnur/",
        "https://catalog.uic.edu/ucat/course-descriptions/hist/",
        "https://catalog.uic.edu/ucat/course-descriptions/hon/",
        "https://catalog.uic.edu/ucat/course-descriptions/hn/",
        "https://catalog.uic.edu/ucat/course-descriptions/hum/",
        "https://catalog.uic.edu/ucat/course-descriptions/ie/",
        "https://catalog.uic.edu/ucat/course-descriptions/ids/",
        "https://catalog.uic.edu/ucat/course-descriptions/it/",
        "https://catalog.uic.edu/ucat/course-descriptions/idea/",
        "https://catalog.uic.edu/ucat/course-descriptions/iphs/",
        "https://catalog.uic.edu/ucat/course-descriptions/isa/",
        "https://catalog.uic.edu/ucat/course-descriptions/inst/",
        "https://catalog.uic.edu/ucat/course-descriptions/ital/",
        "https://catalog.uic.edu/ucat/course-descriptions/jpn/",
        "https://catalog.uic.edu/ucat/course-descriptions/jst/",
        "https://catalog.uic.edu/ucat/course-descriptions/kn/",
        "https://catalog.uic.edu/ucat/course-descriptions/kor/",
        "https://catalog.uic.edu/ucat/course-descriptions/lat/",
        "https://catalog.uic.edu/ucat/course-descriptions/lals/",
        "https://catalog.uic.edu/ucat/course-descriptions/las/",
        "https://catalog.uic.edu/ucat/course-descriptions/lib/",
        "https://catalog.uic.edu/ucat/course-descriptions/ling/",
        "https://catalog.uic.edu/ucat/course-descriptions/lcsl/",
        "https://catalog.uic.edu/ucat/course-descriptions/lith/",
        "https://catalog.uic.edu/ucat/course-descriptions/mgmt/",
        "https://catalog.uic.edu/ucat/course-descriptions/mktg/",
        "https://catalog.uic.edu/ucat/course-descriptions/meng/",
        "https://catalog.uic.edu/ucat/course-descriptions/mcs/",
        "https://catalog.uic.edu/ucat/course-descriptions/math/",
        "https://catalog.uic.edu/ucat/course-descriptions/mtht/",
        "https://catalog.uic.edu/ucat/course-descriptions/me/",
        "https://catalog.uic.edu/ucat/course-descriptions/pmmp/",
        "https://catalog.uic.edu/ucat/course-descriptions/mim/",
        "https://catalog.uic.edu/ucat/course-descriptions/mils/",
        "https://catalog.uic.edu/ucat/course-descriptions/movi/",
        "https://catalog.uic.edu/ucat/course-descriptions/muse/",
        "https://catalog.uic.edu/ucat/course-descriptions/mus/",
        "https://catalog.uic.edu/ucat/course-descriptions/nast/",
        "https://catalog.uic.edu/ucat/course-descriptions/nats/",
        "https://catalog.uic.edu/ucat/course-descriptions/ns/",
        "https://catalog.uic.edu/ucat/course-descriptions/neus/",
        "https://catalog.uic.edu/ucat/course-descriptions/nurs/",
        "https://catalog.uic.edu/ucat/course-descriptions/nuel/",
        "https://catalog.uic.edu/ucat/course-descriptions/ot/",
        "https://catalog.uic.edu/ucat/course-descriptions/path/",
        "https://catalog.uic.edu/ucat/course-descriptions/pcol/",
        "https://catalog.uic.edu/ucat/course-descriptions/phar/",
        "https://catalog.uic.edu/ucat/course-descriptions/pmpr/",
        "https://catalog.uic.edu/ucat/course-descriptions/psop/",
        "https://catalog.uic.edu/ucat/course-descriptions/phil/",
        "https://catalog.uic.edu/ucat/course-descriptions/pt/",
        "https://catalog.uic.edu/ucat/course-descriptions/phys/",
        "https://catalog.uic.edu/ucat/course-descriptions/phyb/",
        "https://catalog.uic.edu/ucat/course-descriptions/pol/",
        "https://catalog.uic.edu/ucat/course-descriptions/pols/",
        "https://catalog.uic.edu/ucat/course-descriptions/port/",
        "https://catalog.uic.edu/ucat/course-descriptions/psch/",
        "https://catalog.uic.edu/ucat/course-descriptions/pa/",
        "https://catalog.uic.edu/ucat/course-descriptions/pubh/",
        "https://catalog.uic.edu/ucat/course-descriptions/ppol/",
        "https://catalog.uic.edu/ucat/course-descriptions/ppa/",
        "https://catalog.uic.edu/ucat/course-descriptions/rels/",
        "https://catalog.uic.edu/ucat/course-descriptions/russ/",
        "https://catalog.uic.edu/ucat/course-descriptions/slav/",
        "https://catalog.uic.edu/ucat/course-descriptions/sj/",
        "https://catalog.uic.edu/ucat/course-descriptions/soc/",
        "https://catalog.uic.edu/ucat/course-descriptions/span/",
        "https://catalog.uic.edu/ucat/course-descriptions/sped/",
        "https://catalog.uic.edu/ucat/course-descriptions/stat/",
        "https://catalog.uic.edu/ucat/course-descriptions/sabr/",
        "https://catalog.uic.edu/ucat/course-descriptions/thtr/",
        "https://catalog.uic.edu/ucat/course-descriptions/upa/",
        "https://catalog.uic.edu/ucat/course-descriptions/upp/",
        "https://catalog.uic.edu/ucat/course-descriptions/us/",
        "https://catalog.uic.edu/ucat/archive-links/",
        "https://catalog.uic.edu/gcat/",
        "https://catalog.uic.edu/all-course-descriptions/",
        "https://catalog.uic.edu/search/?P=ECON+121",
        "https://catalog.uic.edu/search/?P=ECON+120",
        "https://catalog.uic.edu/search/?P=MATH+121",
        "https://catalog.uic.edu/search/?P=INST+221",
        "https://catalog.uic.edu/search/?P=ECON+270",
        "https://catalog.uic.edu/search/?P=IDS+270",
        "https://catalog.uic.edu/search/?P=ECON+300",
        "https://catalog.uic.edu/search/?P=ECON+400",
        "https://catalog.uic.edu/search/?P=STAT+101",
        "https://catalog.uic.edu/search/?P=FIN+311",
        "https://catalog.uic.edu/search/?P=ECON+220",
        "https://catalog.uic.edu/search/?P=ECON+221",
        "https://catalog.uic.edu/search/?P=IDS+371",
        "https://catalog.uic.edu/search/?P=INST+333",
        "https://catalog.uic.edu/search/?P=INST+334",
        "https://catalog.uic.edu/search/?P=FIN+300",
        "https://catalog.uic.edu/search/?P=MATH+180",
        "https://catalog.uic.edu/search/?P=MATH+165",
        "https://catalog.uic.edu/search/?P=IDS+476",
        "https://catalog.uic.edu/search/?P=FIN+472",
        "https://catalog.uic.edu/search/?P=STAT+473",
        "https://catalog.uic.edu/search/?P=STAT+381",
        "http://admissions.uic.edu/apply-now",
        "http://admissions.uic.edu/contact-admissions"
    ]
}