{
    "url": "https://catalog.uic.edu/ucat/course-descriptions/hon/",
    "title": "Honors College Courses (HON) < University of Illinois at Chicago",
    "text": [
        "HON 120.  Honors Core in Understanding Individual and Society and Understanding the Past.  3 hours.",
        "",
        "An interdisciplinary general education course designed around a central theme.  Themes address topics related to understanding the individual and society and understanding the past. Course Information: May be repeated to a maximum of 6 hours.  Honors course, and  Individual and Society course, and  Past course.",
        "",
        "HON 121.  Honors Core in Understanding Individual and Society and Understanding Creative Arts.  3 hours.",
        "",
        "An interdisciplinary general education course designed around a central theme. Themes address topics related to understanding the individual and society and understanding the creative arts. Course Information: May be repeated to a maximum of 6 hours.  Honors course, and  Creative Arts course, and  Individual and Society course.",
        "",
        "HON 122.  Honors Core in Understanding Individual and Society and Exploring World Cultures.  3 hours.",
        "",
        "An interdisciplinary general education course designed around a central theme. Themes address topics related to understanding the individual and society and exploring world cultures. Course Information: May be repeated to a maximum of 6 hours.  Honors course, and  Individual and Society course, and  World Cultures course.",
        "",
        "HON 123.  Honors Core in Understanding Individual and Society and Understanding U.S. Society.  3 hours.",
        "",
        "An interdisciplinary general education course designed around a central theme.  Themes address topics related to understanding the individual and society and understanding U.S. society. Course Information: May be repeated to a maximum of 6 hours.  Honors course, and  Individual and Society course, and  US Society course.",
        "",
        "HON 124.  Honors Core in Understanding the Past and Understanding the Creative Arts.  3 hours.",
        "",
        "An interdisciplinary general education course designed around a central theme.  Themes address topics related to understanding the past and understanding the creative arts. Course Information: May be repeated to a maximum of 6 hours.  Honors course, and  Creative Arts course, and  Past course.",
        "",
        "HON 125.  Honors Core in Understanding the Past and Exploring World Cultures.  3 hours.",
        "",
        "An interdisciplinary general education course designed around a central theme.  Themes adress topics related to understanding the past and exploring world cultures. Course Information: May be repeated to a maximum of 6 hours.  Honors course, and  Past course, and  World Cultures course.",
        "",
        "HON 126.  Honors Core in Understanding the Past and Understanding U.S. Society.  3 hours.",
        "",
        "An interdisciplinary general education course designed around a central theme.  Themes address topics related to understanding the past and understanding U.S. society. Course Information: May be repeated to a maximum of 6 hours.  Honors course, and  Past course, and  US Society course.",
        "",
        "HON 127.  Honors Core in Understanding the Creative Arts and Exploring World Cultures.  3 hours.",
        "",
        "An interdisciplinary general education course designed around a central theme.  Themes address topics related to understanding the creative arts and exploring world cultures. Course Information: May be repeated to a maximum of 6 hours.  Honors course, and  Creative Arts course, and  World Cultures course.",
        "",
        "HON 128.  Honors Core in Understanding the Creative Arts and Understanding U.S. Society.  3 hours.",
        "",
        "An interdisciplinary general education course designed around a central theme. Themes address topics related to understanding the creative arts and understanding U.S. society. Course Information: May be repeated to a maximum of 6 hours.  Honors course, and  Creative Arts course, and  US Society course.",
        "",
        "HON 129.  Honors Core in Exploring World Cultures and Understanding U.S. Society.  3 hours.",
        "",
        "An interdisciplinary general education course designed around a central theme.  Themes address topics related to exploring world cultures and understanding U.S. society. Course Information: May be repeated to a maximum of 6 hours.  Honors course, and  US Society course, and  World Cultures course.",
        "",
        "HON 130.  Honors Core in Analyzing the Natural World and Understanding the Individual and Society.  3 hours.",
        "",
        "An interdisciplinary general education course designed around a central theme.  Themes address topics related to analyzing the natural world and understanding the individual and society. Course Information: May be repeated up to 1 time(s).  Honors course, and  Individual and Society course, and  Natural World - No Lab course.",
        "",
        "HON 131.  Honors Core in Analyzing the Natural World and Understanding the Past.  3 hours.",
        "",
        "An interdisciplinary general education course designed around a central theme.  Themes address topics related to analyzing the natural world and understanding the past. Course Information: May be repeated up to 1 time(s).  Honors course, and  Natural World - No Lab course, and  Past course.",
        "",
        "HON 132.  Honors Core in Analyzing the Natural World and Understanding the Creative Arts.  3 hours.",
        "",
        "An interdisciplinary general education course designed around a central theme.  Themes address topics related to analyzing the natural world and understanding the creative arts. Course Information: May be repeated up to 1 time(s).  Honors course, and  Creative Arts course, and  Natural World - No Lab course.",
        "",
        "HON 133.  Honors Core in Analyzing the Natural World and Exploring World Cultures.  3 hours.",
        "",
        "An interdisciplinary general education course designed around a central theme.  Themes address topics related to analyzing the natural world and exploring world cultures. Course Information: May be repeated up to 1 time(s).  Honors course, and  Natural World - No Lab course, and  World Cultures course.",
        "",
        "HON 134.  Honors Core in Analyzing the Natural World and Understanding U.S. Society.  3 hours.",
        "",
        "An interdisciplinary general education course designed around a central theme.  Themes address topics related to analyzing the natural world and understanding U.S. Society. Course Information: May be repeated up to 1 time(s).  Honors course, and  Natural World - No Lab course, and  US Society course.",
        "",
        "HON 140.  Honors Core in Understanding the Individual and Society.  3 hours.",
        "",
        "An interdisciplinary general education course designed around a central theme.  Themes address topics related to understanding the individual and society. Course Information: May be repeated to a maximum of 6 hours.  Honors course, and  Individual and Society course.",
        "",
        "HON 141.  Honors Core in Understanding the Past.  3 hours.",
        "",
        "An interdisciplinary general education course designed around a central theme.  Themes address topics related to understanding the past. Course Information: May be repeated to a maximum of 6 hours.  Honors course, and  Past course.",
        "",
        "HON 142.  Honors Core in Understanding the Creative Arts.  3 hours.",
        "",
        "An interdisciplinary general education course designed around a central theme.  Themes address topics related to understanding the creative arts. Course Information: May be repeated to a maximum of 6 hours.  Honors course, and  Creative Arts course.",
        "",
        "HON 143.  Honors Core in Exploring World Cultures.  3 hours.",
        "",
        "An interdisciplinary general education course designed around a central theme.  Themes address topics related to exploring world cultures. Course Information: May be repeated to a maximum of 6 hours.  Honors course, and  World Cultures course.",
        "",
        "HON 144.  Honors Core in Understanding U.S. Society.  3 hours.",
        "",
        "An interdisciplinary general education course designed around a central theme.  Themes address topics related to understanding U.S. society. Course Information: May be repeated to a maximum of 6 hours.  Honors course, and  US Society course.",
        "",
        "HON 145.  Honors Core in Analyzing the Natural World.  3 hours.",
        "",
        "An interdisciplinary general education course designed around a central theme.  Themes address topics related to analyzing the natural world. Course Information: May be repeated up to 1 time(s).  Honors course, and  Natural World - No Lab course.",
        "",
        "HON 200.  Honors Lectures.  0 hours.",
        "",
        "A series of special non-credit lectures arranged for honors students. Course Information: Satisfactory/Unsatisfactory grading only.  Honors course.",
        "",
        "HON 201.  Honors Seminar.  1 hour.",
        "",
        "A series of specially arranged seminars in different areas of interest. Course Information: Satisfactory/Unsatisfactory grading only. May be repeated to a maximum of 4 hours with approval. Approval to repeat course granted by the Honors College.  Prerequisite(s): Enrollment eligibility may vary from section to section, depending upon topic.  Honors course.",
        "",
        "HON 202.  Honors Tutoring.  0 hours.",
        "",
        "Provides students with the opportunity to tutor students in approved subjects. Course Information: Satisfactory/Unsatisfactory grading only. May be repeated with approval. Approval to repeat course granted by the Honors College. Prerequisite(s): Approval of the Honors College.  Honors course.",
        "",
        "HON 222.  Honors Activity.  0 hours.",
        "",
        "Honors work in an approved course or individual project. Course Information: Satisfactory/Unsatisfactory grading only. May be repeated. Required each fall and spring term for all Honors College students; optional for Honors College students who complete an Honors activity during the summer session.  Honors course.",
        "",
        "HON 225.  Honors Research.  0 hours.",
        "",
        "Individual research not covered by standard courses under close supervision of a faculty member. Course Information: Satisfactory/Unsatisfactory grading only. May be repeated with approval. Approval to repeat course granted by the Honors College. Prerequisite(s): Approval of the Honors College.  Honors course.",
        "",
        "HON 294.  Honors Inquiries.  3 hours.",
        "",
        "An in-depth exploration of issues confronting a topic of significance. Through reading and engaged discussion, students will learn substantive material as well as critical thinking skills. Course Information: May be repeated to a maximum of 6 hours. Students may register in more than one section per term. Prerequisite(s): Sophomore standing or above; or consent of the instructor.  Honors course.",
        "",
        "HON 301.  Foundations for the Future.  1 hour.",
        "",
        "This 1-hour seminar provides upper-level Honors students  structured support, focusing on preparation for topics in four primary areas: (1) scholarship; (2) awards; (3) career/graduate schools; and (4) long-term future issues. Course Information: Satisfactory/Unsatisfactory grading only.  Honors course.",
        "",
        "HON 322.  Honors Capstone Activity.  0 hours.",
        "",
        "Independent, in-depth examination of an approved topic under the close supervision of a faculty advisor. Course Information: Satisfactory/Unsatisfactory grading only. May be repeated.  Honors course.",
        "",
        "HON 401.  Advanced Honors Seminar.  3 hours.",
        "",
        "Student, faculty, and invited guests act as partners in the in-depth exploration of a focused topic.  This interaction is fostered though common readings, written assignments, and open discussions.  Course Information:  May be repeated to a maximum of 6 hours.  Students may register for more than one section per term.  Prerequisite(s):  Sophomore standing or above and consent of the instructor.  Graduate students may obtain instructor consent.  Recommended background:  HON 201.  Honors course.",
        "",
        "Apply Online | Contact Admissions | Privacy Statement",
        "Having problems accessing this site? Contact the Webmaster.",
        "© 2018-2019 The Board of Trustees of the University of Illinois",
        "",
        "Print this page.",
        "",
        "The PDF will include all information unique to this page.",
        "",
        "All pages in the campus catalog.",
        ""
    ],
    "out_links": [
        "https://catalog.uic.edu/azindex/",
        "https://catalog.uic.edu/",
        "http://www.uic.edu/",
        "https://catalog.uic.edu/ucat/",
        "https://catalog.uic.edu/gcat",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://catalog.uic.edu/ucat/the-university/",
        "https://catalog.uic.edu/ucat/admissions-registration-finances/",
        "https://catalog.uic.edu/ucat/degree-programs/",
        "https://catalog.uic.edu/ucat/colleges-depts/",
        "https://catalog.uic.edu/ucat/course-descriptions/",
        "https://catalog.uic.edu/ucat/course-descriptions/asp/",
        "https://catalog.uic.edu/ucat/course-descriptions/actg/",
        "https://catalog.uic.edu/ucat/course-descriptions/aast/",
        "https://catalog.uic.edu/ucat/course-descriptions/anat/",
        "https://catalog.uic.edu/ucat/course-descriptions/anth/",
        "https://catalog.uic.edu/ucat/course-descriptions/ahs/",
        "https://catalog.uic.edu/ucat/course-descriptions/arab/",
        "https://catalog.uic.edu/ucat/course-descriptions/arst/",
        "https://catalog.uic.edu/ucat/course-descriptions/arch/",
        "https://catalog.uic.edu/ucat/course-descriptions/art/",
        "https://catalog.uic.edu/ucat/course-descriptions/ah/",
        "https://catalog.uic.edu/ucat/course-descriptions/bcmg/",
        "https://catalog.uic.edu/ucat/course-descriptions/bioe/",
        "https://catalog.uic.edu/ucat/course-descriptions/bios/",
        "https://catalog.uic.edu/ucat/course-descriptions/bhis/",
        "https://catalog.uic.edu/ucat/course-descriptions/bps/",
        "https://catalog.uic.edu/ucat/course-descriptions/bstt/",
        "https://catalog.uic.edu/ucat/course-descriptions/ba/",
        "https://catalog.uic.edu/ucat/course-descriptions/cc/",
        "https://catalog.uic.edu/ucat/course-descriptions/cst/",
        "https://catalog.uic.edu/ucat/course-descriptions/cees/",
        "https://catalog.uic.edu/ucat/course-descriptions/che/",
        "https://catalog.uic.edu/ucat/course-descriptions/chem/",
        "https://catalog.uic.edu/ucat/course-descriptions/chin/",
        "https://catalog.uic.edu/ucat/course-descriptions/cme/",
        "https://catalog.uic.edu/ucat/course-descriptions/cl/",
        "https://catalog.uic.edu/ucat/course-descriptions/comm/",
        "https://catalog.uic.edu/ucat/course-descriptions/chsc/",
        "https://catalog.uic.edu/ucat/course-descriptions/cs/",
        "https://catalog.uic.edu/ucat/course-descriptions/clj/",
        "https://catalog.uic.edu/ucat/course-descriptions/ci/",
        "https://catalog.uic.edu/ucat/course-descriptions/des/",
        "https://catalog.uic.edu/ucat/course-descriptions/dlg/",
        "https://catalog.uic.edu/ucat/course-descriptions/dhd/",
        "https://catalog.uic.edu/ucat/course-descriptions/eaes/",
        "https://catalog.uic.edu/ucat/course-descriptions/econ/",
        "https://catalog.uic.edu/ucat/course-descriptions/ed/",
        "https://catalog.uic.edu/ucat/course-descriptions/edps/",
        "https://catalog.uic.edu/ucat/course-descriptions/epsy/",
        "https://catalog.uic.edu/ucat/course-descriptions/ece/",
        "https://catalog.uic.edu/ucat/course-descriptions/engr/",
        "https://catalog.uic.edu/ucat/course-descriptions/engl/",
        "https://catalog.uic.edu/ucat/course-descriptions/entr/",
        "https://catalog.uic.edu/ucat/course-descriptions/fin/",
        "https://catalog.uic.edu/ucat/course-descriptions/fr/",
        "https://catalog.uic.edu/ucat/course-descriptions/gws/",
        "https://catalog.uic.edu/ucat/course-descriptions/geog/",
        "https://catalog.uic.edu/ucat/course-descriptions/ger/",
        "https://catalog.uic.edu/ucat/course-descriptions/glas/",
        "https://catalog.uic.edu/ucat/course-descriptions/gka/",
        "https://catalog.uic.edu/ucat/course-descriptions/gkm/",
        "https://catalog.uic.edu/ucat/course-descriptions/gamd/",
        "https://catalog.uic.edu/ucat/course-descriptions/him/",
        "https://catalog.uic.edu/ucat/course-descriptions/heb/",
        "https://catalog.uic.edu/ucat/course-descriptions/hnur/",
        "https://catalog.uic.edu/ucat/course-descriptions/hist/",
        "https://catalog.uic.edu/ucat/course-descriptions/hn/",
        "https://catalog.uic.edu/ucat/course-descriptions/hum/",
        "https://catalog.uic.edu/ucat/course-descriptions/ie/",
        "https://catalog.uic.edu/ucat/course-descriptions/ids/",
        "https://catalog.uic.edu/ucat/course-descriptions/it/",
        "https://catalog.uic.edu/ucat/course-descriptions/idea/",
        "https://catalog.uic.edu/ucat/course-descriptions/iphs/",
        "https://catalog.uic.edu/ucat/course-descriptions/isa/",
        "https://catalog.uic.edu/ucat/course-descriptions/inst/",
        "https://catalog.uic.edu/ucat/course-descriptions/ital/",
        "https://catalog.uic.edu/ucat/course-descriptions/jpn/",
        "https://catalog.uic.edu/ucat/course-descriptions/jst/",
        "https://catalog.uic.edu/ucat/course-descriptions/kn/",
        "https://catalog.uic.edu/ucat/course-descriptions/kor/",
        "https://catalog.uic.edu/ucat/course-descriptions/lat/",
        "https://catalog.uic.edu/ucat/course-descriptions/lals/",
        "https://catalog.uic.edu/ucat/course-descriptions/las/",
        "https://catalog.uic.edu/ucat/course-descriptions/lib/",
        "https://catalog.uic.edu/ucat/course-descriptions/ling/",
        "https://catalog.uic.edu/ucat/course-descriptions/lcsl/",
        "https://catalog.uic.edu/ucat/course-descriptions/lith/",
        "https://catalog.uic.edu/ucat/course-descriptions/mgmt/",
        "https://catalog.uic.edu/ucat/course-descriptions/mktg/",
        "https://catalog.uic.edu/ucat/course-descriptions/meng/",
        "https://catalog.uic.edu/ucat/course-descriptions/mcs/",
        "https://catalog.uic.edu/ucat/course-descriptions/math/",
        "https://catalog.uic.edu/ucat/course-descriptions/mtht/",
        "https://catalog.uic.edu/ucat/course-descriptions/me/",
        "https://catalog.uic.edu/ucat/course-descriptions/pmmp/",
        "https://catalog.uic.edu/ucat/course-descriptions/mim/",
        "https://catalog.uic.edu/ucat/course-descriptions/mils/",
        "https://catalog.uic.edu/ucat/course-descriptions/movi/",
        "https://catalog.uic.edu/ucat/course-descriptions/muse/",
        "https://catalog.uic.edu/ucat/course-descriptions/mus/",
        "https://catalog.uic.edu/ucat/course-descriptions/nast/",
        "https://catalog.uic.edu/ucat/course-descriptions/nats/",
        "https://catalog.uic.edu/ucat/course-descriptions/ns/",
        "https://catalog.uic.edu/ucat/course-descriptions/neus/",
        "https://catalog.uic.edu/ucat/course-descriptions/nurs/",
        "https://catalog.uic.edu/ucat/course-descriptions/nuel/",
        "https://catalog.uic.edu/ucat/course-descriptions/ot/",
        "https://catalog.uic.edu/ucat/course-descriptions/path/",
        "https://catalog.uic.edu/ucat/course-descriptions/pcol/",
        "https://catalog.uic.edu/ucat/course-descriptions/phar/",
        "https://catalog.uic.edu/ucat/course-descriptions/pmpr/",
        "https://catalog.uic.edu/ucat/course-descriptions/psop/",
        "https://catalog.uic.edu/ucat/course-descriptions/phil/",
        "https://catalog.uic.edu/ucat/course-descriptions/pt/",
        "https://catalog.uic.edu/ucat/course-descriptions/phys/",
        "https://catalog.uic.edu/ucat/course-descriptions/phyb/",
        "https://catalog.uic.edu/ucat/course-descriptions/pol/",
        "https://catalog.uic.edu/ucat/course-descriptions/pols/",
        "https://catalog.uic.edu/ucat/course-descriptions/port/",
        "https://catalog.uic.edu/ucat/course-descriptions/psch/",
        "https://catalog.uic.edu/ucat/course-descriptions/pa/",
        "https://catalog.uic.edu/ucat/course-descriptions/pubh/",
        "https://catalog.uic.edu/ucat/course-descriptions/ppol/",
        "https://catalog.uic.edu/ucat/course-descriptions/ppa/",
        "https://catalog.uic.edu/ucat/course-descriptions/rels/",
        "https://catalog.uic.edu/ucat/course-descriptions/russ/",
        "https://catalog.uic.edu/ucat/course-descriptions/slav/",
        "https://catalog.uic.edu/ucat/course-descriptions/sj/",
        "https://catalog.uic.edu/ucat/course-descriptions/soc/",
        "https://catalog.uic.edu/ucat/course-descriptions/span/",
        "https://catalog.uic.edu/ucat/course-descriptions/sped/",
        "https://catalog.uic.edu/ucat/course-descriptions/stat/",
        "https://catalog.uic.edu/ucat/course-descriptions/sabr/",
        "https://catalog.uic.edu/ucat/course-descriptions/thtr/",
        "https://catalog.uic.edu/ucat/course-descriptions/upa/",
        "https://catalog.uic.edu/ucat/course-descriptions/upp/",
        "https://catalog.uic.edu/ucat/course-descriptions/us/",
        "https://catalog.uic.edu/ucat/archive-links/",
        "https://catalog.uic.edu/gcat/",
        "https://catalog.uic.edu/all-course-descriptions/",
        "https://catalog.uic.edu/search/?P=HON+201",
        "http://admissions.uic.edu/apply-now",
        "http://admissions.uic.edu/contact-admissions"
    ]
}