{
    "url": "https://catalog.uic.edu/ucat/course-descriptions/pmpr/",
    "title": "Pharmacy Practice (PMPR) < University of Illinois at Chicago",
    "text": [
        "PMPR 315.  Foundations in Rural Family and Community Healthcare I.  1 hour.",
        "",
        "Designed to introduce health care professions students to concepts and issues related to rural public health and primary care practice. Course Information: Prerequisite(s): Acceptance into the Rural Health Professions (RPHARM) Program.",
        "",
        "PMPR 316.  Foundations in Rural Family and Community Healthcare II.  1 hour.",
        "",
        "Introduces students to concepts of health resources development, rural mental health as well as community based research in rural communities. Course Information: Prerequisite(s): Acceptance into the Rural Health Professions (RPHARM) Program and successful completion of PMPR 315.",
        "",
        "PMPR 317.  Foundations in Rural Family and Community Healthcare III.  1 hour.",
        "",
        "Allows students to apply what was learned in the first year by participating in hands on community health education. In addition, clinical aspects of rural healthcare are introduced. Course Information: Prerequisite(s): Acceptance into the Rural Health Professions (RPharm) Program AND successful completion of RHP Year 1.",
        "",
        "PMPR 318.  Foundations in Rural Family and Community Healthcare IV.  1 hour.",
        "",
        "Students apply what was learned in the first year by participating in hands on community health education. Course Information: Prerequisite(s): Acceptance into the Rural Health Professions (RPHARM) Program; and successful completion of PMPR 315, PMPR 316 and PMPR 317.",
        "",
        "PMPR 319.  Foundations in Rural Family and Community Healthcare V.  1 hour.",
        "",
        "The fifth course in a series of six courses of supplementary education for PharmD students accepted into the Rural Health Professions (RHP) Program. Course Information: Prerequisite(s):Acceptance into the Rural Health Professions (RPHARM) Program AND successful completion of RHP Years 1 and 2.",
        "",
        "PMPR 320.  Foundations in Rural Family and Community Healthcare VI.  1 hour.",
        "",
        "The sixth course in a series of six courses of supplementary education for PharmD students accepted into the Rural Health Professions (RHP) Program. Course Information: Prerequisite(s):Acceptance into the Rural Health Professions (RPHARM) Program AND successful completion of RHP Years 1 and 2.",
        "",
        "PMPR 321.  Capstone Project in Rural Healthcare.  2 hours.",
        "",
        "The capstone project is a community-based research project which requires study of their chosen community's social, economic, cultural, organizational and political structure. Course Information: Prerequisite(s): Acceptance into the Rural Health Professions/RPHARM Program and successful completion of Years 1-3 of the RPHARM series of courses.",
        "",
        "PMPR 325.  Drugs and Society.  2 hours.",
        "",
        "Presents factual basis of drug use and abuse. Provides physiological and socio-psychological underpinnings of drug abuse. Evaluates social policies and regulatory issues surrounding drug abuse. Course Information: Same as BPS 325. Extensive computer use required. Prerequisite(s): Open only to first year students in the Doctor of Pharmacy program.",
        "",
        "PMPR 326.  Topics for Professional Student Enrichment.  1 hour.",
        "",
        "Students will meet at the beginning of the semester with the course instructor to review and select topics from a schedule of topics. Topics chosen will reflect 15 hours of class time as well as writen journals. Course Information: Prerequisite(s): PHAR 341.",
        "",
        "PMPR 327.  Lifestyle Modifications in Disease Management.  1 hour.",
        "",
        "Provides students with the background and practical knowledge for teaching their patients the best ways to become aware of and implement specific lifestyle modifications for their disease states. Course Information: Co-requisites: Concurrently enrolled in PDATs (i.e. P2's and up).",
        "",
        "PMPR 328.  Evidence Based Phytotherapy.  2 hours.",
        "",
        "Provides a basis for the evidenced-based evaluation of phytotherapy and other Complementary and Alternative Medicine (CAM) modalities.",
        "",
        "PMPR 329.  Dean's Leadership Forum.  1 hour.",
        "",
        "In addition to student exposure of established pharmacist roles, it will foster awareness about emerging trends and unique managerial roles for pharmacists as well as alternative career paths within the profession and the pharmaceutical sciences. Course Information: Satisfactory/Unsatisfactory grading only. Prerequisite(s): P2 or P3 class standing.",
        "",
        "PMPR 330.  Journal Club and Advanced Literature Analysis.  1 hour.",
        "",
        "A course designed to familiarize students with more advanced study design and statistical concepts commonly used in the medical literature. Course Information: Prerequisite(s): P-3 standing and completion of PHAR 455.",
        "",
        "PMPR 335.  Academic Advanced Pharmacy Practice Experience.  4 hours.",
        "",
        "An APPE occurring across the curriculum that exposes fourth-professional year students to academic pharmacy. Course Information: May be repeated to a maximum of 8 hours. Prerequisite(s): P4 level student standing.",
        "",
        "PMPR 336.  Concepts in Drug Development: From Bench to Bedside.  2 hours.",
        "",
        "Designed to give clinician-scientists an overview of the drug development process, from bench to bedside. Course Information: Offered online only. Prerequisite(s): Students will be required to search and evaluate scientific literature independently. PharmD candidates must be current second- or third-year students. First-year pharmacy students or graduate students of any year require instructor approval.",
        "",
        "PMPR 337.  Spanish for Pharmacists.  2 hours.",
        "",
        "This online elective course is designed to provide students with the fundamental knowledge they will need to interact with a Spanish speaking patient.",
        "",
        "PMPR 338.  Management of the HIV Patient.  2 hours.",
        "",
        "Incorporates team and case-based learning. Provides an opportunity to advance HIV understanding and clinical application. Course Information: Prerequisite(s): PHAR 403.",
        "",
        "PMPR 339.  Exploration of Telemedicine in Pharmacy Practice.  2 hours.",
        "",
        "Provides an overview of telemedicine and its role in the healthcare system. Class Schedule Information: To be properly registered, students must enroll in one Lecture-Discussion, one Laboratory, and one Clinical Practice.",
        "",
        "PMPR 345.  Clinical Toxicology.  3 hours.",
        "",
        "Basic and applied concepts in clinical toxicology including general approach, poisoning prevention measures, retrieval and evaluation of toxicology literature, substance abuse issues and practice site specific toxicology concerns. Course Information: Prerequisite(s): Enrollment in the Doctor of Pharmacy program.",
        "",
        "PMPR 347.  Advanced Transplant Therapeutics.  2 hours.",
        "",
        "Builds upon the fundamentals of solid organ transplantation established in PHAR 407. Course Information: Requires concurrent registration in PHAR 407.",
        "",
        "PMPR 348.  Exploring Advanced Topics in Ambulatory Care.  2 hours.",
        "",
        "Provides pharmacy students with advanced knowledge of various ambulatory care models. Course Information: Prerequisite(s): P3 standing.",
        "",
        "PMPR 349.  Case Based Infectious Diseases.  2 hours.",
        "",
        "Provides an opportunity to advance infectious disease understanding and clinical application. Students will be responsible for providing therapeutic recommendations based on evidence based medicine. Course Information: Prerequisite(s): PHAR 403 and current P3 standing.",
        "",
        "PMPR 355.  Seminar in Pharmacy Research.  1 hour.",
        "",
        "A weekly 1 hour research seminar provided by the College of Pharmacy faculty who are currently conducting clinical and/or basic science research.  Course Information:  Prerequisite(s):  Enrollment in the Doctor of Pharmacy Program.",
        "",
        "PMPR 356.  The Role of the Pharmacist in Tobacco Cessation.  2 hours.",
        "",
        "An in-depth knowledge base in smoking cessation, skills for counseling, and detailed \"how to\" information on specific counseling techniques.",
        "",
        "PMPR 357.  Natural and Recombinant Plasma-Derived Therapeutics.  1 hour.",
        "",
        "Introduction to plasma-derived therapeutics including albumin, immune globulins, and factor products. Production, viral safety, and clinical applications will be covered.  Course Information:  Prerequisite(s):  P3 class standing.",
        "",
        "PMPR 358.  Pharmacotherapeutic Issues in Women's Health.  1 hour.",
        "",
        "Team taught case-based pharmacotherapeutic lecture course related to women's health.  Course Information:  Prerequisite(s):  P3 class standing or consent of the instructor.",
        "",
        "PMPR 359.  Topics and Issues in Clinical Post-Graduate Training Programs.  2 hours.",
        "",
        "Increases PharmD students' knowledge and professionalization about post-graduate training. Students will \"shadow\" residents or fellows during non-class times, overnight and weekends while the resident or fellow is on call. Course Information: Field work required. Prerequisite(s): Second or third year standing in the Doctor of Pharmacy program with good academic standing. Class Schedule Information:  To be properly registered, students must enroll in one Clinical Practice and one Lecture.",
        "",
        "PMPR 360.  Clinical Aspects of Drug Interactions, Metabolism and Pharmacogenetics.  2 hours.",
        "",
        "Clinical perspective in interpreting drug interaction/metabolism and pharmacogenetic data from the literature; application of the information in practice. Hands-on opportunities to manage drug interactions using real-life cases. Course Information: Prerequisite(s): Third year standing in the Doctor of Pharmacy program or above; or consent of the instructor.",
        "",
        "PMPR 361.  Introduction to Public Health: Concepts and Applications in Pharmacy.  2 hours.",
        "",
        "Introduces pharmacy students to major concepts in public health.  Emphasizes an interdisciplinary team that focuses on the well being of the population.",
        "",
        "PMPR 362.  Clinical Aspects of Diabetes Mellitus.  2 hours.",
        "",
        "Discussion and project-based coursework covering more detailed information about diabetes mellitus types 1 and 2 for students interested in learning more about diabetes beyond the required Principles of Drug Action and Therapeutics course. Course Information: Prerequisite(s): PHAR 404.",
        "",
        "PMPR 363.  Primary Care Clinical Nutrition.  2 hours.",
        "",
        "Students will evaluate the clinical importance of nutritional intervention, and its practical applications for chronic disease prevention and management such as cancer, hypertension, hyperlipidemia, diabetes, and obesity.",
        "",
        "PMPR 370.  Pharmacy Grand Rounds.  1 hour.",
        "",
        "Case studies in drug therapy; review of relevant areas of drug treatment and research. Role of the pharmacist emphasized. Weekly presentations. Manadatory attendance. Course Information: Satisfactory/Unsatisfactory grading only. May not be repeated for credit. Prerequisite(s): Enrollment in the Doctor of Pharmacy program.",
        "",
        "PMPR 371.  Professional Development Seminar I.  1 hour.",
        "",
        "A weekly seminar series designed to draw select second year professional students together to discuss educational issues related to the second professional year. Course Information: Credit is not given for PMPR 371 if the student has credit in BPS 381 or PMAD 381 or PMMP 381. Prerequisite(s): Completion of the first year of the Doctor of Pharmacy program; Student must be listed as an advisee of the instructor.",
        "",
        "PMPR 377.  Professional Development for Pharmacists.  1 hour.",
        "",
        "Designed to develop the skills necessary for the professional development of future pharmacists: resume writing, interview preparation, written correspondence, and verbal presentation skills. Course Information: Prerequisite(s): Enrollment in the Doctor of Pharmacy program.",
        "",
        "PMPR 378.  Pediatric Therapeutics.  2 hours.",
        "",
        "Drug therapy of common pediatric disease states, emphasizing special pediatric considerations in the areas of infectious disease, psychiatry, hematology, neonatology. Course Information: Prerequisite(s): Completion of the second year of the Doctor of Pharmacy Program.",
        "",
        "PMPR 380.  Undergraduate Research in Pharmacy Practice.  1-3 hours.",
        "",
        "Investigation, under the direction of one or more faculty members, of a problem of limited scope.  May require literature research related to the research project. Course Information: May be repeated. A maximum of 6 hours of credit is allowed per department. A total of not more than 8 hours of 380 and 390 numbered courses in the college may be applied toward the 12 hours of PharmD professional electives.  Prerequisite(s): Minimum cumulative grade point average of 2.50 and consent of the instructor, department head, and Associate Dean for Student Affairs.",
        "",
        "PMPR 381.  Chronic Kidney Disease (CKD) - Interventions and Treatment.  2 hours.",
        "",
        "Identification and treatment of patients with chronic kidney disease utilizing a multifactorial approach to attain goals set by Kidney Disease Outcome Quality Initiatives (KDOQI) Guidelines, ADA Guidelines, JNCVII Guidelines and NCEPIII Guidelines. Course Information: Prerequisite(s): PHAR 401.",
        "",
        "PMPR 382.  Ethical Considerations in the Practice of Pharmacy.  2 hours.",
        "",
        "Students will review ethical principles, identify ethical dilemmas, analyze case studies, and engage in role-playing. Individual and group written/oral presentations will be required. Course Information: Prerequisite(s): PHAR 404.",
        "",
        "PMPR 383.  Managed Care Pharmacy.  2 hours.",
        "",
        "Covers fundamental concepts in managed care pharmacy and provides a basic understanding of how managed care pharmacy impacts the health care system.",
        "",
        "PMPR 385.  Special Topics of Current Interest in Pharmacy Practice.  1-4 hours.",
        "",
        "Course offered by faculty or a visiting lecturer on a selected topic of current interest. Available on an experimental basis for two offerings only. Course Information:  May be repeated.  Students may register in more than one section per term.  Prerequisite(s): Good academic standing and consent of the instructor.",
        "",
        "PMPR 390.  Special Projects in Pharmacy Practice.  1-2 hours.",
        "",
        "Special projects within the departmental discipline. Defined and terminal project goals are achieved through independent study. Course Information: May be repeated. A maximum of 4 hours of 390 credit is allowed in all departments. A total of not more than 8 hours of 380 and 390 numbered courses in the college may be applied toward the 12 hours of PharmD professional electives.   Prerequisite(s): Consent of the instructor, department head, and Associate Dean for Student Affairs.",
        "",
        "PMPR 430.  Critical Care I.  2 hours.",
        "",
        "Advanced pharmacotherapeutics course that will concentrate on the medical management and the pharmacotherapist's role in the management of the critically ill patient.  This course will also incorporate and apply pharmacokinetic principles. Course Information: Prerequisite(s): HAR 401 and PHAR 402 and PHAR 403 and PHAR 404 and PHAR 405 and PHAR 406; and PHAR 407 and PHAR 408; and completion of the second year of the program Beginning Spring 2019: Concurrent enrollment in PHAR 510.",
        "",
        "PMPR 440.  Applied Pharmacokinetics.  2 hours.",
        "",
        "An elective course demonstrating practical application of pharmacokinetic principles. Course Information: Previously listed as PMPR 340. Scientific calculator required. Prerequisite(s): PHAR 401, PHAR 402, PHAR 403, PHAR 404, PHAR 405, and PHAR 406 or consent of the instructor.",
        "",
        "PMPR 442.  Introduction to Specialty Pharmacy.  2 hours.",
        "",
        "Specialty pharmacy practice model and how it impacts access and management of drugs used to treat complex ans chronic disease. Course Information: Prerequisite(s): P2 or P3 standing. Class Schedule Information: To be properly registered, students must enroll in one Discussion/Recitation and one Lecture.",
        "",
        "PMPR 445.  Interprofessional Approaches to Health Disparities (IAHD) I.  2 hours.",
        "",
        "Designed to build upon the concepts of health disparities, social determinants of health, public health, Interprofessional education, quality improvement and community-based participatory research across the PharmD curriculum. Course Information: Prerequisite(s): Successful completion of PharmD Curriculum through P2 year. Completion of competitive application packet for the course.",
        "",
        "PMPR 446.  Interprofessional Approaches to Health Disparities (IAHD) II.  2 hours.",
        "",
        "Equips learners with essential skills to improve health care for underserved populations and transform health disparities through interprofessional education, research and collaborative practice. Prerequisite(s): PMPR 445.",
        "",
        "PMPR 450.  Medical writing.  1 hour.",
        "",
        "Students will access weekly online modules that will cover the fundamentals of writing, editing, and publishing scientific medical information. Prerequisite(s): PHAR 440.",
        "",
        "Apply Online | Contact Admissions | Privacy Statement",
        "Having problems accessing this site? Contact the Webmaster.",
        "© 2018-2019 The Board of Trustees of the University of Illinois",
        "",
        "Print this page.",
        "",
        "The PDF will include all information unique to this page.",
        "",
        "All pages in the campus catalog.",
        ""
    ],
    "out_links": [
        "https://catalog.uic.edu/azindex/",
        "https://catalog.uic.edu/",
        "http://www.uic.edu/",
        "https://catalog.uic.edu/ucat/",
        "https://catalog.uic.edu/gcat",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://catalog.uic.edu/ucat/the-university/",
        "https://catalog.uic.edu/ucat/admissions-registration-finances/",
        "https://catalog.uic.edu/ucat/degree-programs/",
        "https://catalog.uic.edu/ucat/colleges-depts/",
        "https://catalog.uic.edu/ucat/course-descriptions/",
        "https://catalog.uic.edu/ucat/course-descriptions/asp/",
        "https://catalog.uic.edu/ucat/course-descriptions/actg/",
        "https://catalog.uic.edu/ucat/course-descriptions/aast/",
        "https://catalog.uic.edu/ucat/course-descriptions/anat/",
        "https://catalog.uic.edu/ucat/course-descriptions/anth/",
        "https://catalog.uic.edu/ucat/course-descriptions/ahs/",
        "https://catalog.uic.edu/ucat/course-descriptions/arab/",
        "https://catalog.uic.edu/ucat/course-descriptions/arst/",
        "https://catalog.uic.edu/ucat/course-descriptions/arch/",
        "https://catalog.uic.edu/ucat/course-descriptions/art/",
        "https://catalog.uic.edu/ucat/course-descriptions/ah/",
        "https://catalog.uic.edu/ucat/course-descriptions/bcmg/",
        "https://catalog.uic.edu/ucat/course-descriptions/bioe/",
        "https://catalog.uic.edu/ucat/course-descriptions/bios/",
        "https://catalog.uic.edu/ucat/course-descriptions/bhis/",
        "https://catalog.uic.edu/ucat/course-descriptions/bps/",
        "https://catalog.uic.edu/ucat/course-descriptions/bstt/",
        "https://catalog.uic.edu/ucat/course-descriptions/ba/",
        "https://catalog.uic.edu/ucat/course-descriptions/cc/",
        "https://catalog.uic.edu/ucat/course-descriptions/cst/",
        "https://catalog.uic.edu/ucat/course-descriptions/cees/",
        "https://catalog.uic.edu/ucat/course-descriptions/che/",
        "https://catalog.uic.edu/ucat/course-descriptions/chem/",
        "https://catalog.uic.edu/ucat/course-descriptions/chin/",
        "https://catalog.uic.edu/ucat/course-descriptions/cme/",
        "https://catalog.uic.edu/ucat/course-descriptions/cl/",
        "https://catalog.uic.edu/ucat/course-descriptions/comm/",
        "https://catalog.uic.edu/ucat/course-descriptions/chsc/",
        "https://catalog.uic.edu/ucat/course-descriptions/cs/",
        "https://catalog.uic.edu/ucat/course-descriptions/clj/",
        "https://catalog.uic.edu/ucat/course-descriptions/ci/",
        "https://catalog.uic.edu/ucat/course-descriptions/des/",
        "https://catalog.uic.edu/ucat/course-descriptions/dlg/",
        "https://catalog.uic.edu/ucat/course-descriptions/dhd/",
        "https://catalog.uic.edu/ucat/course-descriptions/eaes/",
        "https://catalog.uic.edu/ucat/course-descriptions/econ/",
        "https://catalog.uic.edu/ucat/course-descriptions/ed/",
        "https://catalog.uic.edu/ucat/course-descriptions/edps/",
        "https://catalog.uic.edu/ucat/course-descriptions/epsy/",
        "https://catalog.uic.edu/ucat/course-descriptions/ece/",
        "https://catalog.uic.edu/ucat/course-descriptions/engr/",
        "https://catalog.uic.edu/ucat/course-descriptions/engl/",
        "https://catalog.uic.edu/ucat/course-descriptions/entr/",
        "https://catalog.uic.edu/ucat/course-descriptions/fin/",
        "https://catalog.uic.edu/ucat/course-descriptions/fr/",
        "https://catalog.uic.edu/ucat/course-descriptions/gws/",
        "https://catalog.uic.edu/ucat/course-descriptions/geog/",
        "https://catalog.uic.edu/ucat/course-descriptions/ger/",
        "https://catalog.uic.edu/ucat/course-descriptions/glas/",
        "https://catalog.uic.edu/ucat/course-descriptions/gka/",
        "https://catalog.uic.edu/ucat/course-descriptions/gkm/",
        "https://catalog.uic.edu/ucat/course-descriptions/gamd/",
        "https://catalog.uic.edu/ucat/course-descriptions/him/",
        "https://catalog.uic.edu/ucat/course-descriptions/heb/",
        "https://catalog.uic.edu/ucat/course-descriptions/hnur/",
        "https://catalog.uic.edu/ucat/course-descriptions/hist/",
        "https://catalog.uic.edu/ucat/course-descriptions/hon/",
        "https://catalog.uic.edu/ucat/course-descriptions/hn/",
        "https://catalog.uic.edu/ucat/course-descriptions/hum/",
        "https://catalog.uic.edu/ucat/course-descriptions/ie/",
        "https://catalog.uic.edu/ucat/course-descriptions/ids/",
        "https://catalog.uic.edu/ucat/course-descriptions/it/",
        "https://catalog.uic.edu/ucat/course-descriptions/idea/",
        "https://catalog.uic.edu/ucat/course-descriptions/iphs/",
        "https://catalog.uic.edu/ucat/course-descriptions/isa/",
        "https://catalog.uic.edu/ucat/course-descriptions/inst/",
        "https://catalog.uic.edu/ucat/course-descriptions/ital/",
        "https://catalog.uic.edu/ucat/course-descriptions/jpn/",
        "https://catalog.uic.edu/ucat/course-descriptions/jst/",
        "https://catalog.uic.edu/ucat/course-descriptions/kn/",
        "https://catalog.uic.edu/ucat/course-descriptions/kor/",
        "https://catalog.uic.edu/ucat/course-descriptions/lat/",
        "https://catalog.uic.edu/ucat/course-descriptions/lals/",
        "https://catalog.uic.edu/ucat/course-descriptions/las/",
        "https://catalog.uic.edu/ucat/course-descriptions/lib/",
        "https://catalog.uic.edu/ucat/course-descriptions/ling/",
        "https://catalog.uic.edu/ucat/course-descriptions/lcsl/",
        "https://catalog.uic.edu/ucat/course-descriptions/lith/",
        "https://catalog.uic.edu/ucat/course-descriptions/mgmt/",
        "https://catalog.uic.edu/ucat/course-descriptions/mktg/",
        "https://catalog.uic.edu/ucat/course-descriptions/meng/",
        "https://catalog.uic.edu/ucat/course-descriptions/mcs/",
        "https://catalog.uic.edu/ucat/course-descriptions/math/",
        "https://catalog.uic.edu/ucat/course-descriptions/mtht/",
        "https://catalog.uic.edu/ucat/course-descriptions/me/",
        "https://catalog.uic.edu/ucat/course-descriptions/pmmp/",
        "https://catalog.uic.edu/ucat/course-descriptions/mim/",
        "https://catalog.uic.edu/ucat/course-descriptions/mils/",
        "https://catalog.uic.edu/ucat/course-descriptions/movi/",
        "https://catalog.uic.edu/ucat/course-descriptions/muse/",
        "https://catalog.uic.edu/ucat/course-descriptions/mus/",
        "https://catalog.uic.edu/ucat/course-descriptions/nast/",
        "https://catalog.uic.edu/ucat/course-descriptions/nats/",
        "https://catalog.uic.edu/ucat/course-descriptions/ns/",
        "https://catalog.uic.edu/ucat/course-descriptions/neus/",
        "https://catalog.uic.edu/ucat/course-descriptions/nurs/",
        "https://catalog.uic.edu/ucat/course-descriptions/nuel/",
        "https://catalog.uic.edu/ucat/course-descriptions/ot/",
        "https://catalog.uic.edu/ucat/course-descriptions/path/",
        "https://catalog.uic.edu/ucat/course-descriptions/pcol/",
        "https://catalog.uic.edu/ucat/course-descriptions/phar/",
        "https://catalog.uic.edu/ucat/course-descriptions/psop/",
        "https://catalog.uic.edu/ucat/course-descriptions/phil/",
        "https://catalog.uic.edu/ucat/course-descriptions/pt/",
        "https://catalog.uic.edu/ucat/course-descriptions/phys/",
        "https://catalog.uic.edu/ucat/course-descriptions/phyb/",
        "https://catalog.uic.edu/ucat/course-descriptions/pol/",
        "https://catalog.uic.edu/ucat/course-descriptions/pols/",
        "https://catalog.uic.edu/ucat/course-descriptions/port/",
        "https://catalog.uic.edu/ucat/course-descriptions/psch/",
        "https://catalog.uic.edu/ucat/course-descriptions/pa/",
        "https://catalog.uic.edu/ucat/course-descriptions/pubh/",
        "https://catalog.uic.edu/ucat/course-descriptions/ppol/",
        "https://catalog.uic.edu/ucat/course-descriptions/ppa/",
        "https://catalog.uic.edu/ucat/course-descriptions/rels/",
        "https://catalog.uic.edu/ucat/course-descriptions/russ/",
        "https://catalog.uic.edu/ucat/course-descriptions/slav/",
        "https://catalog.uic.edu/ucat/course-descriptions/sj/",
        "https://catalog.uic.edu/ucat/course-descriptions/soc/",
        "https://catalog.uic.edu/ucat/course-descriptions/span/",
        "https://catalog.uic.edu/ucat/course-descriptions/sped/",
        "https://catalog.uic.edu/ucat/course-descriptions/stat/",
        "https://catalog.uic.edu/ucat/course-descriptions/sabr/",
        "https://catalog.uic.edu/ucat/course-descriptions/thtr/",
        "https://catalog.uic.edu/ucat/course-descriptions/upa/",
        "https://catalog.uic.edu/ucat/course-descriptions/upp/",
        "https://catalog.uic.edu/ucat/course-descriptions/us/",
        "https://catalog.uic.edu/ucat/archive-links/",
        "https://catalog.uic.edu/gcat/",
        "https://catalog.uic.edu/all-course-descriptions/",
        "https://catalog.uic.edu/search/?P=PMPR+315",
        "https://catalog.uic.edu/search/?P=PMPR+316",
        "https://catalog.uic.edu/search/?P=PMPR+317",
        "https://catalog.uic.edu/search/?P=BPS+325",
        "https://catalog.uic.edu/search/?P=PMPR+371",
        "https://catalog.uic.edu/search/?P=BPS+381",
        "https://catalog.uic.edu/search/?P=PMMP+381",
        "https://catalog.uic.edu/search/?P=PHAR+510",
        "https://catalog.uic.edu/search/?P=PMPR+445",
        "https://catalog.uic.edu/search/?P=PHAR+440",
        "http://admissions.uic.edu/apply-now",
        "http://admissions.uic.edu/contact-admissions"
    ]
}