{
    "url": "https://wics.students.uic.edu/our-mission/",
    "title": "Our Mission | Women in Computer Science | University of Illinois at Chicago",
    "text": [
        "We are dedicated to building a community of empowered women",
        "The Women in Computer Science of the University of Illinois at Chicago (WiCS) is a student organization within the department of Computer Science, University of Illinois at Chicago, whose goal is to support and promote women in computer science. The Organization provides a support network comprising of role models, mentors, and peers – and acts as a social, technical, and networking community for all interested parties under the umbrella of the University. The Organization will strive to promote an increased knowledge of and greater interest in the contributions of women in the science, design, development, construction, languages, management, and applications of modern computing. Work with the Department to provide feedback on the continued improvement of the learning and working environment(s) of women in computing. Assist in activities that promote and provide increased recruitment and retention of women in computing throughout the Pipeline including volunteering in activities for girls in K-12, undergraduate and graduate students, and professionals. The Organization will provide a means of communication between persons having an interest in computing and women in thereof."
    ],
    "out_links": [
        "https://wics.students.uic.edu/",
        "http://uic.edu/",
        "https://involvement.uic.edu/",
        "https://wics.students.uic.edu/event/",
        "https://wics.students.uic.edu/event/calendar/",
        "https://wics.students.uic.edu/people/",
        "https://wics.students.uic.edu/people/officers/",
        "https://wics.students.uic.edu/people/alumni/",
        "https://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}