{
    "url": "https://cs.uic.edu/undergraduate/student-profiles/",
    "title": "Undergraduate Student Profiles | Department of Computer Science | University of Illinois at Chicago",
    "text": [
        "Computer Science, BS ’22 | Justice, IL",
        "Why would you recommend UIC to others? I’d recommend the College of Engineering due to how well put together the college is. The college teaches you stuff you’ll actually use in the real world, and many of the classes try to apply as much material as they can.",
        "Dream job: Software engineer",
        "What do you hope to do right after graduation? Get right to work at a software company.",
        "Favorite place in Chicago: The Museum of Science and Industry. (I also had an internship there.)",
        "Computer Science, BS ’21 | Oak Park, IL",
        "Why did you choose UIC? I wanted to explore the possibilities of incorporating arts in the engineering field.",
        "Dream job: Video game designer",
        "Engineering project/assignment you did that you’re most proud of: I took the Engineering 111 additive manufacturing class and am proud of all the characters and creatures I learned to 3D-print to give to friends.",
        "Internship experience: I was part of the Guaranteed Paid Internship Program (GPIP) and worked in UIC’s multimedia lab. GPIP gave me a look into what a future computer science job could look like.",
        "Student activities: UIC Flames cross country and track, Society of Women Engineers, Japanese Conversation Hour",
        "Computer Science, BS ’21 | Chicago, IL",
        "Name one thing you think UIC does better than anywhere else: UIC is the best at providing a global experience by allowing a wide variety of people and cultures to meet in one place.",
        "Favorite course: CS 141 Program Design II",
        "Words of wisdom: Try your hardest not to pass the class, but to learn something new.",
        "Industry person you admire most: Bill Gates, because he shows how persistence can lead to success, and he donates money for people in need and startup companies.",
        "Where do you hope to be after graduation? In a job involving machine learning.",
        "Computer Science, BS ’21 | Kuwait City, Kuwait",
        "Favorite thing about the computer science department: The CS department has a lot of activities and clubs to further enrich your professional career. The CS lounge is a great resource to get help with your CS courses. Also, professors and teaching assistants can help you from the smallest of questions to the big ones during office hours. Without them I wouldn’t be as successful as I am today with my classes so far.",
        "Project or assignment you are most proud of: I made a proof of concept for physical exercise using virtual reality. I made it with the Oculus Rift and leap motion for seamless hand interactivity and to make it feel like you are at the gym, but working out at home.",
        "How you get around: Bike — easier to reach your classes on time.",
        "Would you recommend UIC to new applicants? If you want to learn new things in the engineering field at a good school for the best value, then this university is for you.",
        "Computer Science, BS ’21 | Aurora, IL",
        "Why did you choose UIC? When I was a sophomore in high school, I was one of the first girls to ever be a part of the Society of Women Engineers Shadow Day, where I got to spend one day shadowing a current college student. Although I came for a different major, I still knew that UIC would be one of my top picks because of its rigorous CS program, location, and diversity.",
        "Most challenging assignment so far: Any assignment in CS 251 Data Structures. GridWorld was probably the most difficult: we had to design a “world” based on rows and columns. Sometimes it takes hours just to fix one bug in your code, but it’s so fulfilling when your code finally runs the way you want it to!",
        "Coolest department at UIC: The School of Design. Their projects look so professional and well done.",
        "Dream job: To work as a software engineer for Pixar or as a software developer for any big tech company.",
        "Computer Science, BS ’21 | Libertyville, IL",
        "Favorite course: CS 261 Machine Organization. I really liked AttackLab in this class. It was challenging and made me feel like a hacker.",
        "Why did you choose UIC? The two things I love most in life are computers and good job prospects.",
        "Where do you see yourself after graduation? Creating a startup",
        "Dream job: Owning a Fortune 500 tech company",
        "Favorite place in Chicago: My bed",
        "",
        "Computer Science, BS ’21 | Gujranwala, Pakistan",
        "Why did you choose UIC? You can’t find a better university that has a reputable engineering program, is five minutes from downtown Chicago, and has affordable tuition.",
        "What do you hope to be doing right after graduation? Not wasting any time and getting straight to work, and then in few years having my own company.",
        "Favorite place in Chicago: Maggie Daley Park ice skating ribbon",
        "Favorite movie: I recently watched the movie Parasite. It’s extremely good.",
        "Computer Science, BS ’23 | Ternopil, Ukraine",
        "Favorite course: CS 151 Mathematical Foundations of Computing",
        "Favorite thing about the department you’re majoring in: Lecturer Evan McCarty",
        "Engineering project/assignment you did that you’re most proud of: The quad copter that I’m building with UIC’s Engineering Design Team.",
        "Place you’re most likely to be found on campus, and why: The fourth floor of the Richard J. Daley Library. The best place to study. No debate.",
        "Computer Science, BS ’22 | Palatine, Illinois",
        "Name one thing you think UIC does better than anywhere else: There are a TON of opportunities. We’re constantly getting emails about job openings for on-campus positions. It was one of those emails that led me to a job as a full-stack developer for UIC Student Affairs, and that’s been an incredible learning opportunity for me.",
        "How did you know engineering was the right field for you? I’ve always been big on computers and gaming, so I initially got into programming in high school because I wanted to make video games one day. I really enjoyed coding and decided to make a career out of it.",
        "Dream job: Software architect",
        "Favorite place in Chicago: Ignite Gaming Lounge",
        "Computer Science, BS ’22 | Memphis, TN",
        "Engineering project/assignment you did that you’re most proud of: Every single CS 141 Program Design II project, which, upon assignment, are absolutely mind-boggling until you figure it out and feel like a genius.",
        "What is the most valuable student organization you’ve joined? Women in Computer Science—excellent events that give you chances to talk to people in the CS field and even make connections that lead to opportunities after graduation.",
        "Favorite restaurant in Chicago: Ghareeb Nawaz right by campus—go in there with $7 and you eat like a king.",
        "Favorite musical artist: Kate Bush",
        "Computer Science, BS ’22 | Glendale Heights, IL",
        "Favorite course: CS 251 Data Structures",
        "Place you’re most likely to be found on campus: The CS Lounge. Whether I’m there for office hours, studying for an exam, or just hanging out with friends, the CS Lounge has become almost a second home for me on campus.",
        "Dream job: Software engineer",
        "Favorite restaurant in Chicago: Max’s Takeout. It’s a small hole-in-the-wall place on Adams Street that’s easy to miss. Their hot dogs and burgers are awesome. Every time I’m nearby I have to swing by.",
        "Computer Science, BS ’21 | India",
        "Favorite thing about the department you’re majoring in: CS 151 Mathematical Foundations of Computing taught by Professor Bello",
        "Dream job: Owning a startup",
        "Which was the most valuable internship or lab experience you’ve had? UIC’s Guaranteed Paid Internship Program with Professors Ouri Wolfson and Jane Lin was the best experience so far. I learned mobile application development.",
        "How you get around: Walk or cycle if weather is good, otherwise the CTA",
        "Computer Science, BS ’21 | Chicago, IL",
        "Name one thing you think UIC does better than anywhere else: Diversity",
        "Favorite course: CS 362 Computer Design",
        "Internships you’ve held: The first internship I ever had was before I started my freshman year at Accenture for project management and then did the Guaranteed Paid Internship Program after my freshman year. I’ve now acquired an internship for this summer at Avanade.",
        "How you get around: I commute to campus via the Blue line, but when the weather permits, I use my scooter to get around campus quickly.",
        "Computer Science, BS ’23 | Bensenville, IL",
        "Name one thing you think UIC does better than anywhere else: The views. You really can’t beat seeing the Chicago skyline everyday.",
        "How is the College of Engineering preparing you for the working world? It has taught me how much better it is to collaborate with other people when working on a project. Two minds always think better than one.",
        "Would you recommend the College of Engineering to high school students? Yes! Especially for girls who want to become engineers. You belong here! UIC has so many opportunities for you to grow and prosper in the field. The opportunities are endless.",
        "Favorite musical artist: Chance The Rapper"
    ],
    "out_links": [
        "https://cs.uic.edu/",
        "http://uic.edu/",
        "https://cs.uic.edu/undergraduate/",
        "https://cs.uic.edu/undergraduate/admitted-students/",
        "http://engineering.uic.edu/undergraduate-admissions/",
        "https://cs.uic.edu/undergraduate/abet-accreditation/",
        "https://cs.uic.edu/undergraduate/cs-major/",
        "https://cs.uic.edu/undergraduate/cs-minor/",
        "https://cs.uic.edu/undergraduate/undergrad-courses/",
        "https://cs.uic.edu/undergraduate/internships-and-jobs/",
        "https://cs.uic.edu/undergraduate/student-organizations/",
        "https://cs.uic.edu/undergraduate/student-resources/",
        "https://cs.uic.edu/undergraduate/women/",
        "https://cs.uic.edu/graduate/",
        "https://cs.uic.edu/graduate/admitted-students/",
        "https://cs.uic.edu/graduate/admissions/",
        "https://cs.uic.edu/graduate/graduate-courses/",
        "https://cs.uic.edu/graduate/ms-program/",
        "https://cs.uic.edu/graduate/phd/",
        "https://cs.uic.edu/graduate/cs-dissertations/",
        "https://cs.uic.edu/graduate/post-grad-outcomes/",
        "https://cs.uic.edu/graduate/student-profiles/",
        "https://cs.uic.edu/graduate/graduate-student-resources/",
        "https://cs.uic.edu/cs-research/",
        "https://cs.uic.edu/cs-research/research-areas-2/",
        "https://cs.uic.edu/cs-research/labs/",
        "https://cs.uic.edu/cs-research/lectures-seminars/",
        "https://cs.uic.edu/cs-research/reus/",
        "https://cs.uic.edu/faculty-staff/",
        "https://cs.uic.edu/faculty-staff/department-head/",
        "https://cs.uic.edu/faculty-staff/faculty/",
        "https://cs.uic.edu/faculty-staff/emeritus-faculty/",
        "https://cs.uic.edu/faculty-staff/adjunct-faculty/",
        "https://cs.uic.edu/faculty-staff/staff/",
        "https://cs.uic.edu/faculty-staff/faculty-resources/",
        "https://cs.uic.edu/faculty-staff/open-positions/",
        "https://cs.uic.edu/cs-news/",
        "https://cs.uic.edu/cs-news/all-news/",
        "https://cs.uic.edu/cs-news/press-mentions/",
        "https://cs.uic.edu/cs-events/",
        "https://cs.uic.edu/cs-events/calendar/",
        "https://cs.uic.edu/cs-events/student-opportunities/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://catalog.uic.edu/ucat/course-descriptions/engr/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://accc.uic.edu/support/academic-multimedia-lab/",
        "https://swe.students.uic.edu/",
        "https://lclc.uic.edu/event/conversation-hours/japanese-conversation-hour/",
        "https://catalog.uic.edu/ucat/course-descriptions/cs/",
        "https://design.uic.edu/",
        "https://catalog.uic.edu/all-course-descriptions/cs/",
        "https://catalog.uic.edu/ucat/colleges-depts/engineering/cs/",
        "https://cs.uic.edu/profiles/evan-mccarty/",
        "https://library.uic.edu/libraries/daley",
        "https://wics.students.uic.edu/",
        "https://cs.uic.edu/profiles/gonzalo-bello/",
        "https://cs.uic.edu/profiles/ouri-wolfson/",
        "https://cme.uic.edu/profiles/jie/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}