{
    "url": "https://vese.students.uic.edu/",
    "title": "VESE | University of Illinois at Chicago",
    "text": [
        "Vehicle Electronics and Systems Engineering (VESE) provides UIC students an outlet to explore the various engineering challenges provided in the area of vehicle design. We are a new organization enjoying a successful second year exploring topics such as autonomous vehicles, drone systems,  and electric vehicle design among others. We maintain a relationship with major companies in the field by scheduling tours or speaking events where members are able to network with staff and and get more familiar with what it means to work in the industry.",
        "",
        "Currently We have three major projects active, each with their own various subgroups.",
        "Power Racing Series Electric Go-Cart",
        "We are designing a go cart for use in the power racing series electric go-kart competition. This competition is held multiple times a year at Maker Fairs across the US and Canada with many near Chicago. The competition involves designing and building an electric go-kart from scratch, all while maintaining a budget of $500 or less.",
        "",
        "Drone  Subgroup",
        "The drone subgroup was founded to give members an outlet to explore drone vehicle systems. Currently they are working on designing a quad-copter drone based off of a current members design. The intention is to gain an understanding in how quad-copters function and how to improve them through code and engineering. The current goal is to design and engineer quad-copters for use in competitions.",
        "",
        "Autonomous Vehicles Subgroup",
        "This subgroup wants to explore the exploding field of self driving vehicles. The goals set by this subgroup are to explore how self driving vehicles  interact with their environment, avoid obstacles, and path find. Current goal is to finish an R/C test vehicle and outfit it with a sensor package.",
        "Our general body meetings (GBMs) are held every other week, in addition to each subgroup setting meeting times and locations as they see fit. To meet up with one of the subgroups you can come to a GBM, or message the subgroup in their channel on slack and request their meetup information (vese-uic.slack.com).",
        "",
        "Meeting times for our GBMs:",
        "5pm every other Wednesday",
        "Makerspace Classroom 295",
        "",
        "If you have any questions regarding meeting times or need help locating us, send a message to the general channel on slack (vese-uic.slack.com) and we will likely answer immediately. Alternatively, send an E-Mail to our president Anthony Venturella (aventu6@uic.edu) and he will help you with any questions.",
        "",
        "Location of UIC Makerspace:"
    ],
    "out_links": [
        "http://uic.edu/",
        "https://involvement.uic.edu/",
        "https://vese.students.uic.edu/officers/",
        "https://vese.students.uic.edu/events-2/",
        "https://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}