{
    "url": "https://wlrc.uic.edu/campus-advocacy-network/",
    "title": "Campus Advocacy Network | Women’s Leadership and Resource Center | University of Illinois at Chicago",
    "text": [
        "COVID-19 UPDATE: The Campus Advocacy Network will continue to serve UIC students, faculty, and staff via email, phone, and video chat. Visit our COVID page for details.",
        "",
        "The Campus Advocacy Network (CAN) is an on campus service center dedicated to providing confidential, anonymous, free services to UIC students, staff and faculty who have experienced sexual assault, domestic/dating violence, stalking and hate crimes. Our advocates are fully trained to state standards (40 hour sexual assault advocacy and 40 hour domestic violence advocacy) and have extensive training in stalking. They have many years of experience helping victims navigate systems they need to access on campus, including university administrative systems such as Title IX investigations and student conduct hearings, and off campus, including the criminal court system and the civil court system for obtaining Orders of Protection and No Contact Orders.",
        "In addition to direct victim services we also offer education and training on these topics as well as programming about prevention education, bystander intervention, and men’s initiatives.",
        "At CAN we believe that all women and men deserve safety from harm, and we believe this safety may be achieved in multiple ways. We respect that gender, sexual orientation, race, ethnicity, class, religious beliefs and ability can be factors that shape experience with violence.",
        "If you are the victim of sexual assault/abuse, domestic/dating violence, stalking or a hate crime you can speak to a specially trained advocate in a confidential and safe setting. Recognizing that each situation is unique we will identify the specific options available to you both on and off campus, and we will help you evaluate the benefits and/or drawbacks of each option. You are not required to take any action, but if you choose to do so we will help you navigate the processes and procedures you decide to pursue. We will also create a safety plan for you to avoid further harm, and we will help you address the emotional impact of your experience by providing psycho-education about the type of violence you have experienced and because we are not counselors we provide referrals to counseling/therapeutic services on campus and in community agencies for ongoing support.",
        "If you are a student we can support you with academic advocacy (negotiating with professors, financial aid, referrals to campus support services, housing assignments, etc.) and institutional advocacy (human resources, departmental support, etc.) if you are a staff or faculty member. We can accompany you to processes that occur on and off campus, including criminal court cases, petitions for protective orders in civil court, student conduct hearings, and meetings and investigations with the UIC or Chicago police, the State’s Attorney’s office, the UIC Title IX investigators and the Dean of Students’ office.",
        "For additional information, please visit the Campus Advocacy Network’s website at can.uic.edu.",
        "If you would like to make a confidential appointment to speak with an advocate please call (312)413-8206 or email can-appointment@uic.edu.",
        "Our Outreach and Education team is responsible for disseminating information about interpersonal violence and prevention initiatives such as bystander intervention to the UIC community and they are available to create customized presentations to departments or organizations on request.",
        "If you would like to request further information about interpersonal violence or would like to request a workshop or presentation please call (312) 413-1025 or email can@uic.edu."
    ],
    "out_links": [
        "https://wlrc.uic.edu/",
        "http://uic.edu/",
        "https://wlrc.uic.edu/about-us/",
        "https://wlrc.uic.edu/about-us/team/",
        "https://wlrc.uic.edu/about-us/covid/",
        "https://wlrc.uic.edu/programs/",
        "https://wlrc.uic.edu/programs/upcomingevents/",
        "https://wlrc.uic.edu/programs/breathing-room/",
        "https://wlrc.uic.edu/programs/campus-advocacy-network/",
        "https://wlrc.uic.edu/programs/signature-programs/",
        "https://wlrc.uic.edu/programs/domestic-violence-awareness-month/",
        "https://wlrc.uic.edu/programs/womens-history-month/",
        "https://wlrc.uic.edu/programs/sexual-assault-awareness-month/",
        "https://wlrc.uic.edu/programs/global-youth-ambassadors-leadership-program/",
        "https://wlrc.uic.edu/programs/past-programs/",
        "https://wlrc.uic.edu/resources/",
        "https://wlrc.uic.edu/resources/for-dv-sa-survivors/",
        "https://wlrc.uic.edu/resources/winter-break-emergency-info/",
        "https://wlrc.uic.edu/resources/women-centered-campus-resources/",
        "https://wlrc.uic.edu/resources/tuition-award/",
        "https://wlrc.uic.edu/resources/reserve-our-space/",
        "https://wlrc.uic.edu/resources/printed-resources/",
        "https://wlrc.uic.edu/get-involved/",
        "https://wlrc.uic.edu/get-involved/jobs-volunteer/",
        "https://wlrc.uic.edu/contact-us/",
        "http://maps.uic.edu/",
        "http://can.uic.edu/",
        "https://can.uic.edu/education-and-outreach/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}