{
    "url": "https://tag.uic.edu/",
    "title": "Transfer Admission Guarantee | The University of Illinois at Chicago",
    "text": [
        "To enter the program you must be enrolled in a participating community college, meet with your TAG Advisor, complete and submit the TAG Pathways Participation Form and complete the requirements of the TAG program before applying to UIC.",
        "After joining, there will be additional paperwork to file. You will also need to stay in contact with your UIC transfer representative and maintain a 3.0 or better GPA, while satisfying additional requirements listed in the TAG Pathways Participation Form.",
        "For more information on TAG qualifications please contact your school's TAG Advisor. If you need help determining your school's TAG advisor use the find my TAG representative on this page.",
        "TAG is a partnership between UIC and your community college. The best source of information for your college’s TAG agreement is the TAG Advisor. The TAG Advisor is the expert in helping you prepare for TAG and ultimately your transition to UIC.",
        "",
        "Are you still unsure who to contact? Not a problem, use the find my TAG representative feature to find your TAG advisor.",
        "The deadline to submit the TAG Participation Form is September 15th for Fall and February 1st for Spring.",
        "Required questions are identified with an asterisk (*).",
        "To find out if you qualify for the TAG program please contact your TAG Advisor. Do you need help finding your TAG Advisor? Not a problem, use the TAG representative directory below by selecting your community college.",
        "If you are in need of further assistance, don’t worry, you can contact UIC TAG staff at by filling out the form on this page or calling 312-355-0564 between 9am - 5pm (CST/CDT).  While you wait for a response be sure to check out the frequently asked questions page for answers to commonly asked question about UIC TAG."
    ],
    "out_links": [
        "https://tag.uic.edu/programs",
        "https://tag.uic.edu/frequently-asked-questions",
        "https://registrar.uic.edu/transfer-assistance/",
        "https://admissions.uic.edu/undergraduate/application-process/newly-admitted-students/transfer-and-readmission-students",
        "http://tada.uic.edu/",
        "http://commuter.uic.edu/",
        "http://disabilityresources.uic.edu/",
        "http://emergency.uic.edu/",
        "http://library.uic.edu/",
        "http://www.uic.edu/depts/dos/studentveteranaffairs.shtml",
        "https://admissions.uic.edu/events",
        "http://maps.uic.edu/",
        "http://news.uic.edu/uicnews",
        "https://tag.uic.edu/about/visit-directions",
        "http://clery.uic.edu/",
        "http://oae.uic.edu/UnlawfulDiscrimination/index.htm",
        "http://oae.uic.edu/TitleIX/index.htm",
        "https://admissions.uic.edu/book-visit",
        "https://admissions.uic.edu/undergraduate/request-information",
        "https://admissions.uic.edu/apply-now"
    ]
}