{
    "url": "https://bts.uic.edu/projects/",
    "title": "Projects | AAAN Black Tech Scholars Program | University of Illinois at Chicago",
    "text": [
        "Take a look at our cohorts' past projects!",
        "In the history of the Black Tech Scholars program, we have done many projects and the such, and we have a lot of wonderful results to show. Here is a list of what we have done!",
        "Inherit Chicago offered Chicagoans and visitors a cultural journey through all of its arts, conversation, and food in a month-long, multi-event festival, happening across 30 neighborhood-based heritage museums and cultural centers – all members of the Chicago Cultural Alliance.",
        "The mission of NAJWA Dance Corps is to operate a professional dance company devoted to the performance, production and preservation of dance styles and techniques reflective of the African American dance heritage and experience; offer and provide high quality arts programming; and to make art accessible to audiences of all ages and cultural backgrounds.",
        "Our logo stands for the longevity of our organization. For over thirty years, NAJWA Dance Corps has served our Chicago community to preserve African American heritage and bring the power of the performing arts to both young and old. As we look toward the future, we are confident that we will continue to increase our reach within these communities and across the Chicago area.",
        "Through Artistic creativity, we tell the stories of cultures around the world and insight a deep appreciation for their experiences through the power of the performing arts.",
        "The purpose of the Smokin’ Spokes Road Dawg Cycling Club is to encourage cycling as a recreation and a sport. One of our main goals is to expand cycling in the Chicago metropolitan area. We also encourage the safety education of bicyclists, along with facilitating participation in various cycling activities.",
        "The UIC Black Tech Scholars Program works towards increasing diversity in the technology world by enhancing the business and coding skills of black students. Designed initially as a semester long program, scholars met for three hours once a week to gain instruction in the areas of business and programming, with this Website Creation being an example of these efforts.",
        ""
    ],
    "out_links": [
        "https://bts.uic.edu/",
        "http://uic.edu/",
        "https://bts.uic.edu/about-us/meet-the-scholars/",
        "https://bts.uic.edu/join-us/",
        "https://bts.uic.edu/partners/",
        "http://maps.uic.edu/",
        "http://bts.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}