{
    "url": "https://engineering.uic.edu/news-stories/professors-haiti-work-brings-real-world-experience-to-students/",
    "title": "Professor’s Haiti work brings real-world experience to students | College of Engineering | University of Illinois at Chicago",
    "text": [
        "The Covid-19 pandemic is disrupting daily life and systems around the world. Businesses, schools, municipalities, tourism and much more are being impacted as people scramble to keep operations going while keeping the public safe.",
        "For Quintin Williams Jr., a clinical assistant professor in industrial engineering, this is familiar territory. Williams has been volunteering in Leogane, Haiti, to help the people who have experienced multiple disasters.",
        "In 2010 an earthquake decimated Haiti. In 2016, Hurricane Matthew ravaged the Caribbean country with catastrophic flooding of up to 40 inches and a storm surge of up to 10 feet. The category 5 hurricane, the first since Felix in 2007, claimed the lives of nearly 600 people, and more than 35,000 people were left homeless.",
        "Williams partnered with Dr. Monique Germain, a faculty member in the nursing program at Chicago State University, and an organization called MedGroup HAITI, a non-governmental, apolitical, non-profit organization founded by several health professionals, after identifying a set of health problems ravaging the Haitian population.",
        "“I’m helping to improve health outcomes through free health screening, life skills and disaster training, and I’m working with the engineers who are building structures,” he said. “Hundreds of disadvantaged villagers have been vaccinated, given free medicines, and aided with homebuilding.”",
        "“I work directly with sanitation, and trying to engineer a process for recycling and structure building. We worked on re-engineering and improving sanitation methods of the villages, and integrating environmental and occupational safety public health education into the nursing curriculum at the university,” he added.",
        "Along with helping the people of Haiti, Williams is using the real-world experience and research with his industrial engineering students at UIC. He’s been able to connect his experience to independent study research with some students and present it at global health conferences.",
        "“I use this in classes where we talk about structure and safety engineering, when we talk about the laws that govern the way things are built,” he said. “In this case, Haiti doesn’t have the same structure. It’s a good example of how the U.S. system of operation building codes are logistically necessary when it comes to having structures that can survive those natural disasters.”",
        "While the professor is using the experience in his courses, he originally got involved because he “is inclined toward helping those who can’t help themselves.”",
        "“I’ve always been fascinated with Haiti,” said Williams. “I always wondered how it was possible to live in a community where the average person lives off less than one dollar a day. To experience abject poverty and still be around people who are humble and helpful to each other, to have that type of community spirit, and to be a position where you don’t have resources, it was a game changer for me. Instead of just looking at the brick and mortar institutions there, but to have a true grassroots community-based program was a phenomenal opportunity. I couldn’t pass that up.”",
        "Learn more about UIC’s industrial engineering program at https://mie.uic.edu/about/ie."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://mie.uic.edu/about/ie.",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}