{
    "url": "https://engineering.uic.edu/about/faculty/teaching-resources/online-teaching-essentials/",
    "title": "Online Teaching Essentials | College of Engineering | University of Illinois at Chicago",
    "text": [
        "From Dean Nelson: “You can teach either synchronously or asynchronously. If you are teaching asynchronously, please make yourself available to students during the regularly scheduled time. If you are delivering your lectures at the regularly scheduled class time, it will also be helpful for the students if they can get the lectures asynchronously (i.e., at other times in the day). Some of our students have returned home to other parts of the world and requiring them to watch a lecture at 3 a.m. is difficult. Also, some students might experience localized technical difficulties, or we may even experience at times some wide-scale interruptions. These sorts of issues can be greatly alleviated if we are offering asynchronous content delivery.”",
        "Recommended resources for online teaching and office hours.",
        "Get started",
        "Instructions and Videos",
        "Notes",
        "Frequently Asked Questions",
        "Alternatives",
        "Follow this link for the UIC Blackboard Collaborate page.",
        "During this unexpected time of remote learning, ACCC recommends that faculty use alternative assessment methods that avoid the need for secure proctored exams. For tips on online testing and assessment alternatives, see this short Remote Assessments and Examinations tutorial.",
        "If you must deliver an online exam and need a method to ensure academic integrity, UIC is offering faculty access through May 31, 2020, to two online proctoring tools: Respondus LockDown Browser and Respondus Monitor.",
        "Respondus is available only for exams conducted via Blackboard. Access it from the Tools menu in all Blackboard courses.",
        "If you choose to use Respondus, please remember that students may be dealing with varied technology access and setups at home. We encourage you to be flexible to accommodate their remote arrangements.",
        "Contact LTS@uic.edu with any questions about remote assessments or the Respondus tools.",
        "Resources for meetings, advising, office hours, and even teaching online. Learn more …",
        "Get started",
        "Instructions and Videos",
        "",
        "Notes",
        "Frequently Asked Questions",
        "Alternatives",
        "Find the UIC WebEx page here.",
        "Get started",
        "Instructions and Videos",
        "Notes",
        "Here is the UIC Zoom page.",
        "Get started",
        "Instructions and Videos",
        "Find the UIC Microsoft Teams page here.",
        "Find out about Webinars and workshops available with ACCC.",
        "A few steps to help protect yourself from online threats …"t, work on what you’ll see in the future,” Sahagun said. “Its’ exciting to go into a place that hasn’t necessarily been explored. Maybe I won’t be the first, but I can do my little piece and it will be exciting.”",
        "After the Guaranteed Paid Internship Program ended, Sahagun expressed interest in continuing research, and was able to stay on in the MSL. The following summer and fall semester, with Paprotny’s guidance and encouragement, Sahagun worked at the Center for Nanoscale Materials at Argonne National Laboratory as an undergraduate research associate. He learned laser writing, etching, and became a qualified user of their clean room—all things that set him up for the rest of his undergraduate research career.",
        "Sahagun spent the summer of 2018 at the Microsystems Technology Laboratories at MIT, as a research intern. His work at MIT was similar to some of the research he had conducted at UIC over the years; a field emission project. The idea was to create a low power device which could be used for portable x-rays by first responders, or perhaps to aid production in factories, to ensure parts are assembled correctly and aren’t missing components.",
        "Last summer, Sahagun worked as a research intern at the Center for Nanoscale Systems at Harvard University. It was his first experience working in photonics. He used a 3D printer and created wave guides out of polymers to reflect light and to connect the microscopic components.",
        "“When I arrived, a lot of the simulation work had been done to figure out the best shape for this wave guide, so there was reduced noise or transmission loss when light traverses through,” Sahagun said. “My work was to do a lot of the trial and error runs. How much power, scan speed, write speed, once I’d print something I’d look at it under microscope. So, that’s what I did, the beginning processes of fabrication.”",
        "He also took advantage of being close to MIT, and visited his former colleagues at the Microsystems Technology Labs several times per week, staying up to date on their work.",
        "This spring, Sahagun traveled with fellow student Aaron Schreyer-Miller to the Marvell Nanofabrication Laboratory at University of California, Berkeley, where the duo fabricated field emitters and electrodes for some of Paprotny’s MicroFliers.",
        "In addition to his accomplishments in the lab, Sahagun has been active on campus at UIC. He reestablished the dormant Eta Kappa Nu Iota Lambda Honor Society, and served as its president, a chapter that inducted 45 new members during his tenure. He co-founded the UIC chapter of the Society for Advancement of Chicanos/Hispanics and Native Americans in Science, and served as its vice president. He’s a member of the Society of Hispanic Professional Engineers, and the Honors College Advisory Board.",
        "Ironically, Sahagun hadn’t even planned on attending college in the first place.",
        "Sahagun, from Chicago Heights, had a brother studying medicine at UIC, and knew the financial burden it would place on his family to have two children in school at the same time. But his friends were all applying to college, he had a fee waiver to take the ACT and one to apply to UIC, and decided to go for it. The only problem? He didn’t know what to study.",
        "Fortunately, in his sophomore year at Bloom High School, Sahagun and his classmates were given an assignment to write a paper and do a presentation on a career, and he randomly chose electrical engineering.",
        "“I literally pulled the career out of a hat,” Sahagun said. “I had to write an essay for the UIC application, I was like, what do I do now? So, I wrote about that.”",
        "Sahagun received scholarships to attend UIC, including the President’s Award Program Honors Scholars Program.",
        "“I wasn’t the best student in high school, but being here gave me motivation. I felt like, someone believes in me and gave me this funding,” Sahagun said. “What do I have to lose?”",
        "When he arrived on campus and learned more about electrical engineering, he knew it was what he wanted to pursue.",
        "After his doctoral program, Sahagun said he’s not sure if he wants to go into industry, or teach. For now, he’s excited to see where the research takes him, and is grateful for where UIC has gotten him.",
        "“Dr. Paprotny, Dr. Caliskan, Dr. Jim Kosmach, and Dr. Timothy Murphy, all had a positive impact on my undergraduate and professional career, and I cannot imagine going through my time at UIC without their support and guidance. I feel very lucky,” Sahagun said."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://honors.uic.edu/",
        "https://ece.uic.edu/profiles/igor-paprotny-phd/",
        "http://www1.ece.uic.edu/~paprotny/",
        "http://www1.ece.uic.edu/~paprotny/MSL_index.html",
        "https://ece.uic.edu/news-stories/for-senior-aaron-schreyer-miller-undergraduate-research-key-to-his-success-at-uic/",
        "https://www.ece.uic.edu/~hkn/",
        "https://aes.uic.edu/programs/presidents-award-program.html",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}