{
    "url": "https://engineering.uic.edu/news-stories/mie-phd-candidate-wins-award-for-graduate-research/",
    "title": "MIE PhD candidate wins Award for Graduate Research | College of Engineering | University of Illinois at Chicago",
    "text": [
        "MIE PhD candidate Rukmava Chatterjee has won several awards at UIC, and the prolific student just secured another one. Chatterjee was named the winner of the Award for Graduate Research (AGR) for the project “Exceptional anti-ice and anti-frost performance of multifunctional phase change materials.”",
        "The award is the Graduate College’s longest-running support for research by graduate students at UIC. It is designed to allow students to take advantage of unique opportunities to further their research, and to aid progress toward their degrees.",
        "“We are all facing personal and professional challenges due to the current worldwide COVID-19 pandemic. Amidst such circumstances, getting recognized for my PhD research by means of the AGR has delighted and motivated me,” said Rukmava Chatterjee, who works under the direction of Assistant Professor Sushant Anand in the Laboratory for Engineering Surface Dynamics at UIC.",
        "His research is focused on using certain phase change materials in the form of spray-on anti-icing solutions for real life applications in cold weather. He has formulated a wide library of multi-functional anti-icing coatings with varying viscosities which can be easily painted on any industrially relevant surface. The research has the potential to significantly impact multiple industries including, airlines, power transmission, wind power, HVAC, and automobile.",
        "The student’s success is rooted in a supportive environment where he has the opportunity to be creative and receive the backing he requires.",
        "“Professor Anand has been extremely supportive of my research activities by providing constant academic guidance, necessary research infrastructure, and the opportunity to explore a wide-variety of interesting projects as a part of my doctoral dissertation. I am also thankful to my labmates Dr. Hassan Bararnia and Umesh Chaudhuri, who helped me in this project,” he said.",
        "His success is applauded by Anand, and the professor speaks highly of his student.",
        "“I have come to appreciate him as a great student and person of remarkable character. The work done by Rukmava has been one of the mainstays of our lab and I am extremely proud of him,” said Anand. “A key characteristic I have come to learn and admire about him is that he works on hypothesis-driven research, and has the ability to break complex problems in to smaller subsets that are easier to deal with. He possesses the two fundamental qualities that are required for anyone to be successful in the field of academia – the tenacity to overcome stumbling blocks, and character to pursue truth. Rukmava is a gifted researcher and the extensive breadth of research he is performing during his doctoral studies shows this.”",
        "Earlier this year, Chatterjee won the “UIC Graduate Student Council Travel Award” for presenting a conference paper at the American Institute of Chemical Engineers annual meeting. In 2019, he won first place in the “Pritzker Nanofabrication Facility Annual Nanofabrication Image Contest” by University of Chicago, second place in the “Image Of Research 2019” contest held by UIC, first place in “Water Photo Contest” by the American Chemical Society, “Best Oral Presentation Award” sponsored by Coatings and awarded by American Institute of Sciences for outstanding oral presentation at International Conference on Nature Inspired Surface Engineering, and the “Faydor Litvin Graduate Award” from the UIC Department of Mechanical and Industrial Engineering Department in recognition of academic achievement and service to the department and graduate student community.",
        "Learn more about MIE’s graduate programs at https://mie.uic.edu/graduate."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://anand.lab.uic.edu/",
        "https://mie.uic.edu/graduate.%20/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}