{
    "url": "https://cme.uic.edu/undergraduate/civil-engineering-major/",
    "title": "Civil Engineering Major | Department of Civil and Materials Engineering | University of Illinois at Chicago",
    "text": [
        "Civil engineering immerses you in the built environment. Civil engineers oversee the smart and responsible design and creation of structures and systems that are familiar to all of us: roads, bridges, buildings, airports, sewer systems, and more. Increasingly they are concerned not only with the what of the world around us, but the how: the ways in which people live in and utilize the built environment, and how we can optimize that for the benefit of human beings and the planet.",
        "Civil engineering is a field with many pathways, and a UIC education will open them for you. Students who pursue an undergraduate major in civil engineering may find themselves drawn to careers in structural engineering (including designing structures to manage an increasing incidence of natural disasters), urban planning, coastal preservation, transportation engineering, water-resources management, materials science, environmental engineering, and beyond.",
        "Your vision of your future career will be shaped by your UIC coursework, the faculty mentors you encounter here, and the strong support of your fellow students.",
        "Civil engineering majors complete coursework in three categories:",
        "Students majoring in civil engineering have the chance to create an area of specialization in their undergraduate degree by completing a concentration. We offer several concentration areas, which can be explored through enrollment in the relevant technical elective courses. Expand the sections below to learn about each concentration.",
        "Construction engineering and management sits at the intersection of engineering technical competence and project management science. It entails working in interdisciplinary teams with people from diverse backgrounds to implement the best and most efficient engineering design. Construction management is the “science and art” of ensuring that complex building and civil infrastructure projects are completed successfully—on time and under budget.",
        "Courses:",
        "Environmental engineering and water resources is an extensive discipline dedicated to addressing environmental issues in air, water, and soil. It covers the science and design of water treatment systems that support our society, as well as design of hydraulic structures and systems to handle hydrologic flow.",
        "Courses:",
        "Geotechnical engineering covers the engineering behavior of earth materials, and it has applications in military, mining, petroleum and other disciplines occurring on the surface or within the ground. It includes the fundamentals of foundation analysis and design, site characterization, analysis and design of shallow and deep foundations and earth retaining structures, environmental laws and regulations, sources of environmental contamination and waste treatment options.",
        "Courses:",
        "Materials—including metals, intermetallics, polymers, ceramics, composites, and electronic materials—are critical to modern industrial society. Materials engineering addresses the design, manufacture, and characterization of materials for specific applications.",
        "Courses:",
        "Structural engineers are trained to design the bones and muscles that create the form and shape of man-made structures. Structural engineering includes the design of metal, masonry, wood, and reinforced concrete buildings and structures; bridge design; pre-stressed concrete design; and advanced methods of structural analysis. This concentration also helps students to prepare for the Professional Engineer and Structural Engineer exams.",
        "Courses:",
        "Sustainability is key in civil engineering to ensure that the systems designed and built by civil engineers can provide for current and future generations. The sustainability concentration includes foundational elements of environmental sustainability, sustainable urban infrastructure design, engineering hydrology, and hydraulic design.",
        "Courses:",
        "Transportation engineers plan, design, build, operate, and maintain systems to provide for the safe, efficient, and convenient movement of people and goods. Transportation engineering covers geometric design of highways; traffic engineering and control; the study of driver, vehicle and roadway system characteristics; intersection design and operation; highway capacity analysis; and traffic signal design.",
        "Courses:",
        "UIC offers a wide range of scholarships and other forms of financial assistance. Some scholarships are designed for new students; others are open to continuing students. Learn more about these programs on our College scholarships page.",
        "As part of the accreditation process, ABET asks our department to capture the overall goals of the undergraduate programs in civil engineering. These are called our program educational objectives.",
        "Graduates of the civil engineering program at the University of Illinois at Chicago will establish careers in engineering, research and development, and/or management professions and will be involved in professional societies. Within a few years of completing the program, graduates are expected:",
        "Civil engineering is a regulated profession, meaning that a majority of professionals in the field will become licensed Professional Engineers within five years of graduation. To attain this license, a civil engineering student must take and pass the Fundamentals of Engineering exam to become certified as an Engineer-in-Training. A new civil engineer then must take the Principles of Engineering exam. When that exam is passed, and when the new civil engineer has successfully demonstrated sufficient evidence of work experience and other qualifications required by the state and jurisdiction in which he or she works, the Professional Engineer license will be awarded. The PE license is highly regarded in the industry and opens doors to many successful and rewarding careers.",
        "Civil engineering graduates who choose to practice structural engineering also will need to become licensed Structural Engineers within 10 years of their graduation.",
        "Another part of the ABET accreditation process requires our department to identify the specific knowledge and skills that students are intended to have when they complete their undergraduate education. These are called student outcomes.",
        "Students graduating from the civil engineering program at UIC will have:",
        "In the 2019-2020 academic year, 353 students were enrolled at UIC Engineering as civil engineering majors across all class years. The department graduated 70 civil engineering majors in the academic year ending May 2019."
    ],
    "out_links": [
        "https://cme.uic.edu/",
        "http://uic.edu/",
        "https://cme.uic.edu/undergraduate/",
        "https://cme.uic.edu/undergraduate/admitted-students/",
        "https://cme.uic.edu/undergraduate/admissions/",
        "https://cme.uic.edu/undergraduate/abet-accreditation/",
        "https://cme.uic.edu/undergraduate/courses/",
        "https://cme.uic.edu/undergraduate/minors/",
        "https://cme.uic.edu/undergraduate/internships-and-jobs/",
        "https://cme.uic.edu/undergraduate/student-organizations/",
        "https://cme.uic.edu/undergraduate/undergraduate-student-profiles/",
        "https://cme.uic.edu/undergraduate/student-resources/",
        "https://cme.uic.edu/graduate/",
        "https://cme.uic.edu/graduate/admitted-students/",
        "https://cme.uic.edu/graduate/admissions/",
        "https://cme.uic.edu/graduate/courses/",
        "https://cme.uic.edu/graduate/ms-in-construction-engineering-and-management/",
        "https://cme.uic.edu/graduate/ms-programs/",
        "https://cme.uic.edu/graduate/doctoral-programs/",
        "https://cme.uic.edu/graduate/phd-dissertations/",
        "https://cme.uic.edu/graduate/post-graduation-outcomes/",
        "https://cme.uic.edu/graduate/student-profiles/",
        "https://cme.uic.edu/graduate/student-resources/",
        "https://cme.uic.edu/cme-research/",
        "https://cme.uic.edu/cme-research/labs/highbay/",
        "https://cme.uic.edu/cme-research/labs/",
        "https://cme.uic.edu/cme-research/cme-research-areas/",
        "https://cme.uic.edu/cme-research/students/",
        "https://cme.uic.edu/cme-research/seminars/",
        "https://cme.uic.edu/faculty-and-staff/",
        "https://cme.uic.edu/faculty-and-staff/department-head/",
        "https://cme.uic.edu/faculty-and-staff/faculty/",
        "https://cme.uic.edu/faculty-and-staff/courtesy-and-dual-faculty/",
        "https://cme.uic.edu/faculty-and-staff/emeritus-faculty/",
        "https://cme.uic.edu/faculty-and-staff/faculty-awards/",
        "https://cme.uic.edu/faculty-and-staff/cepac/",
        "https://cme.uic.edu/faculty-and-staff/staff/",
        "https://cme.uic.edu/faculty-and-staff/open-positions/",
        "https://cme.uic.edu/cme-news/",
        "https://cme.uic.edu/cme-events/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://catalog.uic.edu/ucat/colleges-depts/engineering/cme/bs-cive/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://catalog.uic.edu/all-course-descriptions/cme/",
        "https://admissions.uic.edu/undergraduate",
        "https://admissions.uic.edu/",
        "https://cme.uic.edu/cme-room-reservation-form/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}