{
    "url": "https://bioe.uic.edu/undergraduate/bioengineering-major/",
    "title": "Bioengineering Major | Richard & Loan Hill Department of Bioengineering | University of Illinois at Chicago",
    "text": [
        "A bioengineering major prepares you to work in the unique intersection where living systems and nonliving systems come together.",
        "The natural world is an amazing, highly complex place that the bioengineering major will help you to understand. Perhaps equally amazing is the universe of approaches that human beings have identified—and are continuing to develop—to make our quality of life even better.",
        "Studying bioengineering as an undergraduate at UIC will help you apply quantitative analysis and design to living systems and hybrid systems (which contain some living components). Many paths become open to you as a bioengineering major. Perhaps you want to become a bioengineer, designing smart replacements for tissue or bone, developing new tools for non-invasive medical imaging or diagnostics, or shaping molecules into revolutionary new drug therapies. Maybe you want to move on to medical school, dental school, graduate work in pharmacy, or law school with a focus on patent law.",
        "No matter what part of bioengineering excites you the most, and whether you envision graduate school or industry work after graduation, the UIC bioengineering major will offer you solid preparation.",
        "The bioengineering major is outlined in detail in the course catalog; the information below provides an overview.",
        "Bioengineering majors complete coursework in four categories:",
        "Nonengineering and general education courses provide you with a foundation in the sciences and make you a well-informed graduate in disciplines outside of bioengineering. You will take 67 to 68 credit hours in this area, including fundamental courses in biology, chemistry, physics, and math, as well as a range of “chart-your-own-path” classes in categories such as Understanding the Past and Exploring World Cultures. For details on general education requirements, please consult the course catalog.",
        "Students earn 39 credit hours from engineering courses that all bioengineering majors must take. These courses—including Bioinstrumentation and Measurement, Biotransport, and Biostatistics—offer a thorough introduction to the field. For details on these requirements, please consult the course catalog.",
        "Students earn 13 to 16 credit hours in this group, which includes a course in computer science, a course in electrical and computer engineering, and three bioengineering electives. You have two or more choices in most of these categories. For an explanation of the options, see the course catalog.",
        "Each student works with a faculty advisor to develop a slate of courses totaling 9 credits in one of the four bioengineering concentrations: bioinformatics, biomedical imaging, cell and tissue engineering, or neural engineering. Concentrations represent a specific research area or professional interest, a helpful distinguishing factor when you move on to graduate study or look for full-time jobs.",
        "As explained above, concentrations allow you to define an area of focus for your bioengineering major. The department offers four concentrations, each of which requires that you complete a specific collection of courses. The concentration options are:",
        "The bioinformatics concentration brings together computer science, statistics, and molecular biology to explain how genetics directly affect the function of all living things. Students pursuing this option begin its requirements with BIOE 480 Introduction to Bioinformatics, which focuses on using computers to analyze gene sequences and other forms of biological information. They also learn how to use bioinformatics tools in BIOE 481 Bioinformatics Laboratory, which offers rigorous hands-on experience.",
        "Important: The courses listed below are typical of Concentration Area Elective (CAE) courses chosen by Bioinformatics students. This is NOT a complete list of appropriate courses. Specific course choices should be made in consultation with the advisor. Appropriate CAE courses will provide depth in the discipline of Bioinformatics and help to make the student competitive for the position or program that will be entered after the B.S. CAE courses must comply with the guidelines listed on the Concentration Area Elective form, available in the BioE office or under the Forms link on the BioE website. Be sure to use the CAE form for the curriculum you are following.",
        "Biomedical imaging provides ways to see inside the human body: enhancing current methods, such as magnetic resonance, ultrasound, and nuclear imaging, as well as exploring the cutting edge. Required courses include BIOE 421 Biomedical Imaging, which delves into the engineering and scientific principles associated with x-ray, magnetic resonance, ultrasound, computed tomographic and nuclear imaging. In this concentration’s lab course, BIOE 423, students have the chance to practice acquiring and processing real biomedical imaging data. Students are also required to take more in-depth courses in magnetic resonance imaging, BIOE 422 and optical imaging, BIOE 470 or BIOE 471.",
        "Required Courses",
        "Selective Courses. In addition to the 4 courses listed above, students may select one of the following courses to fulfill the CAE course requirement. Other courses not listed will be considered as substitutions on a case-by-case basis in consultation with the student’s academic advisor and the Director of Undergraduate Studies.",
        "Cell and tissue engineers create and grow biological structures that can restore human function, such as insulin production, or stimulate the body to repair injuries by regenerating itself. This concentration begins with BIOE 455 Introduction to Cell and Tissue Engineering, in which students explore emerging trends and technologies in this field. In the lab course, BIOE 456, students learn all about polymer scaffold fabrication, microstamping biomolecules, cellular adhesion and proliferation assays, and immo/fluorescent tagging. (If you don’t know what all of that is right now, don’t worry—you will!)",
        "Important: The courses listed below are typical of Concentration Area Elective (CAE) courses chosen by Bioinformatics students. This is NOT a complete list of appropriate courses. Specific course choices should be made in consultation with the advisor. Appropriate CAE courses will provide depth in the discipline of Bioinformatics and help to make the student competitive for the position or program that will be entered after the B.S. CAE courses must comply with the guidelines listed on the Concentration Area Elective form, available in the BioE office or under the Forms link on the BioE website. Be sure to use the CAE form for the curriculum you are following.",
        "Neural engineering uses artificial bioelectric interfaces to create neuro-prosthetic devices such as cochlear implants, which are in use today, and a silicon retina, which is being developed. Students learn about modeling and design of neural engineering devices in BIOE 475 Neural Engineering I: Introduction to Hybrid Neural Systems. In the lab, students have the chance to work with animals as they get hands-on experience with computational and experimental models of engineered neural systems, especially neuroprostheses and biosensors.",
        "Important: The courses listed below are typical of Concentration Area Elective (CAE) courses chosen by Bioinformatics students. This is NOT a complete list of appropriate courses. Specific course choices should be made in consultation with the advisor. Appropriate CAE courses will provide depth in the discipline of Bioinformatics and help to make the student competitive for the position or program that will be entered after the B.S. CAE courses must comply with the guidelines listed on the Concentration Area Elective form, available in the BioE office or under the Forms link on the BioE website. Be sure to use the CAE form for the curriculum you are following.",
        "To explore the bioengineering major in greater detail, here are some key resources:",
        "As part of our accreditation process, ABET asks our department to capture the overall goals of the bioengineering program. These are called our educational program objectives. They are:",
        "Another part of the ABET accreditation process requires the department to identify the specific knowledge and skills that students are intended to have when they complete their undergraduate education. These are called student outcomes.",
        "Students graduating from the bioengineering program at UIC will have:",
        "In the 2019-2020 academic year, 335 students were enrolled at UIC Engineering as bioengineering majors across all class years. The department graduated 65 bioengineering majors in the academic year ending May 2019."
    ],
    "out_links": [
        "https://bioe.uic.edu/",
        "http://uic.edu/",
        "https://bioe.uic.edu/undergraduate/",
        "https://bioe.uic.edu/undergraduate/admissions/",
        "https://bioe.uic.edu/undergraduate/admitted-students/",
        "https://bioe.uic.edu/undergraduate/accreditation/",
        "https://bioe.uic.edu/undergraduate/bioinformatics-major/",
        "https://bioe.uic.edu/undergraduate/bioengineering-minor/",
        "https://bioe.uic.edu/undergraduate/courses-undergraduate/",
        "https://bioe.uic.edu/internships-and-jobs/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://bioe.uic.edu/undergraduate-student-organizations/",
        "https://bioe.uic.edu/undergraduate/undergraduate-student-profiles-bioe/",
        "https://bioe.uic.edu/undergraduate/student-resources-undergraduate/",
        "https://bioe.uic.edu/graduate/",
        "https://bioe.uic.edu/graduate/admissions/",
        "https://bioe.uic.edu/graduate/admitted-students/",
        "https://bioe.uic.edu/graduate/courses-graduate/",
        "https://bioe.uic.edu/graduate/ms-programs/",
        "https://bioe.uic.edu/graduate/phd-programs/",
        "https://bioe.uic.edu/graduate/dissertations/",
        "https://bioe.uic.edu/graduate/post-graduation-outcomes/",
        "https://bioe.uic.edu/graduate/graduate-student-profiles/",
        "https://bioe.uic.edu/graduate/student-resources-graduate/",
        "https://bioe.uic.edu/bioe-research/",
        "https://bioe.uic.edu/bioe-research/research-2/",
        "https://bioe.uic.edu/bioe-research/featured-research/",
        "https://bioe.uic.edu/bioe-research/grants/",
        "https://bioe.uic.edu/bioe-research/labs/",
        "https://bioe.uic.edu/faculty-and-staff/",
        "https://bioe.uic.edu/about-us/",
        "https://bioe.uic.edu/faculty-and-staff/department-head/",
        "https://bioe.uic.edu/faculty-and-staff/faculty/",
        "https://bioe.uic.edu/faculty-and-staff/affiliate-faculty/",
        "https://bioe.uic.edu/faculty-and-staff/emeriti/",
        "https://bioe.uic.edu/faculty-and-staff/staff/",
        "https://bioe.uic.edu/faculty-and-staff/faculty-jobs/",
        "https://bioe.uic.edu/bioe-news/",
        "https://bioe.uic.edu/bioe-news/annual-report/",
        "https://bioe.uic.edu/bioe-news/newsletter/",
        "https://bioe.uic.edu/bioe-news/bioe-news-archive/",
        "https://bioe.uic.edu/bioe-events/",
        "https://bioe.uic.edu/bioe-events/upcoming-events/",
        "https://bioe.uic.edu/bioe-events/calender/",
        "https://bioe.uic.edu/bioe-events/annual-events/",
        "https://bioe.uic.edu/bioe-events/seminar-archive/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "https://medicine.uic.edu/",
        "http://maps.uic.edu/",
        "https://catalog.uic.edu/ucat/colleges-depts/engineering/bioe/bs/",
        "https://catalog.webhost.uic.edu/ucat/cat1315archive/EGBIOEENGR.shtml",
        "https://catalog.webhost.uic.edu/ucat/catalog/EGBIOEENGR.shtml",
        "https://web.bioe.uic.edu/bioe-wp/bioe-undergrad/curr_flow_fa16present.htm",
        "https://web.bioe.uic.edu/bioe-wp/bioe-undergrad/curr_flow_fa14sp16.htm",
        "https://web.bioe.uic.edu/bioe-wp/bioe-undergrad/curr_flow_fa12sp14.htm",
        "https://catalog.uic.edu/ucat/course-descriptions/bioe/",
        "https://bioe.uic.edu/undergraduate/student-resources/",
        "http://engineering.uic.edu/undergraduate-admissions/",
        "http://bioe.uic.edu/undergraduate/bioengineering-major/dual-degree-bs-ms/",
        "http://bioe.uic.edu/undergraduate/bioengineering-minor/",
        "http://bioe.uic.edu/undergraduate/accreditation/",
        "https://admissions.uic.edu/",
        "https://admissions.uic.edu/apply-now",
        "https://financialaid.uic.edu/",
        "https://forms.uofi.uic.edu/sec/1820274",
        "https://bioe.uic.edu/undergraduate/bioengineering-major/dual-degree-bs-ms/",
        "https://bioe.uic.edu/internships-and-jobs/research-experiences-for-undergraduates/",
        "https://bioe.uic.edu/undergraduate/student-resources-undergraduate/undergraduate-academic-advising/",
        "https://bioe.uic.edu/contact/",
        "https://ehso.uic.edu/",
        "https://drc.uic.edu/",
        "https://www.uic.edu/about/visit-directions",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://bioe.uic.edu/bioepay/",
        "https://bioe.uic.edu/hr-procedures/",
        "https://bioe.uic.edu/rooms/",
        "https://bioe.uic.edu/media-resources/",
        "https://bioe.uic.edu/teaching-resources/",
        "https://bioe.uic.edu/teaching-online/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}