{
    "url": "https://merrp.engr.uic.edu/",
    "title": "UIC | Minority Engineering Recruitment and Retention Program",
    "text": [
        "With free tutoring for many science, math, and engineering courses MERRP supports students through its successful Supplemental Instruction program. The tutors are all fellow students who have previously completed the course they are instructing receiving a \"B\" or better. Come visit our office in SEL-E 2065 to sign up and receive more information about the program!",
        "The Minority Engineering Recruitment and Retention Program  coordinates and assists with a multitude of programs. Not included in this list is the large number of engineering societies that work with MERRP to help students excel in their major!",
        "A UIC Summer College program, the Preparation for Majoring in Engineering (PrepME) Workshop creates a positive, motivating, welcoming classroom environment for incoming freshmen while priming them for the challenges of engineering!",
        "The Director of Minority Affairs manages the recruitment efforts, retention efforts, and student success program for the College of Engineering. Providing direction for what majors students could consider and which courses to select in the field of engineering or computer science, Gerry is often found engaging with students within the MERRP Office.",
        "Graduate Assistants are the recruitment arm for UIC's College of Engineering and act as mentors within the MERRP office. Student Workers help maintain the academic atmosphere in the office while also fulfilling various office duties. During the summer, GAs and Student Workers instruct the Preparation for Majoring in Engineering program, helping incoming freshman transition into a college environment.",
        "Supplemental Instruction (SI) tutors support the academic success of students. Having obtained a grade of B or better in the course they are instructing, SI tutors provide for-student-by-student instruction with a minimized gap in knowledge to help easily explain complex engineering concepts.",
        "Minority Engineering Recruitment and Retention Program, designed to assist underrepresented Black, Latino, and Native American students earning degrees in the engineering profession has played a key role in providing academic and professional development services to students for over 30 years. MERRP currently offers these services to more than 300 students; augmenting their requisite skills in academic subjects and enhancing their career experiences."
    ],
    "out_links": [
        "https://merrp.engr.uic.edu/index.html",
        "https://merrp.engr.uic.edu/service.html",
        "https://merrp.engr.uic.edu/diversity.html",
        "https://merrp.engr.uic.edu/recruiting.html",
        "https://merrp.engr.uic.edu/contact.html",
        "http://engineering.uic.edu/donate/",
        "http://www.uic.edu/",
        "https://engineering.uic.edu/"
    ]
}