{
    "url": "https://gat.uic.edu/frequently-asked-questions",
    "title": "FAQ | Guaranteed Admissions Transfer | The University of Illinois at Chicago",
    "text": [
        "Unfortunately, international and undocumented star scholars are not eligible to receive the UIC Star Scholarship however, if you are qualified for the GAT program you are most definitely invited to participate and transfer into UIC with guaranteed admission.",
        "The participation form gives UIC permission to begin contacting you in regards to transfer and allows us to send regular emails with updates and other important information. Without your permission we are unable to contact you.",
        "The participation form is not your application to UIC so you are not locked into coming to UIC. You have at least 1 year from the signing of your participation form to decide if UIC is the right place for you. This is why we invite you to come meet with some key individuals on campus so that we can help you learn more about us and get a better feel for what life is like as a student at UIC.",
        "No need to worry. Sometimes things happen that may affect your GPA causing it to transfer over to UIC under the required 3.0. As long as you have submitted everything that we ask for, your application will be added in with the other transfer applications and you will then be considered along with all other transfer students for a spot in your chosen field of study. This means you are no longer guaranteed a spot and will be required to compete with other applicants for entry into UIC.",
        "We have this all worked out. Although we strongly encourage you to complete your associates degree before you transfer to UIC, if you do happen to leave CCC and you are still missing a class or two it is possible to do what we call a “reverse transfer\". In other words, you would complete those last few courses during your first year at UIC and with your permission, we will send a copy of your UIC transcript with your final grades back to your community college so that you may then be awarded your associates degree. You will want to work with your advisors at both schools to ensure this option will work for you.",
        "If you have previous college coursework outside of CCC you are not eligible for the GAT program. However, you are still more than welcome to apply as a transfer student.",
        "If you do not qualify for GAT you will want to follow your transferology guide so you can be sure that you are taking the courses required for your degree program at UIC. This ensures that when you are ready to apply you may simply apply as a transfer student through our regular transfer process. It will also be very helpful for you to meet with your academic advisor at your community college as well.",
        "Meet with your CCC academic advisor and complete the participation form.",
        "Last modified: July 14, 2017 03:36pm."
    ],
    "out_links": [
        "https://gat.uic.edu/",
        "https://gat.uic.edu/star-scholarship",
        "https://gat.uic.edu/stem",
        "https://gat.uic.edu/programs",
        "https://registrar.uic.edu/transfer-assistance/",
        "https://admissions.uic.edu/undergraduate/application-process/newly-admitted-students/transfer-and-readmission-students",
        "http://tada.uic.edu/",
        "http://commuter.uic.edu/",
        "http://disabilityresources.uic.edu/",
        "http://emergency.uic.edu/",
        "http://library.uic.edu/",
        "http://www.uic.edu/depts/dos/studentveteranaffairs.shtml",
        "https://admissions.uic.edu/events",
        "http://maps.uic.edu/",
        "http://news.uic.edu/uicnews",
        "https://gat.uic.edu/about/visit-directions",
        "http://clery.uic.edu/",
        "http://oae.uic.edu/UnlawfulDiscrimination/index.htm",
        "http://oae.uic.edu/TitleIX/index.htm",
        "https://admissions.uic.edu/book-visit",
        "https://admissions.uic.edu/undergraduate/request-information",
        "https://admissions.uic.edu/apply-now"
    ]
}