{
    "url": "https://tag.uic.edu/frequently-asked-questions",
    "title": "FAQ | Transfer Admission Guarantee | The University of Illinois at Chicago",
    "text": [
        "Your citizenship status has no bearing on whether or not you can participate in this program. As long as you are a student at a participating community college and you meet the TAG requirements we would love to have you join us as a member of the next TAG cohort.",
        "No need to worry. Sometimes things happen that may affect your gpa causing it to transfer over to UIC under the required 3.0. As long as you have submitted everything that we ask for your application will be added in with the other transfer applications and you will then be considered along with all other transfer students for a spot in your chosen field of study. This means you are no longer guaranteed a spot and will be required to compete with other applicants for entry into UIC.",
        "Although we strongly encourage you to complete your associate’s degree before you transfer to UIC, if you do happen to leave your community college and you are missing a class or two it may be possible to do what we call a “reverse transfer”. In other words, you would complete those last few courses during your first year at UIC and with your permission, we will send a copy of your UIC transcript with your final grades back to your community college so that you may then be awarded your associate’s degree.",
        "Last modified: April 23, 2018 05:57pm."
    ],
    "out_links": [
        "https://tag.uic.edu/",
        "https://tag.uic.edu/programs",
        "https://registrar.uic.edu/transfer-assistance/",
        "https://admissions.uic.edu/undergraduate/application-process/newly-admitted-students/transfer-and-readmission-students",
        "http://tada.uic.edu/",
        "http://commuter.uic.edu/",
        "http://disabilityresources.uic.edu/",
        "http://emergency.uic.edu/",
        "http://library.uic.edu/",
        "http://www.uic.edu/depts/dos/studentveteranaffairs.shtml",
        "https://admissions.uic.edu/events",
        "http://maps.uic.edu/",
        "http://news.uic.edu/uicnews",
        "https://tag.uic.edu/about/visit-directions",
        "http://clery.uic.edu/",
        "http://oae.uic.edu/UnlawfulDiscrimination/index.htm",
        "http://oae.uic.edu/TitleIX/index.htm",
        "https://admissions.uic.edu/book-visit",
        "https://admissions.uic.edu/undergraduate/request-information",
        "https://admissions.uic.edu/apply-now"
    ]
}