{
    "url": "https://tag.uic.edu/programs",
    "title": "Programs | Transfer Admission Guarantee | The University of Illinois at Chicago",
    "text": [
        "Students are strongly encouraged to complete equivalent courses to the following UIC courses for admission to the Rehabilitation Sciences degree:",
        "Students are strongly encouraged to complete equivalent courses to the following UIC courses for admission to the Kinesiology degree:",
        "",
        "* Non-cadaver Lab AP transfer courses would require the addition of KN 255 & KN 256 once enrolled in the BS in Kinesiology program.",
        "Complete equivalent courses for the following UIC courses listed below",
        "Note: Programs listed for the College of Architecture, Design, & the Arts only admit for the fall semester.",
        "Students are strongly encouraged to complete an equivalent course for the following UIC required major course:",
        "Complete equivalent courses for at least FIVE of the following UIC required major courses listed below",
        "Students are strongly encouraged to complete an equivalent course for the following UIC required major course:",
        "Complete equivalent courses for at least FIVE of the following UIC required major courses listed below",
        "Complete equivalent courses for one of the following UIC tracks for a total of ten hours",
        "Students should take ENGL 160 and ENGL 161, AND one of the mathematics tracks as early as possible, since these courses are prerequisites for most of the business core courses. We also strongly recommend Students take ECON 120 and ECON 121 as these courses also serve as prerequisite for other Business courses and will ensure academic progress within the degree program.",
        "Complete equivalent courses for at least 60 hours of prerequisite postsecondary course work in the following two categories:",
        "a An earned Associate of Arts or Associate of Science Degree from an Illinois Community College fulfills the General Education requirements, per the Illinois Articulation Initiative.",
        "b Other Mathematics, Calculus, Statistics or quantitative analysis courses are highly recommended prerequisites that can be taken in order to satisfy the 24 hours of Elective requirements.",
        "Complete equivalent courses for one of the following UIC tracks for a total of ten hours",
        "Students should take ENGL 160 and ENGL 161, AND one of the mathematics tracks as early as possible, since these courses are prerequisites for most of the business core courses. We also strongly recommend Students take ECON 120 and ECON 121 as these courses also serve as prerequisite for other Business courses and will ensure academic progress within the degree program.",
        "To be accepted as an accounting major, you need a \"B\" average in your Introductory Financial Accounting and Introductory Managerial Accounting Courses. If you do not maintain a \"B\" average, but have at least a \"C\" in each of those classes, you may take the Accounting Placement Examination (APE) to gain acceptance into the major. All transfer students must take the APE or repeat Actg 210 Financial and Actg 211 Managerial Accounting here at UIC.",
        "Students are strongly encouraged to complete an equivalent course, if available, for the following UIC required major courses:",
        "Students are strongly encouraged to complete an equivalent course for the following UIC required major course:",
        "The College of Business Administration requires at least two years of a single foreign language in high school, with minimum grades of C, as a criterion for admission. Students who are admitted with a deficiency in this area must take two semesters of a single foreign language at the college level with minimum grades of C, or prove proficiency in a foreign language.",
        "The following courses are a part of the Online BBA curriculum and will be taken at UIC within the program. Students are advised not to complete the following equivalent courses at the community college level:",
        "A maximum of 4 substitute courses can be used should any of the courses listed above be completed upon admission.",
        "Students are strongly encouraged to complete an equivalent course for the following UIC required major courses:",
        "Transfer students who will not have completed all the requirements to begin the professional course sequence, may need to extend time to degree.  Please consult a College of Education Academic Advisor for candidacy requirements. Please note completion of the professional sequence in the Urban Education major takes a minimum of two years due to course scheduling and state of Illinois Professional Educators Licensure requirements.",
        "For admissions to the College of Engineering, some or all of the General Education Core courses may be substituted with suitable engineering courses, as determined in consultation with the Student’s assigned TAG Transfer Coordinator at the community college. For each such substitution, relevant Student advising documentation will be maintained by the community college.",
        "Complete equivalent courses for the following UIC courses listed below",
        "Students are strongly encouraged to complete an equivalent course for one of the following UIC required Computer Science courses",
        "Students are strongly encouraged to complete an equivalent course for the following UIC required major course:",
        "Complete equivalent courses for the following UIC courses listed below",
        "Students are strongly encouraged to complete an equivalent course for one of the following UIC required Computer Science courses*",
        "Students are strongly encouraged to complete an equivalent course for the following UIC required major course:",
        "*If the equivalent course does not include significant coverage of MatLab (whether or not it articulates to CS 109 at UIC), the student will be required to take CS 110 (a 1 credit hour MatLab supplement course) at UIC.",
        "Complete equivalent courses for one of the following UIC courses",
        "Science Electives – Ten credit hours required.  Must complete at least two equivalent courses from the list below.  If additional hours are necessary to complete the ten required hours, additional courses may be taken from this list, or any course that has the courses on this list as a prerequisite.",
        "Students are strongly encouraged to complete an equivalent course for the following UIC required Computer Science foundation course listed below:",
        "Students are strongly encouraged to complete equivalent courses in the following UIC categories for admission to the College of Liberal Arts and Sciences:",
        "Complete equivalent foreign language courses to reach proficiency at the intermediate level of language study.  The intermediate level of proficiency is the equivalent of that expected of the Student who has completed four semesters of a single foreign language at the college level.",
        "The RN to BSN online program is a bachelor’s degree completion program. In order to be eligible for guaranteed admission through the TAG agreement, prospective applicants must satisfy the program criteria listed on this page.",
        "Students are strongly encouraged to complete equivalent courses in the following UIC categories for admission to the College of Liberal Arts and Sciences:",
        "The Bachelor of Arts in Public Health program only admits for the fall semester.",
        "Two English composition courses equivalent to UIC ENGL 160 and ENGL 161",
        "One course in mathematical concepts equivalent to UIC Quantitative Reasoning",
        "Six courses; one equivalent course in each of the following UIC General Education Core categories:",
        "And",
        "Admission to Public Health – Undecided is offered during both Fall and Spring terms.",
        "Two English composition courses equivalent to UIC ENGL 160 and ENGL 161",
        "One course in mathematical concepts equivalent to UIC Quantitative Reasoning",
        "Six courses; one equivalent course in each of the following UIC General Education Core categories:",
        "Note: Public Health Undecided is for students who have not completed all of the necessary prerequisite course work requirements for direct admission to the public health major.",
        "Note: Programs listed for the School of Public Health only admit for the fall semester.",
        "In addition to the nine-course pattern of required courses, Students who will have completed all of the prerequisite course work are eligible for direct admission to the BA in Public Health. Admission to the BA in Public Health is only offered during the Fall term.",
        "",
        "Students may complete equivalent courses to the following UIC courses if available at their transfer institution to enable direct admission to the BA in Public Health.",
        "",
        "Please note: grades of B or higher are required in the prerequisite public health courses below",
        "",
        "Transfer Students who will not have completed the equivalent of UIC's PUBH 100, PUBH 110, and PUBH 120 for the BA in Public Health prior to their desired term of admission may apply to the Public Health – Undecided program in the School of Public Health.",
        "",
        "Students admitted to the Public Health – Undecided program must then successfully complete the remaining prerequisites prior to entering the BA in Public Health and beginning the major course work. Please note that completion of the public health major course work takes a minimum of two years due to major course sequencing.",
        "",
        "Students are required to complete equivalent courses in the following UIC categories for admission to Public Health – Undecided:",
        "Complete equivalent courses for the following UIC courses listed below",
        "Complete equivalent courses for the following UIC courses listed below"
    ],
    "out_links": [
        "https://tag.uic.edu/",
        "https://tag.uic.edu/frequently-asked-questions",
        "https://businessconnect.uic.edu/departments/accounting/ape/ape-exemption-information",
        "https://registrar.uic.edu/transfer-assistance/",
        "https://admissions.uic.edu/undergraduate/application-process/newly-admitted-students/transfer-and-readmission-students",
        "http://tada.uic.edu/",
        "http://commuter.uic.edu/",
        "http://disabilityresources.uic.edu/",
        "http://emergency.uic.edu/",
        "http://library.uic.edu/",
        "http://www.uic.edu/depts/dos/studentveteranaffairs.shtml",
        "https://admissions.uic.edu/events",
        "http://maps.uic.edu/",
        "http://news.uic.edu/uicnews",
        "https://tag.uic.edu/about/visit-directions",
        "http://clery.uic.edu/",
        "http://oae.uic.edu/UnlawfulDiscrimination/index.htm",
        "http://oae.uic.edu/TitleIX/index.htm",
        "https://admissions.uic.edu/book-visit",
        "https://admissions.uic.edu/undergraduate/request-information",
        "https://admissions.uic.edu/apply-now"
    ]
}