{
    "url": "https://cs.uic.edu/graduate/ms-program/thesis/",
    "title": "Thesis Option | Department of Computer Science | University of Illinois at Chicago",
    "text": [
        "The thesis option is designed for MS in Computer Science students who are interested in conducting research. This option is strongly advised if you may be interested in pursuing a PhD in the future.",
        "Researching and writing a master’s thesis is an academically intensive process that takes the place of 8 credits of traditional coursework. Students work with a faculty advisor to choose a topic of interest, engage in high-level study of that topic, and develop a paper that is suitable for presentation at a conference or submission to a journal.",
        "The thesis experience provides definition to your master’s degree experience and can bolster your application for jobs or doctoral-level study by demonstrating your capabilities.",
        "Master’s thesis students in computer science at UIC have recently studied:",
        "Your master’s thesis research is guided by a faculty advisor, and your thesis project eventually will be judged by a faculty committee of at least three members. They will be responsible for reviewing and evaluating your research.",
        "Choosing a thesis advisor is a process in which your first few semesters of coursework will be a great help. Taking courses will help you to focus a specific academic interest, which in turn will allow you to identify UIC computer science faculty experts in this area. You can find a list of the computer science faculty here.",
        "Students are responsible for identifying a prospective advisor and asking that faculty member to advise a thesis. Eligible faculty members include all assistant, associate, and full professors in computer science, as well as adjunct faculty in the department.",
        "Once you have a thesis advisor in place, you should meet with him or her to determine a research plan and set expectations and deadlines. With an approved research plan in place, students register for CS 598 and conduct the agreed-upon thesis research.",
        "Students who are required to maintain a specific number of registration hours may register for more than the 8 required hours of CS 598 with advisor permission, but no more than 8 hours will be used towards the requirements for the degree.",
        "Close to the conclusion of your research and writing process, you will work with your advisor to assemble a thesis committee, likely consisting of two or more additional faculty members. A majority of your committee should hold at least a 50% appointment in the computer science department, and at least one member must be a tenured faculty member.",
        "When your master’s thesis is complete, you will provide all committee members with a copy and arrange a date for your thesis defense. At least three weeks prior to your defense date, you will need to submit the committee recommendation form to the Student Affairs office. The department recommends that you schedule your defense no less than 10 business days prior to the Graduate College’s official thesis-submission deadline, so that you have time to make any changes that your committee or the Graduate College might request.",
        "An examination report will be generated by the Graduate College and sent to the Student Affairs office, which will contact you to pick up the forms. After your defense, you must visit the Student Affairs office to verify that all of graduation requirements have been met.",
        "Formatting and other guidelines for master’s thesis research are described in detail in a Thesis Manual published by the Graduate College. You must email a PDF copy of your thesis to the computer science Student Affairs office for a format check one week prior to the deadline set by the Graduate College.",
        "Students representing three of the College of Engineering’s six departments scored a big UIC win in the BuiltWorlds hackathon, a day-and-a-half-long competition where teams are asked to solve problems related to the built world around us: buildings, infrastructure, and beyond."
    ],
    "out_links": [
        "https://cs.uic.edu/",
        "http://uic.edu/",
        "https://cs.uic.edu/undergraduate/",
        "https://cs.uic.edu/undergraduate/admitted-students/",
        "http://engineering.uic.edu/undergraduate-admissions/",
        "https://cs.uic.edu/undergraduate/abet-accreditation/",
        "https://cs.uic.edu/undergraduate/cs-major/",
        "https://cs.uic.edu/undergraduate/cs-minor/",
        "https://cs.uic.edu/undergraduate/undergrad-courses/",
        "https://cs.uic.edu/undergraduate/internships-and-jobs/",
        "https://cs.uic.edu/undergraduate/student-organizations/",
        "https://cs.uic.edu/undergraduate/student-profiles/",
        "https://cs.uic.edu/undergraduate/student-resources/",
        "https://cs.uic.edu/undergraduate/women/",
        "https://cs.uic.edu/graduate/",
        "https://cs.uic.edu/graduate/admitted-students/",
        "https://cs.uic.edu/graduate/admissions/",
        "https://cs.uic.edu/graduate/graduate-courses/",
        "https://cs.uic.edu/graduate/ms-program/",
        "https://cs.uic.edu/graduate/phd/",
        "https://cs.uic.edu/graduate/cs-dissertations/",
        "https://cs.uic.edu/graduate/post-grad-outcomes/",
        "https://cs.uic.edu/graduate/student-profiles/",
        "https://cs.uic.edu/graduate/graduate-student-resources/",
        "https://cs.uic.edu/cs-research/",
        "https://cs.uic.edu/cs-research/research-areas-2/",
        "https://cs.uic.edu/cs-research/labs/",
        "https://cs.uic.edu/cs-research/lectures-seminars/",
        "https://cs.uic.edu/cs-research/reus/",
        "https://cs.uic.edu/faculty-staff/",
        "https://cs.uic.edu/faculty-staff/department-head/",
        "https://cs.uic.edu/faculty-staff/faculty/",
        "https://cs.uic.edu/faculty-staff/emeritus-faculty/",
        "https://cs.uic.edu/faculty-staff/adjunct-faculty/",
        "https://cs.uic.edu/faculty-staff/staff/",
        "https://cs.uic.edu/faculty-staff/faculty-resources/",
        "https://cs.uic.edu/faculty-staff/open-positions/",
        "https://cs.uic.edu/cs-news/",
        "https://cs.uic.edu/cs-news/all-news/",
        "https://cs.uic.edu/cs-news/press-mentions/",
        "https://cs.uic.edu/cs-events/",
        "https://cs.uic.edu/cs-events/calendar/",
        "https://cs.uic.edu/cs-events/student-opportunities/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "http://cs.uic.edu/faculty-staff/faculty/",
        "https://grad.uic.edu/graduate-student-forms",
        "http://grad.uic.edu/thesis",
        "http://cs.red.uic.edu/news-stories/uics-polithinkers-claim-victory-at-builtworlds-hackathon/",
        "https://cs.uic.edu/graduate/admissions/financial-aid-and-funding/",
        "https://cs.uic.edu/graduate/admissions/faq/",
        "https://cs.uic.edu/graduate/ms-program/project/",
        "https://cs.uic.edu/graduate/phd/qualifier-examination/",
        "https://cs.uic.edu/graduate/phd/preliminary-examination/",
        "https://cs.uic.edu/graduate/phd/dissertation-process/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}