{
    "url": "https://honors.uic.edu/academics/honors-activity-options/",
    "title": "Honors Activity Options | Honors College | University of Illinois at Chicago",
    "text": [
        "",
        "An updated list of seminar options is available each semester here.",
        "Honors Lectures are non-credit and graded on an S/U basis. Students may take only one Honors Lecture for Honors Activity credit.  Topics and descriptions are available here.",
        "",
        "The Supplement provides the student with an opportunity to go more deeply or broadly in the subject of an otherwise non-Honors course than is specified in the course requirements.  For this activity, the student and course professor work together to determine what the additional work will entail.  It is not simply an “extra” paper, experiment, or problem set, but an Honors Supplement does provide the student with a greater challenge than that presented to other students.",
        "Examples of Supplements include, but are not limited to:",
        "The work required of the student for a Supplement cannot be precisely quantified across all disciplines and courses. Honors Supplements must be described by the student in as much detail as possible on both Agreement and Completion Forms. The college will not accept forms without such descriptions.",
        "Some departments offer special Honors sections of courses.  Others reserve seats for Honors College students within a regular course and require students to complete additional course requirements determined by the instructor.  The Honors status of the course is noted on the student’s transcript by the addition on the letter “H” after the letter grade given for the course.",
        "Students may take advanced courses (400 level or above) that are not part of their academic program requirements for Honors Activity credit. Students should be sure to verify that they have all required course prerequisites for any advanced courses in which they wish to enroll.",
        "As students enter more advanced coursework in their major, they may consider independent study in an area not covered in standard courses under the supervision of a faculty member. In planning such projects, students should consult the departmental policies and procedures to which they are subject, as well as obtaining their Faculty Fellows’ approvals. Students may also choose to engage in supervised work in faculty research laboratories or on other research projects, again with their Fellows’ approvals. Sometimes these projects provide course credit, in which case students enroll in a course number designated for such work. With the approval of their Fellows, some students may do independent work without course credit that still fulfills the Honors Activity requirement.",
        "Students may complete internships, externships, co-ops, practica, or student teaching (for students majoring in an education or “teaching of” program) to earn Honors Units. HUs will be earned based on hours per week spent in their professional development role (a minimum of 3 hours/week is required) or based on their equivalent academic credits. Students can be paid for their professional development activities.",
        "The Honors College also encourages students to pursue opportunities to receive academic credit for their experiences through courses such as:",
        "ANTH 496, ARCH 395, ART 499, AH 482, AHS 393, BA 289, CHEM 488, COMM 474, CLJ 395, EAES 492, ED 350, ED 351, ED 450, ED 451, ENGR 289, ENGL 493, GEOG 496, GER 492, GER 493, HIM 384, HN 480, KN 393, LALS 497, LALS 498, LAS 289, PA 490, PA 496, PA 497, POLS 301, POLS 302, PSCH 385, SOC 298, THTR 474, US 302, US 495",
        "Students should consult their degree-granting advisor about earning internship credit.",
        "Students are limited to ONE service activity to count toward Honors Units. Students will receive 1 Honors Unit for a minimum of 45 hours per semester (an average of 3 hours per week) for service completed within a single organization. This Honors Unit can only be earned once. Service activities cannot be paid positions.",
        "Service Activities can include:",
        "Students are required to complete two reflection documents by the following deadlines (in addition to regular Honors College Agreement Form and Completion Form requirements and deadlines):",
        "The above forms are shared with students via email who have submitted or drafted Service Activity forms in HARS.",
        "Students who have applied to and been selected to serve as a tutor for the Honors College, in the Burnham Hall Tutoring Center, register for HON 202 (0 credit) each semester in which they are serving as a tutor. Requirements to serve as an Honors College Tutor include: be in at least second year (have completed two semesters) at UIC by the time begin tutoring, have a 3.4 UIC cumulative GPA or higher, be in good standing with the Honors College, must commit to a minimum of 4 hours per week, and must be available for required training dates and regular tutor meetings.",
        "Honors Tutoring and HON 202 registration is seen as an integral part of the Honors College, and therefore are not included in the Student Service Activity category. This allows for tutors to serve in the Burnham Hall Tutoring Center for more than one semester as an Honors Activity and to earn Honors Units (provided they are selected for the role by the tutoring coordinator each semester).",
        "Visit https://honors.uic.edu/resources/tutoring/ for more information about the Burnham Hall Tutoring Center.",
        "1 Honors Unit per term abroad; students do not need to complete an additional Honors Activity while abroad.",
        "In order to receive an Honors Unit for study abroad, students are required to complete three assignments in Blackboard (in addition to regular Honors College Agreement Form and Completion Form requirements and deadlines). Information about these requirements is shared in the HON 222 Blackboard specific to Study Abroad students each semester."
    ],
    "out_links": [
        "https://honors.uic.edu/",
        "http://uic.edu/",
        "https://honors.uic.edu/about/",
        "https://honors.uic.edu/about/mission-and-vision/",
        "https://honors.uic.edu/about/staff/",
        "https://honors.uic.edu/about/honors-college-bylaws/",
        "https://honors.uic.edu/about/diversity/",
        "https://honors.uic.edu/honors-college-news/",
        "https://honors.uic.edu/about/information-for-alumni-and-donors/",
        "https://honors.uic.edu/about/giving/",
        "https://honors.uic.edu/admissions/",
        "https://honors.uic.edu/admissions/frequently-asked-questions/",
        "https://honors.uic.edu/admissions/first-year/",
        "https://honors.uic.edu/admissions/transfer/",
        "https://honors.uic.edu/admissions/continuing/",
        "https://honors.uic.edu/admissions/funding-your-education/",
        "https://honors.uic.edu/admissions/for-families/",
        "https://honors.uic.edu/academics/",
        "https://honors.uic.edu/academics/courses/",
        "https://honors.uic.edu/academics/capstone/",
        "https://honors.uic.edu/academics/handbook/",
        "https://honors.uic.edu/academics/forms/",
        "https://honors.uic.edu/academics/hars-instructions/",
        "https://honors.uic.edu/academics/graduation-preparation/",
        "https://honors.uic.edu/involvement/",
        "https://honors.uic.edu/involvement/student-organizations/",
        "https://honors.uic.edu/involvement/student-publications/",
        "https://honors.uic.edu/involvement/service-opportunities/",
        "https://honors.uic.edu/involvement/honors-housing/",
        "https://honors.uic.edu/involvement/honors-societies/",
        "https://honors.uic.edu/involvement/honors-college-events/",
        "https://honors.uic.edu/involvement/cshp/",
        "https://honors.uic.edu/resources/",
        "https://honors.uic.edu/resources/advising/",
        "https://honors.uic.edu/resources/tutoring/",
        "https://honors.uic.edu/resources/graduate-schools-and-careers/",
        "https://honors.uic.edu/resources/fellows/",
        "https://honors.uic.edu/resources/scholarships/",
        "https://honors.uic.edu/faculty-and-fellows/",
        "https://honors.uic.edu/faculty-and-fellows/teach-an-honors-course/",
        "https://honors.uic.edu/faculty-and-fellows/honors-council/",
        "https://honors.uic.edu/faculty-and-fellows/become-a-fellow/",
        "https://honors.uic.edu/faculty-and-fellows/current-fellows/",
        "https://honors.uic.edu/faculty-and-fellows/fellow-of-the-year/",
        "https://apps.honors.uic.edu/Fellows/viewStudents.php",
        "https://honors.uic.edu/faculty-and-fellows/the-faculty-fellows-handbook/",
        "https://honors.uic.edu/faculty-and-fellows/capstone-supervisor-handbook/",
        "https://apps.honors.uic.edu/ContactUs/",
        "http://apps.honors.uic.edu/HARS/",
        "http://maps.uic.edu/",
        "https://today.uic.edu/coronavirus?utm_campaign=covid-19&utm_medium=homepage&utm_source=honors",
        "https://apps.honors.uic.edu/HARS/",
        "https://apps.honors.uic.edu/Fellows/current-fellows.php",
        "https://honors.uic.edu/involvement/honors-college-events/convocation/",
        "https://oef.uic.edu/",
        "https://undergradresearch.uic.edu/",
        "https://studyabroad.uic.edu/",
        "https://gppa.uic.edu/",
        "https://careerservices.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}