{
    "url": "https://honors.uic.edu/academics/forms/",
    "title": "Forms | Honors College | University of Illinois at Chicago",
    "text": [
        "A brief overview of Agreement and Completion Forms can be found below. Please log into HARS (Honors Activity Reporting System) for a complete breakdown of Honors Activities, subsequent Agreement and Completion Forms (Capstone included), as well as walkthroughs of how to use the HARS system.",
        "Find the activity you plan to conduct and fill out the appropriate agreement form. The Honors Activity Agreement Form is required for any student who is registered for HON 222. Complete and submit the form by 4pm Friday, of the third week of each semester. If also registered for HON 225 (Undergraduate Research Assistant) a completed URA application/agreement form is also required (see below). Log into the Honors Activity Reporting System to generate and print your Agreement Form in order to obtain the required signatures before handing it into the college.",
        "The Honors Activity Completion Form is required for any student who is registered for HON 222. Complete and submit the form by 4pm Friday of exam week. In order to obtain a completion form, your signed Agreement Form must have been received by the Honors College. Log into the Honors Activity Reporting System to print out the completion form and get the appropriate signatures before handing it into the college.",
        "The Honors College Capstone Agreement Form is required for any student who is registered for HON 322. It is the first (#1) of a series of 4 forms related to the Capstone. This is in lieu of the Honors Activity Agreement Form (above), and must be completed at the beginning of the semester in which a student begins work the Capstone project. The form must be signed by the Project Supervisor and Fellow. Complete and submit the form by 4pm Friday, of the third week of each semester. Log into the Honors Activity Reporting System to generate and print your Capstone Agreement Form in order to obtain the required signatures before handing it into the college.",
        "The Honors College Capstone Progress Report is required for students registered for HON 322 who have NOT completed their Capstone project at the end of the semester (Note: Please remember that Capstones usually span 2 semesters). As such, this form is typically the second (#2) of a series of 4 forms related to the Capstone. Complete and submit the form by 4pm of the 15th week (the last week of classes). Note that the form only needs to be signed by the Project Supervisor. In order to obtain a Capstone Activity Progress report form, your signed Agreement form must have been received by the Honors College. Use the Honors Activity Reporting System to print out the Capstone Activity Progress report form and get the appropriate signatures before handing it into the college.",
        "The Honors College Capstone Proposal Update is required for students registered for HON 322 who have NOT completed their Capstone project in the previous semester. The form must be signed by the Project Supervisor and Fellow. Complete and submit the form by 4pm Friday of the third week of the semester. In order to obtain a Capstone Activity Proposal Update, your signed Agreement form AND Progress Report form must have been received by the Honors College. Use the Honors Activity Reporting System to print out the Capstone Proposal Update form and get the appropriate signatures before handing it into the college.",
        "The Honors College Capstone Completion Form is required for students registered for HON 322 who have completed their Capstone project at the end of the semester. The form must be signed by the Project Supervisor and Fellow. Complete and submit the form by 4pm of the 15th week (the last week of classes). Given this, the Capstone Completion Form is the fourth (#4) and final form in the standard series of 4 forms related to the Capstone. In addition, students are to submit a copy of their completed Capstone project, see the Completion Form for more details. In order to obtain a Capstone Activity Completion form, your signed agreement form must have been received by the Honors College. Use the Honors Activity Reporting System to print out the Capstone Activity Completion form and get the appropriate signatures before handing it into the college.",
        "Faculty Fellow Request Form",
        "All Honors College students are assigned a Faculty Fellow at the start of their sophomore year. Students who wish to request a specific Fellow or request a change in their Fellow assignment should complete this form. Requests will be reviewed between Finals Week and the end of Week 1 of the subsequent semester (EX: a request submitted in Week 2 of the Spring 2019 semester will be processed for Fall 2019).",
        "Petition Form",
        "For “special circumstances” such as: request to be reinstated, withdraw from the honors college, waiving the Honors Activity requirement for a term, permission to complete more than one activity for a term, to remove any deferred grades form HON 222, 202, 225 from previous semester. Students must complete the form by including an explanation of their reason for filing the petition. The completed form should be submitted to the front desk for review. Each submitted petition is reviewed by Associate Dean Stacie McCloud and students are informed of the decision within one week of submitting their petition. If further discussion is required, students will be asked to come in to meet with Dean McCloud for a final decision to be made.",
        "Honors College Graduation Declaration Form",
        "Tell us about your graduation plans.  Submit this form 45 days before you graduate (usually late March).  It does not replace the graduation declaration requirements of your academic College."
    ],
    "out_links": [
        "https://honors.uic.edu/",
        "http://uic.edu/",
        "https://honors.uic.edu/about/",
        "https://honors.uic.edu/about/mission-and-vision/",
        "https://honors.uic.edu/about/staff/",
        "https://honors.uic.edu/about/honors-college-bylaws/",
        "https://honors.uic.edu/about/diversity/",
        "https://honors.uic.edu/honors-college-news/",
        "https://honors.uic.edu/about/information-for-alumni-and-donors/",
        "https://honors.uic.edu/about/giving/",
        "https://honors.uic.edu/admissions/",
        "https://honors.uic.edu/admissions/frequently-asked-questions/",
        "https://honors.uic.edu/admissions/first-year/",
        "https://honors.uic.edu/admissions/transfer/",
        "https://honors.uic.edu/admissions/continuing/",
        "https://honors.uic.edu/admissions/funding-your-education/",
        "https://honors.uic.edu/admissions/for-families/",
        "https://honors.uic.edu/academics/",
        "https://honors.uic.edu/academics/honors-activity-options/",
        "https://honors.uic.edu/academics/courses/",
        "https://honors.uic.edu/academics/capstone/",
        "https://honors.uic.edu/academics/handbook/",
        "https://honors.uic.edu/academics/hars-instructions/",
        "https://honors.uic.edu/academics/graduation-preparation/",
        "https://honors.uic.edu/involvement/",
        "https://honors.uic.edu/involvement/student-organizations/",
        "https://honors.uic.edu/involvement/student-publications/",
        "https://honors.uic.edu/involvement/service-opportunities/",
        "https://honors.uic.edu/involvement/honors-housing/",
        "https://honors.uic.edu/involvement/honors-societies/",
        "https://honors.uic.edu/involvement/honors-college-events/",
        "https://honors.uic.edu/involvement/cshp/",
        "https://honors.uic.edu/resources/",
        "https://honors.uic.edu/resources/advising/",
        "https://honors.uic.edu/resources/tutoring/",
        "https://honors.uic.edu/resources/graduate-schools-and-careers/",
        "https://honors.uic.edu/resources/fellows/",
        "https://honors.uic.edu/resources/scholarships/",
        "https://honors.uic.edu/faculty-and-fellows/",
        "https://honors.uic.edu/faculty-and-fellows/teach-an-honors-course/",
        "https://honors.uic.edu/faculty-and-fellows/honors-council/",
        "https://honors.uic.edu/faculty-and-fellows/become-a-fellow/",
        "https://honors.uic.edu/faculty-and-fellows/current-fellows/",
        "https://honors.uic.edu/faculty-and-fellows/fellow-of-the-year/",
        "https://apps.honors.uic.edu/Fellows/viewStudents.php",
        "https://honors.uic.edu/faculty-and-fellows/the-faculty-fellows-handbook/",
        "https://honors.uic.edu/faculty-and-fellows/capstone-supervisor-handbook/",
        "https://apps.honors.uic.edu/ContactUs/",
        "http://apps.honors.uic.edu/HARS/",
        "http://maps.uic.edu/",
        "https://today.uic.edu/coronavirus?utm_campaign=covid-19&utm_medium=homepage&utm_source=honors",
        "https://apps.honors.uic.edu/HARS/",
        "https://uofi.uic.edu/sb/sec/7360493",
        "https://uofi.uic.edu/fb/sec/6977031",
        "https://apps.honors.uic.edu/Fellows/current-fellows.php",
        "https://honors.uic.edu/involvement/honors-college-events/convocation/",
        "https://oef.uic.edu/",
        "https://undergradresearch.uic.edu/",
        "https://studyabroad.uic.edu/",
        "https://gppa.uic.edu/",
        "https://careerservices.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}