{
    "url": "https://today.uic.edu/uic-resource-guide",
    "title": "UIC 101: What you need to know | UIC Today",
    "text": [
        "ACCC offers a range of services, including campus Wi-Fi networks, computer labs, free software, laptop lending and help by phone, email and walk-in. Services include:",
        "",
        "There’s a long list of student organizations, some for community service or social issues, others organized around common interests like sports, anime or Italian. UIC also has fraternities and sororities. For information, attend the Involvement Fair, 11 a.m. to 4 p.m. Sept. 5-6, Lecture Center Plaza, or connect through the UIC Center for Student Involvement.",
        "Want to volunteer at a community nonprofit? Student Leadership and Civic Engagement, 312-996-4500, slce@uic.edu",
        "",
        "UIC has oases — informal spots where students can hang out, study or collaborate with friends.",
        "The Office of Campus Learning Environments creates the oases with new, comfortable furniture and the latest multimedia technologies.",
        "",
        "",
        "College is for everyone, even the young ones. The UIC Children’s Center is fully accredited, full-time early childhood education for children of faculty, staff and students, ages 2 years, 9 months to 6 years.",
        "UIC Children’s Center",
        "312-413-5326",
        "",
        "UIC’s Commuter Student Resource Center, the hub for Commuter and Off-Campus Programs, provides a home away from home for commuter students. Inside the Wellness Center, 240-248 Student Center East — behind the Inner Circle food court — it has quiet study space, social lounge, public computers and printers, kitchen and lockers. Staff can provide information on transportation, off-campus housing and other resources.",
        "Mon.–Thurs. 7:30 a.m. to 6 p.m.",
        "Fri. 7:30 a.m. to 5 p.m.",
        "312-413-7440",
        "",
        "",
        "UIC may be a diverse campus, but all students have one thing in common: the need for food. Dining Services has cafés, cafeterias and fast-food restaurants, including Argo Tea, Au Bon Pain, Chick-fil-A, Dunkin’ Donuts/Baskin-Robbins, Freshii, Moe’s, Panda Express, Port Center Café, Sbarro, Subway, Tropical Smoothie and more.",
        "",
        "The Disability Resource Center offers activities, services and resources for students with disabilities and guidance for faculty on accessible teaching.",
        "1070 Student Services Building",
        "Voice: 312-413-2183",
        "Video Phone: 773-649-4535",
        "Don’t fret over a fever. CampusCare, a student health plan paid by student fees, includes services at these clinics:",
        "On-campus: UIC has nine residence halls offering a variety of arrangements, including living learning communities, and options for graduate students, and even temporary guest housing.",
        "Housing residents have access to programming, tutoring, interactions with faculty, and connections to other students and campus resources in addition to the convenience of living on campus.",
        "A new academic and residential complex on Harrison street, which will include both academic and residential facilities, is scheduled to open Fall 2019.",
        "",
        "312-413-5940, 1790 Student Services Building; satellite center, 241 Student Center West",
        "College life can be expensive. The Student Employment Office helps students find part-time jobs on and off campus to help ease the expenses.",
        "2100 Student Services Building",
        "312-996-3130",
        "Office of Career Services helps students prepare for careers and find jobs.",
        "3050 Student Services Building",
        "312-996-2300",
        "",
        "There are two libraries on the Chicago campus — the Daley Library on the east side of campus and the Library of the Health Sciences on the west side — and libraries at the health sciences campuses in Peoria, Rockford and Urbana. Get help from librarians face-to-face or through live chat.",
        "IDEA Commons:",
        "Check out this popular learning and collaboration space on the first floor of the Daley Library, with meeting spaces, a per­formance area, moveable furniture and more than 100 computers, as well as the Instructional Technology Lab/Student Media Lab.",
        "",
        "Grab an old-school paper map at Building Management in Student Centers East and West, or the Information and Service Center in the Student Services Building. Trying to save paper? Check out the online map.",
        "",
        "The Office of the Dean of Students is a resource for advocacy, engagement, support services and other opportunities available on campus. Their mission is to create a student-centered learning environment where students can achieve personal and academic success.",
        "3030 Student Services Building, 1200 W. Harrison St.",
        "",
        "Zumba, swimming, massage therapy, and more! UIC has recreation facilities on the east and west sides of campus that offer everything from intramural sports to personal training, as well as an outdoor field complex and outdoor recreation courts for tennis, sand volleyball, basketball and jogging.",
        "Student Recreation Facility",
        "312-413-5150",
        "Sport and Fitness Center",
        "312-413-5260",
        "",
        "UIC students have a variety of research opportunities that help them gain real-world experience in the classroom as they work side-by-side with federal grant-funded investigators.",
        "",
        "You can find many UIC offices and or­ganizations on social media. A good place to start:",
        "• Facebook: UIC and UIC News",
        "• Twitter: UIC News and ThisIsUIC",
        "• YouTube: UICmedia and thisisuic",
        "• Instagram: thisisuic",
        "• Follow Chancellor Michael Amiridis on Instagram!",
        "",
        "Fire up Flames! UIC has NCAA Division I teams in men’s and women’s sports, including basketball, soccer, baseball, golf, tennis, gymnastics, swimming and softball, plus fan group UIC Pyromaniacs. Learn the UIC Fight Song.",
        "",
        "",
        "Get prepared for the school year with UIC gear, course materials, electronics and accessories. Staff in two bookstore locations on campus can help students looking for things like giftware, laptops, textbooks and more:",
        "",
        "UIC is working toward a greener world through recycling, improved transportation and energy efficiency. UIC has four climate commitments: carbon neutral campus, zero waste campus, net zero water campus and biodiverse campus.",
        "UIC is recognized by the Arbor Day Foundation as a Tree Campus! Learn more — volunteers welcome — from the Office of Sustainability.",
        "",
        "",
        "",
        "Contact",
        "",
        "Francisca Corona",
        "",
        "fcoron3@uic.edu",
        "",
        "",
        "",
        "Categories",
        "",
        "Campus, Featured Campus, Top Student News",
        "",
        "",
        "Francisca Corona",
        "",
        "fcoron3@uic.edu",
        "",
        "Categories",
        "",
        "Campus, Featured Campus, Top Student News",
        "Topics",
        "UIC Resource Guide"
    ],
    "out_links": [
        "http://uic.edu/",
        "https://today.uic.edu/",
        "https://today.uic.edu/campus-news",
        "https://today.uic.edu/academics-research",
        "https://today.uic.edu/events",
        "https://today.uic.edu/resources",
        "https://today.uic.edu/resources/current-students",
        "https://today.uic.edu/resources/faculty-staff",
        "https://today.uic.edu/resources/photo-video-policies",
        "https://today.uic.edu/resources/social-media-inquiry-form",
        "https://today.uic.edu/uic-social-media-guidelines-and-best-practices",
        "https://today.uic.edu/coronavirus",
        "https://today.uic.edu/frequently-asked-questions",
        "https://today.uic.edu/what-you-need-to-know-about-covid-19",
        "https://today.uic.edu/support-for-the-uic-community",
        "https://today.uic.edu/teaching-learning-and-working-resources",
        "https://today.uic.edu/in-the-news-covid-19",
        "https://today.uic.edu/contact",
        "https://today.uic.edu/contact/communicating-on-campus",
        "https://today.uic.edu/contact/communicating-on-campus/sending-massmails-dddh",
        "https://today.uic.edu/contact/social-media-directory",
        "http://accc.uic.edu/",
        "http://cstop.uic.edu/",
        "http://m.uic.edu/",
        "http://connect.uic.edu/",
        "http://ocle.uic.edu/",
        "http://aacc.uic.edu/",
        "http://arabamcc.uic.edu/",
        "http://aarcc.uic.edu/",
        "http://dcc.uic.edu/",
        "http://gsc.uic.edu/",
        "http://latinocultural.uic.edu/",
        "http://wlrc.uic.edu/",
        "http://childrenscenter.uic.edu/",
        "http://csrc.uic.edu/",
        "http://gallery400.uic.edu/",
        "http://theatreandmusic.uic.edu/",
        "http://dining.uic.edu/",
        "http://drc.uic.edu/",
        "http://campuscare.uic.edu/",
        "http://counseling.uic.edu/",
        "http://wellnesscenter.uic.edu/",
        "http://housing.uic.edu/",
        "http://idcenter.uic.edu/",
        "http://studentemployment.uic.edu/",
        "http://careerservices.uic.edu/",
        "http://library.uic.edu/",
        "http://maps.uic.edu/",
        "https://dos.uic.edu/",
        "http://recreation.uic.edu/",
        "https://www.uic.edu/research",
        "http://police.uic.edu/",
        "http://transportation.uic.edu/",
        "http://go.uic.edu/textalert",
        "http://go.uic.edu/fightsong",
        "http://studentaffairs.uic.edu/ace",
        "http://studentaffairs.uic.edu/aaan",
        "https://www.honors.uic.edu/tutoring/",
        "http://lares.uic.edu/",
        "http://studentaffairs.uic.edu/nasp",
        "http://dos.uic.edu/",
        "http://studentaffairs.uic.edu/trio",
        "http://chance.uic.edu/",
        "http://crwg.uic.edu/wise-home/campus/",
        "http://gradstudentcouncil.uic.edu/",
        "http://hpsc.org.uic.edu/",
        "http://usg.uic.edu/",
        "http://sustainability.uic.edu/",
        "http://bus.uic.edu/",
        "http://sustainability.uic.edu/green-campus/bikes/",
        "http://parking.uic.edu/",
        "https://today.uic.edu/author/fcoron3",
        "https://today.uic.edu/category/category-campus",
        "https://today.uic.edu/category/featured-campus",
        "https://today.uic.edu/category/ts-news",
        "https://today.uic.edu/tag/uic-resource-guide",
        "https://today.uic.edu/campus-news/campus-newspaper/subscribe-to-uic-today",
        "https://today.uic.edu/news-release/news-release/",
        "https://today.uic.edu/experts-guide",
        "https://today.uic.edu/contact/communicating-on-campus/submit-announcements",
        "https://today.uic.edu/submit-an-event",
        "http://catalog.uic.edu/ucat/academic-calendar/",
        "http://www.uic.edu/apps/departments-az/search",
        "http://disabilityresources.uic.edu/",
        "http://emergency.uic.edu/",
        "http://events.uic.edu/",
        "http://uic.edu/about/job-opportunities",
        "http://dos.uic.edu/studentveteranaffairs.shtml"
    ]
}