{
    "url": "https://catalog.uic.edu/all-course-descriptions/bms/",
    "title": "Basic Medical Sciences (BMS) < University of Illinois at Chicago",
    "text": [
        "BMS 602.  Medical Biochemistry I - Urbana.  2 hours.",
        "",
        "At the molecular level, this course provides students with the basic foundation of biochemistry as related to physiology, pathology, pharmacology, disease diagnosis and treatment methods. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "BMS 603.  Medical Genetics-Urbana.  2 hours.",
        "",
        "Reviews basic genetic principles, and provides students with skills in recognizing and managing chromosomal, single gene, and multifactorial disorders. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "BMS 604.  Physiology I - Urbana.  3 hours.",
        "",
        "Prepares students to apply basic physiological concepts to clinical settings through an integrated study of normal body function and dysfunction, from the cellular to the organ system level. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "BMS 606.  Cell and Tissue Biology I - Urbana.  2 hours.",
        "",
        "Provides students with a basic foundation of the structure and function of cells, tissues, and organ systems in the human body. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program. Course Schedule Information: To be properly registered, students must enroll in one Lecture and one Laboratory-Discussion.",
        "",
        "BMS 607.  Introduction to Human Disease I-Urbana.  1 hour.",
        "",
        "Introduces strategies for approaching clinical scenarios and integrating the basic sciences with the history and physical exam. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "BMS 608.  Basic Microbiology - Urbana.  3 hours.",
        "",
        "Introduces the principles of the replication cycle, taxonomy and pathogenesis for prokaryotes, viruses, fungi and parasites and the clinically-important microbes responsible for common infectious diseases. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "BMS 609.  Medical Scholars Program - Urbana/Champaign.  0-16 hours.",
        "",
        "Concurrent registration course for Urbana Medical Scholars Program students. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program and the Medical Scholars Program.",
        "",
        "BMS 610.  Independent Study - Urbana/Champaign.  0-16 hours.",
        "",
        "Participating students meet with faculty advisors to plan an individual curriculum. Course Information: Prerequisite(s): Approval by the Dean's Office in the College of Medicine.",
        "",
        "BMS 611.  Medical Tutorial - Urbana/Champaign.  0-16 hours.",
        "",
        "A tutorial offered to students enrolled in the College of Medicine's five year program. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program and the College of Medicine's five year program.",
        "",
        "BMS 612.  Basic Immunology-Urbana.  2 hours.",
        "",
        "Students learn the mechanisms of the body's immune resistance to infectious viruses and pathogenic bacteria. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "BMS 613.  Medical Biochemistry II-Urbana.  1 hour.",
        "",
        "Continuation of BMS 602, which at the molecular level, provides students with the basic foundation of biochemistry as related to physiology, pathology, pharmacology, disease diagnosis and treatment methods. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "BMS 614.  Physiology II - Urbana.  2 hours.",
        "",
        "Continuation of BMS 604, which prepares students to apply basic physiological concepts to clinical settings through an integrated study of normal body function and dysfunction, from the cellular to the organ system levels. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "BMS 616.  Cell and Tissue Biology II-Urbana.  1 hour.",
        "",
        "Continuation of BMS 606, which provides students with a basic foundation of the structure and function of cells, tissues, and organ systems in the human body. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "BMS 617.  Introduction to Human Disease II-Urbana.  1 hour.",
        "",
        "Introduces strategies for approaching clinical scenarios and integrating the basic sciences with the history and physical exam. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "BMS 618.  Neuroanatomy and Neurophysiology-Urbana.  4 hours.",
        "",
        "Presents the anatomical and functional organization of the Central Nervous System and its response to injury and disease. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program. Course Schedule Information: To be properly registered, student must be enrolled in one Lecture-Discussion and one Laboratory.",
        "",
        "BMS 620.  Medical Statistics - Urbana.  1 hour.",
        "",
        "Statistical methods and reasoning, with an emphasis on the techniques and terms commonly encountered in research, are presented as tools for students to determine the impact of research on practice. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "BMS 621.  Foundations in Rural Family and Community Medicine I - Urbana.  1 hour.",
        "",
        "Introduces first-year students to rural community medicine and core concepts of family medicine. Course Information: May be repeated to a maximum of 2 hours. Prerequisite(s):  Enrollment in the Doctor of Medicine program.  Restricted to students admitted to the Rural Medical Education Program (RMED) at Rockford, who begin their basic medical sciences study in Urbana.",
        "",
        "BMS 622.  Medical Gross Human Anatomy I - Urbana.  3 hours.",
        "",
        "Through extensive dissection of a human cadaver, combined with lecture and active learning, this course provides students with an anatomic foundation for clinical practice.  Course Information: 3 hours. Prerequisite(s):  Enrollment in the Doctor of Medicine program. Course Schedule Information: To be properly registered, students must enroll in one Lecture-Discussion and one Laboratory.",
        "",
        "BMS 623.  Medical Gross Human Anatomy II - Urbana.  3 hours.",
        "",
        "Continuation of BMS 622. Through extensive dissection of a human cadaver, combined with lecture and active learning, this course provides students with an anatomic foundation for clinical practice.  Course Schedule Information: To be properly registered, students must enroll in one Lecture-Discussion and one Laboratory.",
        "",
        "BMS 624.  Embryology - Urbana.  1 hour.",
        "",
        "Provides students with an embryologic foundation for clinical practice. Course Information:  Prerequisite(s):  Enrollment in the Doctor of Medicine program.",
        "",
        "BMS 626.  Microbiology/Immunology I - Urbana/Champaign.  3 hours.",
        "",
        "An introduction to the microbes and immune system as they relate to human health.  Course Information:  Prerequisite(s):  Enrollment in the Doctor of Medicine program.",
        "",
        "BMS 627.  Microbiology/Immunology II - Urbana/Champaign.  3 hours.",
        "",
        "An introduction to the microbes and immune system as they relate to human health.  Course Information:  Prerequisite(s):  Enrollment in the Doctor of Medicine program.",
        "",
        "BMS 628.  Basic Science Student Portfolio - Urbana.  1 hour.",
        "",
        "Designed for medical students starting from entry in medical school until graduation to promote self-reflection about their experiences, concerns, cases seen, procedures completed and other medical school activities. Course Information: May be repeated to a maximum of 2 hours. Prerequisite(s): Enrollment in the Urbana Doctor of Medicine program.",
        "",
        "BMS 630.  Lifelong Learning Strategies.  1 hour.",
        "",
        "This course is designed to assist students in becoming lifelong learners in the medical field by exploring their personal learning style,  learning ways to optimize their individual learning, to overcome test anxiety, and when to seek help.",
        "",
        "BMS 644.  Medical Gross Human Anatomy and Embryology I - Chicago.  3 hours.",
        "",
        "Through extensive dissection of a human cadaver, combined with lecture and active learning,provides students with an anatomic and embryologic foundation for clinical practice. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "BMS 645.  Medical Gross Human Anatomy and Embryology II-Chicago.  4 hours.",
        "",
        "Continuation of BMS 644 and through extensive dissection of a human cadaver, combined with lecture and active learning, provides students with an anatomic and embryologic foundation for clinical practice. Course Information: Prerequisite(s): BMS 644.",
        "",
        "BMS 646.  Cell and Tissue Biology-Chicago.  4 hours.",
        "",
        "Provides students with a basic foundation of the structure and function of cells, tissues, and organ systems in the human body. Course Information: 4 hours. Prerequisite(s): Enrollment in the Doctor of Medicine program. Class Schedule Information: To be properly enrolled, students must enroll in one Lecture and one Laboratory.",
        "",
        "BMS 647.  Neuroanatomy-Chicago.  3 hours.",
        "",
        "Presents the anatomical and functional organization of the Central Nervous System and its response to injury and disease. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "BMS 648.  Medical Biochemistry - Chicago.  5 hours.",
        "",
        "At the molecular level, provides students with the basic foundation of biochemistry as related to physiology, pathology, pharmacology, disease diagnosis and treatment methods. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "BMS 653.  Physiology I - Chicago.  4 hours.",
        "",
        "Prepares students to apply basic physiological concepts to clinical settings through an integrated study of normal body function and dysfunction, from the cellular to the organ system levels. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "BMS 654.  Human Development - Chicago.  1 hour.",
        "",
        "Examines normal and abnormal development of biological and behavioral processes from birth across the lifespan. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "BMS 656.  Medical Tutorial - Chicago.  0-16 hours.",
        "",
        "A tutorial offered to students enrolled in the College's five year program. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "BMS 657.  Independent Study - Chicago.  0-16 hours.",
        "",
        "Participating students meet with faculty advisors to plan an individual curriculum. Course Information: Prerequisite(s): Approval by the Dean's Office in the College of Medicine.",
        "",
        "BMS 658.  Med Cell & Tissue Bio II.  1 hour.",
        "",
        "Structure and function of cells and tissues in the human body and their clinical correlations. Course Information: Prerequisite(s): Enrollment in the Chicago Doctor of Medicine Program.",
        "",
        "BMS 660.  Physiology II - Chicago.  3 hours.",
        "",
        "Continuation of BMS 653, which prepares students to apply basic physiological concepts to clinical settings through an integrated study of normal body function and dysfunction, from the cellular to the organ system levels. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "BMS 661.  Brain and Behavior - Chicago.  1 hour.",
        "",
        "Provides students with a comprehensive, clinically relevant overview of the brain mechanisms underlying common everyday behaviors and mental illness. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "BMS 662.  Basic Immunology and Microbiology-Chicago.  2 hours.",
        "",
        "Reviews the basic properties of medically relevant bacteria, viruses and fungi, how these organisms cause disease, and the body's immune resistance mechanisms. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "BMS 663.  Basic Science Student Portfolio - Chicago.  1 hour.",
        "",
        "Designed for medical students starting from entry in medical school until graduation to promote self-reflection about their experiences, concerns, cases seen, procedures completed and other medical school activities. Course Information: May be repeated to a maximum of 2 hours. Prerequisite(s): Enrollment in the Chicago Doctor of Medicine program.",
        "",
        "BMS 664.  Longitudinal Career Development Course.  0 hours.",
        "",
        "A longitudinal course from M1 to M4 years that will assist medical students in developing the knowledge and skills to make a thoughtful and successful specialty choice. Course Information: Extensive computer use required. Class Schedule Information: To be properly registered, students must enroll in one Clinical Practice, one Practice, and one Lecture-Discussion.",
        "",
        "BMS 666.  Essentials of Clinical Medicine I-Chicago.  2 hours.",
        "",
        "Emphasizes development of the basic knowledge, skills and attitudes required of medical professionals, as well as addresses many contexts affecting delivery of  healthcare. Course Information: 2 hrs. Prerequisite(s): Enrollment in the Doctor of Medicine program. Course Schedule Information: To be properly registered, students must enroll in one Lecture-Discussion and one Clinical Practice.",
        "",
        "BMS 667.  Essentials of Clinical Medicine II - Chicago.  2 hours.",
        "",
        "Continuation of BMS 666, which emphasizes development of the basic knowledge, skills and attitudes required of medical professionals, as well as addresses many contexts affecting delivery of healthcare. Course Information: 2 hours. Prerequisite(s): BMS 666. Course Schedule Information: To be properly registered, students must enroll in one Lecture-Discussion and one Clinical Practice.",
        "",
        "BMS 668.  Medical Genetics-Chicago.  2 hours.",
        "",
        "Reviews basic genectic principles, and provides students with skills in recognizing and managing chromosomal, single gene, and multifactorial disorders. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "Apply Online | Contact Admissions | Privacy Statement",
        "Having problems accessing this site? Contact the Webmaster.",
        "© 2018-2019 The Board of Trustees of the University of Illinois",
        "",
        "Print this page.",
        "",
        "The PDF will include all information unique to this page.",
        "",
        "All pages in the campus catalog.",
        ""
    ],
    "out_links": [
        "https://catalog.uic.edu/azindex/",
        "https://catalog.uic.edu/",
        "http://www.uic.edu/",
        "https://catalog.uic.edu/ucat/",
        "https://catalog.uic.edu/gcat",
        "https://catalog.uic.edu/gcat/",
        "https://catalog.uic.edu/all-course-descriptions/",
        "https://catalog.uic.edu/all-course-descriptions/asp/",
        "https://catalog.uic.edu/all-course-descriptions/actg/",
        "https://catalog.uic.edu/all-course-descriptions/aast/",
        "https://catalog.uic.edu/all-course-descriptions/anat/",
        "https://catalog.uic.edu/all-course-descriptions/anth/",
        "https://catalog.uic.edu/all-course-descriptions/ahs/",
        "https://catalog.uic.edu/all-course-descriptions/arab/",
        "https://catalog.uic.edu/all-course-descriptions/arst/",
        "https://catalog.uic.edu/all-course-descriptions/arch/",
        "https://catalog.uic.edu/all-course-descriptions/art/",
        "https://catalog.uic.edu/all-course-descriptions/ah/",
        "https://catalog.uic.edu/all-course-descriptions/bcmg/",
        "https://catalog.uic.edu/all-course-descriptions/bioe/",
        "https://catalog.uic.edu/all-course-descriptions/bios/",
        "https://catalog.uic.edu/all-course-descriptions/bvis/",
        "https://catalog.uic.edu/all-course-descriptions/bhis/",
        "https://catalog.uic.edu/all-course-descriptions/bps/",
        "https://catalog.uic.edu/all-course-descriptions/bstt/",
        "https://catalog.uic.edu/all-course-descriptions/ba/",
        "https://catalog.uic.edu/all-course-descriptions/cc/",
        "https://catalog.uic.edu/all-course-descriptions/cst/",
        "https://catalog.uic.edu/all-course-descriptions/cees/",
        "https://catalog.uic.edu/all-course-descriptions/che/",
        "https://catalog.uic.edu/all-course-descriptions/chem/",
        "https://catalog.uic.edu/all-course-descriptions/chin/",
        "https://catalog.uic.edu/all-course-descriptions/cd/",
        "https://catalog.uic.edu/all-course-descriptions/cme/",
        "https://catalog.uic.edu/all-course-descriptions/cl/",
        "https://catalog.uic.edu/all-course-descriptions/cler/",
        "https://catalog.uic.edu/all-course-descriptions/cele/",
        "https://catalog.uic.edu/all-course-descriptions/pele/",
        "https://catalog.uic.edu/all-course-descriptions/rele/",
        "https://catalog.uic.edu/all-course-descriptions/uele/",
        "https://catalog.uic.edu/all-course-descriptions/comm/",
        "https://catalog.uic.edu/all-course-descriptions/chsc/",
        "https://catalog.uic.edu/all-course-descriptions/cs/",
        "https://catalog.uic.edu/all-course-descriptions/clj/",
        "https://catalog.uic.edu/all-course-descriptions/ci/",
        "https://catalog.uic.edu/all-course-descriptions/dadm/",
        "https://catalog.uic.edu/all-course-descriptions/daob/",
        "https://catalog.uic.edu/all-course-descriptions/dbcs/",
        "https://catalog.uic.edu/all-course-descriptions/dcle/",
        "https://catalog.uic.edu/all-course-descriptions/dosi/",
        "https://catalog.uic.edu/all-course-descriptions/dost/",
        "https://catalog.uic.edu/all-course-descriptions/des/",
        "https://catalog.uic.edu/all-course-descriptions/dlg/",
        "https://catalog.uic.edu/all-course-descriptions/dhd/",
        "https://catalog.uic.edu/all-course-descriptions/mdc/",
        "https://catalog.uic.edu/all-course-descriptions/mdp/",
        "https://catalog.uic.edu/all-course-descriptions/mdr/",
        "https://catalog.uic.edu/all-course-descriptions/eaes/",
        "https://catalog.uic.edu/all-course-descriptions/econ/",
        "https://catalog.uic.edu/all-course-descriptions/ed/",
        "https://catalog.uic.edu/all-course-descriptions/edps/",
        "https://catalog.uic.edu/all-course-descriptions/epsy/",
        "https://catalog.uic.edu/all-course-descriptions/ece/",
        "https://catalog.uic.edu/all-course-descriptions/eb/",
        "https://catalog.uic.edu/all-course-descriptions/endo/",
        "https://catalog.uic.edu/all-course-descriptions/ener/",
        "https://catalog.uic.edu/all-course-descriptions/engr/",
        "https://catalog.uic.edu/all-course-descriptions/engl/",
        "https://catalog.uic.edu/all-course-descriptions/entr/",
        "https://catalog.uic.edu/all-course-descriptions/eohs/",
        "https://catalog.uic.edu/all-course-descriptions/epid/",
        "https://catalog.uic.edu/all-course-descriptions/epl/",
        "https://catalog.uic.edu/all-course-descriptions/fin/",
        "https://catalog.uic.edu/all-course-descriptions/fr/",
        "https://catalog.uic.edu/all-course-descriptions/gws/",
        "https://catalog.uic.edu/all-course-descriptions/geog/",
        "https://catalog.uic.edu/all-course-descriptions/ger/",
        "https://catalog.uic.edu/all-course-descriptions/glas/",
        "https://catalog.uic.edu/all-course-descriptions/gc/",
        "https://catalog.uic.edu/all-course-descriptions/gems/",
        "https://catalog.uic.edu/all-course-descriptions/gka/",
        "https://catalog.uic.edu/all-course-descriptions/gkm/",
        "https://catalog.uic.edu/all-course-descriptions/gamd/",
        "https://catalog.uic.edu/all-course-descriptions/him/",
        "https://catalog.uic.edu/all-course-descriptions/hpa/",
        "https://catalog.uic.edu/all-course-descriptions/hlp/",
        "https://catalog.uic.edu/all-course-descriptions/heb/",
        "https://catalog.uic.edu/all-course-descriptions/hnur/",
        "https://catalog.uic.edu/all-course-descriptions/hstl/",
        "https://catalog.uic.edu/all-course-descriptions/hist/",
        "https://catalog.uic.edu/all-course-descriptions/hon/",
        "https://catalog.uic.edu/all-course-descriptions/hn/",
        "https://catalog.uic.edu/all-course-descriptions/hum/",
        "https://catalog.uic.edu/all-course-descriptions/ie/",
        "https://catalog.uic.edu/all-course-descriptions/it/",
        "https://catalog.uic.edu/all-course-descriptions/ids/",
        "https://catalog.uic.edu/all-course-descriptions/iphs/",
        "https://catalog.uic.edu/all-course-descriptions/idea/",
        "https://catalog.uic.edu/all-course-descriptions/isa/",
        "https://catalog.uic.edu/all-course-descriptions/ip/",
        "https://catalog.uic.edu/all-course-descriptions/ibt/",
        "https://catalog.uic.edu/all-course-descriptions/inst/",
        "https://catalog.uic.edu/all-course-descriptions/ital/",
        "https://catalog.uic.edu/all-course-descriptions/jpn/",
        "https://catalog.uic.edu/all-course-descriptions/jst/",
        "https://catalog.uic.edu/all-course-descriptions/jd/",
        "https://catalog.uic.edu/all-course-descriptions/kn/",
        "https://catalog.uic.edu/all-course-descriptions/kor/",
        "https://catalog.uic.edu/all-course-descriptions/lat/",
        "https://catalog.uic.edu/all-course-descriptions/lals/",
        "https://catalog.uic.edu/all-course-descriptions/law/",
        "https://catalog.uic.edu/all-course-descriptions/lrsc/",
        "https://catalog.uic.edu/all-course-descriptions/las/",
        "https://catalog.uic.edu/all-course-descriptions/lib/",
        "https://catalog.uic.edu/all-course-descriptions/ling/",
        "https://catalog.uic.edu/all-course-descriptions/lcsl/",
        "https://catalog.uic.edu/all-course-descriptions/lith/",
        "https://catalog.uic.edu/all-course-descriptions/mgmt/",
        "https://catalog.uic.edu/all-course-descriptions/mktg/",
        "https://catalog.uic.edu/all-course-descriptions/mba/",
        "https://catalog.uic.edu/all-course-descriptions/meng/",
        "https://catalog.uic.edu/all-course-descriptions/mj/",
        "https://catalog.uic.edu/all-course-descriptions/mcs/",
        "https://catalog.uic.edu/all-course-descriptions/math/",
        "https://catalog.uic.edu/all-course-descriptions/mtht/",
        "https://catalog.uic.edu/all-course-descriptions/me/",
        "https://catalog.uic.edu/all-course-descriptions/mbt/",
        "https://catalog.uic.edu/all-course-descriptions/mhpe/",
        "https://catalog.uic.edu/all-course-descriptions/mhum/",
        "https://catalog.uic.edu/all-course-descriptions/mdch/",
        "https://catalog.uic.edu/all-course-descriptions/pmmp/",
        "https://catalog.uic.edu/all-course-descriptions/mim/",
        "https://catalog.uic.edu/all-course-descriptions/mils/",
        "https://catalog.uic.edu/all-course-descriptions/movi/",
        "https://catalog.uic.edu/all-course-descriptions/muse/",
        "https://catalog.uic.edu/all-course-descriptions/mus/",
        "https://catalog.uic.edu/all-course-descriptions/nast/",
        "https://catalog.uic.edu/all-course-descriptions/nats/",
        "https://catalog.uic.edu/all-course-descriptions/ns/",
        "https://catalog.uic.edu/all-course-descriptions/neus/",
        "https://catalog.uic.edu/all-course-descriptions/nurs/",
        "https://catalog.uic.edu/all-course-descriptions/nuel/",
        "https://catalog.uic.edu/all-course-descriptions/nupr/",
        "https://catalog.uic.edu/all-course-descriptions/nusp/",
        "https://catalog.uic.edu/all-course-descriptions/ot/",
        "https://catalog.uic.edu/all-course-descriptions/omds/",
        "https://catalog.uic.edu/all-course-descriptions/osci/",
        "https://catalog.uic.edu/all-course-descriptions/osur/",
        "https://catalog.uic.edu/all-course-descriptions/ortd/",
        "https://catalog.uic.edu/all-course-descriptions/path/",
        "https://catalog.uic.edu/all-course-descriptions/psl/",
        "https://catalog.uic.edu/all-course-descriptions/pedd/",
        "https://catalog.uic.edu/all-course-descriptions/peri/",
        "https://catalog.uic.edu/all-course-descriptions/pmpg/",
        "https://catalog.uic.edu/all-course-descriptions/pcol/",
        "https://catalog.uic.edu/all-course-descriptions/phar/",
        "https://catalog.uic.edu/all-course-descriptions/pmpr/",
        "https://catalog.uic.edu/all-course-descriptions/psop/",
        "https://catalog.uic.edu/all-course-descriptions/phil/",
        "https://catalog.uic.edu/all-course-descriptions/pt/",
        "https://catalog.uic.edu/all-course-descriptions/phys/",
        "https://catalog.uic.edu/all-course-descriptions/phyb/",
        "https://catalog.uic.edu/all-course-descriptions/pol/",
        "https://catalog.uic.edu/all-course-descriptions/pols/",
        "https://catalog.uic.edu/all-course-descriptions/port/",
        "https://catalog.uic.edu/all-course-descriptions/prcl/",
        "https://catalog.uic.edu/all-course-descriptions/ptl/",
        "https://catalog.uic.edu/all-course-descriptions/pros/",
        "https://catalog.uic.edu/all-course-descriptions/psch/",
        "https://catalog.uic.edu/all-course-descriptions/pa/",
        "https://catalog.uic.edu/all-course-descriptions/pubh/",
        "https://catalog.uic.edu/all-course-descriptions/ppol/",
        "https://catalog.uic.edu/all-course-descriptions/ppa/",
        "https://catalog.uic.edu/all-course-descriptions/re/",
        "https://catalog.uic.edu/all-course-descriptions/rels/",
        "https://catalog.uic.edu/all-course-descriptions/rest/",
        "https://catalog.uic.edu/all-course-descriptions/russ/",
        "https://catalog.uic.edu/all-course-descriptions/slav/",
        "https://catalog.uic.edu/all-course-descriptions/sj/",
        "https://catalog.uic.edu/all-course-descriptions/socw/",
        "https://catalog.uic.edu/all-course-descriptions/soc/",
        "https://catalog.uic.edu/all-course-descriptions/span/",
        "https://catalog.uic.edu/all-course-descriptions/sped/",
        "https://catalog.uic.edu/all-course-descriptions/spec/",
        "https://catalog.uic.edu/all-course-descriptions/stat/",
        "https://catalog.uic.edu/all-course-descriptions/sabr/",
        "https://catalog.uic.edu/all-course-descriptions/surg/",
        "https://catalog.uic.edu/all-course-descriptions/tx/",
        "https://catalog.uic.edu/all-course-descriptions/thtr/",
        "https://catalog.uic.edu/all-course-descriptions/tadr/",
        "https://catalog.uic.edu/all-course-descriptions/upp/",
        "https://catalog.uic.edu/all-course-descriptions/us/",
        "https://catalog.uic.edu/all-course-descriptions/upa/",
        "https://catalog.uic.edu/all-course-descriptions/usl/",
        "https://catalog.uic.edu/search/?P=BMS+602",
        "https://catalog.uic.edu/search/?P=BMS+604",
        "https://catalog.uic.edu/search/?P=BMS+606",
        "https://catalog.uic.edu/search/?P=BMS+622",
        "https://catalog.uic.edu/search/?P=BMS+644",
        "https://catalog.uic.edu/search/?P=BMS+653",
        "https://catalog.uic.edu/search/?P=BMS+666",
        "http://admissions.uic.edu/apply-now",
        "http://admissions.uic.edu/contact-admissions"
    ]
}