{
    "url": "https://honors.uic.edu/faculty-and-fellows/fellow-of-the-year/",
    "title": "Fellow of the Year | Honors College | University of Illinois at Chicago",
    "text": [
        "Fellow, Capstone Supervisor, and Instructor of the Year",
        "2018-19",
        "Dr. Mary Jo LaDu",
        "Professor, Department of Anatomy and Cell Biology",
        "College of Medicine",
        "Honors Faculty Fellows are individually assigned to provide personalized advising and mentoring to students. Each year, Honors College students nominate Fellows to be honored as “Fellow of the Year” for excellence in mentoring.  We are pleased to award the 2018-19 title to Mary Jo LaDu, Professor, Department of Anatomy and Cell Biology in the College of Medicine."ed in the field and in the laboratory. Course Information: Field work required. Course Information: Recommended background: Credit in ART 112. Class Schedule Information: To be properly registered, students must enroll in one Lecture and one Laboratory.",
        "",
        "BVIS 270.  Anatomical Figure Drawing.  3 hours.",
        "",
        "Introduction to figure drawing through the application of foundational surface anatomy and figure construction based on musculoskeletal knowledge. Course Information: Recommended background: Credit in ART 112. Class Schedule Information: To be properly registered, students must enroll in one Lecture and one Laboratory.",
        "",
        "BVIS 320.  Life Science Animation, Storytelling and Storyboarding.  3 hours.",
        "",
        "Introduction to storyboard, storytelling, and 2D animation techniques for life science. Course Information: Extensive computer use required. Prerequisite(s): Life Science Visualization Techniques I. Class Schedule Information: To be properly registered, students must enroll in one Lecture and one Laboratory.",
        "",
        "BVIS 325.  Digital Sculpting for Life Science Illustration.  3 hours.",
        "",
        "Introduction to the aesthetic and technical aspects of digital sculpting, painting, lighting, rendering and compositing techniques used in life science illustration.  Software programs include Pixologic ZBrush and Adobe Photoshop. Course Information: Extensive computer use required. Prerequisite(s): Life Science Visualization Techniques I. Class Schedule Information: To be properly registered, students must enroll in one Lecture and one Laboratory.",
        "",
        "BVIS 330.  Serious Games for Life Science Education.  3 hours.",
        "",
        "Introduction to interaction design, educational gamification, game-based learning theory, and concept design for life science education. Primary computer software is the Unity game engine. Course Information: Extensive computer use required. Prerequisite(s): Life Science Visualization Techniques I. Class Schedule Information: To be properly registered, students must enroll in one Lecture and one Laboratory.",
        "",
        "BVIS 335.  Visual Strategies for Health and Life Science Communication.  3 hours.",
        "",
        "Introduces the principles of visual communication for data visualization, poster presentation, education and research. Visualization is employed to support critical thinking, design, and effective communication in biomedical discovery and healthcare. Class Information: Extensive computer use required. Prerequisite(s): Life Science Visualization Techniques I. Class Schedule Information: To be properly registered, students must enroll in on Lecture and one Laboratory.",
        "",
        "BVIS 500.  Biomedical Visualization Techniques.  2 hours.",
        "",
        "Introduction to methods and techniques for biomedical visualization. Topics include illustration, 3D modeling, animation, interactive and mobile media, computer programming, gaming, haptics, augmented and virtual reality. Course Information: Extensive computer use required. Meets 8 weeks of the semester. Class Schedule Information: To be properly registered, students must enroll in one Laboratory and one Lecture.",
        "",
        "BVIS 501.  Professional Practices in Biomedical Visualization.  1 hour.",
        "",
        "Designed to introduce the BVIS graduate program, professional practices including history of the profession, professional communications, application of metadata to digital files, and an introduction to copyright. Course Information: Meets eight weeks of the semester.",
        "",
        "BVIS 502.  Clinical Sciences for Biomedical Visualization.  3 hours.",
        "",
        "Students experience the clinical setting under supervision of UIC residents and attending physicians. Includes  an introduction to the surgical specialties, surgical techniques and surgical sketching. Course Information: Previously listed as BVIS 400. Field work required. Prerequisite(s): BVIS 505 and BVIS 510 and BVIS 552; and consent of the instructor.",
        "",
        "BVIS 503.  Strategic Inquiry in Biomedical Visualization.  3 hours.",
        "",
        "Overview of research in BVIS includes IRB; statistics; research ethics; research proposal development including background and justification; literature review; research questions, arguments and methods; and discussion of anticipated results. Course Information: Extensive computer use required. Prerequisite(s): BHIS 499.",
        "",
        "BVIS 504.  Visual Storytelling in Biomedical Visualization.  2 hours.",
        "",
        "Provides students with a foundation in visual storytelling, supporting exploration of the fundamental tools of visualization, including storyboarding for digital media, composition, as well as visual literacies. Course Information: Meets eight weeks of the semester. Class Schedule Information: To be properly registered, students must enroll in one lecture-discussion and one laboratory.",
        "",
        "BVIS 505.  Visual Learning and Visual Thinking I.  2 hours.",
        "",
        "Provides students with the foundation of visual thinking and learning as it applies to life science, healthcare, and medicine. Class Schedule Information: To be properly registered, students must enroll in Lecture and one Laboratory-Discussion.",
        "",
        "BVIS 508.  Pathophysiology for Biomedical Visualization.  3 hours.",
        "",
        "Building on basic anatomy and physiology, this course focuses on pathophysiology and visualization methods of common human diseases and disorders including etiology and symptoms. Course Information: Prerequisite(s): ANAT 411; or consent of instructor. Class Schedule Information: To be properly registered, students must enroll in one Discussion/Recitation and one Lecture.",
        "",
        "BVIS 510.  Anatomical Visualization.  3 hours.",
        "",
        "Graphic manipulation and representation of human morphology and gross anatomy. Graphic construction skills, visual standards and conventions, data collection methods, and personal sketch style development. Course Information: Previously listed as BVIS 405. Class Schedule Information:  To be properly registered, students must enroll in one Laboratory and one Lecture.",
        "",
        "BVIS 518.  Web Development.  2 hours.",
        "",
        "Design and development of web-based Internet applications for healthcare, marketing communications, and social media including interface design, usability, information architecture and services such as Search Engine Optimization (SEO). Course Information: Previously listed as BVIS 415. Extensive computer use required. Class Schedule Information: To be properly registered, students must enroll in one Laboratory and one Lecture.",
        "",
        "BVIS 519.  Modeling I.  3 hours.",
        "",
        "An introduction to the aesthetic and technical aspects of digital modeling, texturing, lighting, rendering and compositing techniques used in biomedical images and visualization. Course Information: Previously listed as BVIS 540. Extensive computer use required. Prerequisite(s): BVIS 552. Class Schedule Information:  To be properly registered, students must enroll in one Laboratory and one Lecture.",
        "",
        "BVIS 520.  Modeling II.  3 hours.",
        "",
        "Advanced instruction in the aesthetic and technical aspects of digital modeling, including model optimization, advanced modifiers, and application of advanced concepts in several modeling programs. Course Information: Extensive computer use required. Prerequisite(s): BVIS 519. Class Schedule Information: To be properly registered, students must enroll in one Laboratory and one Lecture-Discussion.",
        "",
        "BVIS 521.  Modeling III.  2 hours.",
        "",
        "Advanced instruction in the aesthetic/technical aspects of digital modeling, including advanced sculpting/painting techniques, material manipulation, lighting, model optimization, and application of advanced concepts in several 3D modeling programs. Course Information: Extensive computer use required. Prerequisite(s): BVIS 520. Class Schedule Information: To be properly registered, students must enroll in one Lecture-Discussion and one Laboratory.",
        "",
        "BVIS 522.  Illustration Techniques.  3 hours.",
        "",
        "Introduction to line, continuous tone and color rendering techniques. Digital image creation and manipulation, color theory and design, print and electronic publication issues. Course Information: Previously listed as BVIS 420. Prerequisite(s): BVIS 510 Anatomical Visualization. Class Schedule Information:  To be properly registered, students must enroll in one Laboratory and one Lecture.",
        "",
        "BVIS 523.  Haptics.  4 hours.",
        "",
        "Hands-on course on fundamental concepts of haptics technology applied to medical visualization, simulation, and training. Course Information: Same as BIOE 523. Extensive computer use required. Recommended Background: Basic computer programming experience. Class Schedule Information: To be properly registered, students must enroll in one Lecture-Discussion and one Laboratory.",
        "",
        "BVIS 530.  Surgical Illustration.  4 hours.",
        "",
        "Students attend surgery, research surgical procedures and prepare illustrations for educational and commercial use. Students integrate knowledge of instructional design, anatomy, graphic design, and illustration techniques. Course Information: Prerequisite(s): ANAT 441 and BVIS 522 and BVIS 528 and BVIS 535 and BVIS 552. Class Schedule Information: To be properly registered, students must enroll in one Laboratory and one Lecture.",
        "",
        "BVIS 535.  Visual Learning and Visual Thinking II.  2 hours.",
        "",
        "Provides students advanced skills in visual learning and thinking, including information hierarchy, information graphics, selection of evaluation methods for testing of visual message(s) and advanced paper prototyping. Course Information: Previously listed as BVIS 440. Prerequisite(s): BVIS 505. Class Schedule Information: To be properly registered, students must enroll in one Laboratory and one Lecture.",
        "",
        "BVIS 536.  Interactive Visualization.  3 hours.",
        "",
        "Design and develop games and educational tools using techniques and principles essential to interactive program development. This includes game-based learning and gamification, user interface wireframing, and an introduction to programming languages. Course Information: Extensive computer use required. Prerequisite(s): BVIS 505 and BVIS 518. Recommended Background: BVIS 535. Graduation credit not given to students enrolled in Biomedical Visualization: MS. Class Schedule Information: To be properly registered, students must enroll in one Lecture-Discussion and one Laboratory.",
        "",
        "BVIS 537.  Advanced Interactive Visualization.  3 hours.",
        "",
        "Discuss the advanced concepts within interactivity production with a focus on Virtual Reality and Augmented Reality. The course will provide experience with various project builds for the HTC Vive, the Oculus Rift, and mobile VR applications. Course Information: Extensive computer use required. Prerequisite(s): BVIS 505 and BVIS 518 and BVIS 536. Recommended Background: BVIS 535. Restricted to students in the following majors: Biomedical Visualization: MS. Class Schedule Information: To be properly registered, students must enroll in one Lecture-Discussion and one Laboratory.",
        "",
        "BVIS 538.  Medical Legal Visualization.  2 hours.",
        "",
        "Advanced visualization and application of radiographic imaging data for effective communication of both complex and sequential concepts used in the medical legal and courtroom environment. Course Information: Prerequisite(s): BVIS 505 and BVIS 510 and BVIS 522. Class Schedule Information: To be properly registered, students must enroll in one Lecture-Discussion and one Laboratory.",
        "",
        "BVIS 539.  Immersive Interactive Visualization.  3 hours.",
        "",
        "Advanced concepts in interactivity production with a focus on Virtual Reality and Augmented Reality. Provides experience with various project builds for standalone and mobile VR applications. Course Information: Extensive computer use required. Prerequisite(s): BVIS 505; and VIS 518; and BVIS 536. Recommended Background: BVIS 537. Class Schedule Information: To be properly registered, students must enroll in one Laboratory and one Lecture-Discussion.",
        "",
        "BVIS 541.  Animation I.  2 hours.",
        "",
        "Introduces principles of the animation production pipeline (e.g. choosing a specific target audience, script, storyboard, audio, motion, lighting, rendering, compositing). Course Information:  Previously listed as BVIS 545. Extensive computer use required. Prerequisite(s): BVIS 518 and BVIS 535. Recommended background: BVIS 500. Class Schedule Information:  To be properly registered, students must enroll in one Laboratory and one Lecture.",
        "",
        "BVIS 542.  Animation II.  3 hours.",
        "",
        "This intermediate course explores lighting, basic special effects, in-camera visual effects, basic particle systems, motion modifiers, production management and use of a render farm. Course Information: Extensive computer use required. Prerequisite(s): BVIS 518 and BVIS 540 and BVIS 541. Recommended background: BVIS 520. Class Schedule Information: To be properly registered, students must enroll in one Laboratory and one Lecture.",
        "",
        "BVIS 543.  Animation III.  4 hours.",
        "",
        "Focuses on molecular visualization, rigging, camera mapping, advanced camera moves, advanced lighting and advance materials Introduction to node-based particle systems (PFlow) and dynamic simulations (MassFX). Course Information: Extensive computer use required. Prerequisite(s): BVIS 542. Recommended background: BVIS 519 and BVIS 520. Class Schedule Information: To be properly registered, students must enroll in one Lecture and one Laboratory.",
        "",
        "BVIS 544.  Animation IV.  4 hours.",
        "",
        "Instruction in advanced lighting, advanced special effects, Maxscript, rigging, particle systems, morph targets, compositing, development of a demo reel, and optimization/exporting assets for game engines. Course Information: Previously listed as BVIS 525. Taught in English. Extensive computer use required.Prerequisite(s): BVIS 543. Recommended background: BVIS 519 and BVIS 520. Class Schedule Information: To be properly registered, students must enroll in one Lecture and one Laboratory.",
        "",
        "BVIS 546.  Virtual Reality and Stereography in Biomedical Visualization.  2 hours.",
        "",
        "Introduction to 3D perception; digital 3D model creation; 3D presentation methods; computer configuration for 3D display; virtual reality in medicine. Class Schedule Information: To be properly registered, students must enroll in one Laboratory and one Lecture.",
        "",
        "BVIS 547.  360 Animation.  2 hours.",
        "",
        "Animating in 360 degrees for immersive storytelling in virtual reality for biomedical topics. Course Information: Extensive computer use required. Prerequisite(s): BVIS 542. Class Schedule Information: To be properly registered, students must enroll in one Laboratory and one Lecture.",
        "",
        "BVIS 548.  Advanced Illustration Techniques.  3 hours.",
        "",
        "An investigation of advanced biomedical illustration techniques through the process of topic research, goal analysis, concept and sketch development, and technique and style exploration. Course Information: Extensive computer use required. Prerequisite(s): BVIS 510 and BVIS 515 and BVIS 522. Class Schedule Information: To be properly registered, students must enroll in one Discussion and one Laboratory.",
        "",
        "BVIS 551.  3D Printing with Data Segmentation for Medicine.  2 hours.",
        "",
        "An introduction to 3D printing and digital segmentation/modeling of medical imaging data as applied to biomedical visualization and medicine. Course Information: Extensive computer use required. Meets eight weeks of the semester. Consent of the instructor is needed for non-BVIS majors. Class Schedule Information: To be properly registered, students must enroll in one Laboratory and one Lecture-Discussion.",
        "",
        "BVIS 552.  Graphic Design.  2 hours.",
        "",
        "Core concepts of graphic design in relation to the health sciences. Topics include typography, graphic elements, images, and the use of color to communicate general health concepts. Course Information: Previously listed as BVIS 450. Extensive computer use required. Meets eight weeks of the semester. Class Schedule Information:  To be properly registered, students must enroll in one Laboratory and one Lecture.",
        "",
        "BVIS 560.  Molecular Pharmacology for Biomedical Visualization.  3 hours.",
        "",
        "Foundation in molecular pharmacology with advanced research and visual communication skills to solve scientific communication problems for all audiences: scientist, investor, business and medical professional. Course Information: Extensive computer use required. Class Schedule Information: To be properly registered, students must enroll in one Laboratory and one Lecture-Discussion.",
        "",
        "BVIS 562.  Advanced Graphic Design.  3 hours.",
        "",
        "Advanced concepts of graphic design communication including symbolic graphic translation, logo mark design with a focus on concept development, and branding for the health sciences. Course Information: Previously listed as BVIS 515. Extensive computer use required. Prerequisite(s): BVIS 552. Class Schedule Information: To be properly registered, students must enroll in one Laboratory and one Lecture.",
        "",
        "BVIS 575.  Business Practices.  3 hours.",
        "",
        "Business practices for the biomedical visualization professional including communication, negotiation, ethics, copyright, licensing, proposals, contracts, business structure, project management, finance, branding, marketing, portfolio, and presentations. Course Information: Previously listed as BVIS 480.",
        "",
        "BVIS 580.  Practicum in Biomedical Visualization.  1-12 hours.",
        "",
        "Field experience under supervision of a professional expert in a biomedical communication setting that is consistent with student's area of concentration and career goals. Course Information: May be repeated. Prerequisite(s): Consent of the instructor.",
        "",
        "BVIS 594.  Special Topics in Biomedical Visualization.  1-4 hours.",
        "",
        "An in depth study of a biomedical visualization topic of importance selected by the faculty. Course Information: May be repeated. Students may register in more than one section per term. Prerequisite(s): Consent of the instructor.",
        "",
        "BVIS 595.  Seminar in Biomedical Visualization.  1 hour.",
        "",
        "Topics of current interest in biomedical visualization. Includes discussion of relevant journal articles and important new developments in the field. Course Information: Satisfactory/Unsatisfactory grading only. May be repeated.",
        "",
        "BVIS 596.  Independent Study.  1-4 hours.",
        "",
        "For graduate students who wish to pursue independent study of special problems in the student's area of interest not related to their project/thesis research. Course Information: May be repeated. Students may register in more than one section per term. Prerequisite(s): Graduate standing and consent of the instructor.",
        "",
        "BVIS 597.  Project Research.  0-4 hours.",
        "",
        "Independent investigation that draws upon the professional experience and knowledge synthesis of the student. Students investigate a topic/problem in their field, document a visualization project or write a paper, and deliver an oral presentation. Course Information: Satisfactory/Unsatisfactory grading only. May be repeated. Prerequisite(s): BHIS 499 and BHIS 500; and consent of the instructor.",
        "",
        "BVIS 598.  Research in Biomedical Visualization.  0-16 hours.",
        "",
        "Independent research in biomedical visualization directed by a faculty member. Course Information: Satisfactory/Unsatisfactory grading only. May be repeated. Students may register in more than one section per term. Prerequisite(s): BHIS 499 and BHIS 500; and consent of instructor.",
        "",
        "Apply Online | Contact Admissions | Privacy Statement",
        "Having problems accessing this site? Contact the Webmaster.",
        "© 2018-2019 The Board of Trustees of the University of Illinois",
        "",
        "Print this page.",
        "",
        "The PDF will include all information unique to this page.",
        "",
        "All pages in the campus catalog.",
        ""
    ],
    "out_links": [
        "https://catalog.uic.edu/azindex/",
        "https://catalog.uic.edu/",
        "http://www.uic.edu/",
        "https://catalog.uic.edu/ucat/",
        "https://catalog.uic.edu/gcat",
        "https://catalog.uic.edu/gcat/",
        "https://catalog.uic.edu/all-course-descriptions/",
        "https://catalog.uic.edu/all-course-descriptions/asp/",
        "https://catalog.uic.edu/all-course-descriptions/actg/",
        "https://catalog.uic.edu/all-course-descriptions/aast/",
        "https://catalog.uic.edu/all-course-descriptions/anat/",
        "https://catalog.uic.edu/all-course-descriptions/anth/",
        "https://catalog.uic.edu/all-course-descriptions/ahs/",
        "https://catalog.uic.edu/all-course-descriptions/arab/",
        "https://catalog.uic.edu/all-course-descriptions/arst/",
        "https://catalog.uic.edu/all-course-descriptions/arch/",
        "https://catalog.uic.edu/all-course-descriptions/art/",
        "https://catalog.uic.edu/all-course-descriptions/ah/",
        "https://catalog.uic.edu/all-course-descriptions/bms/",
        "https://catalog.uic.edu/all-course-descriptions/bcmg/",
        "https://catalog.uic.edu/all-course-descriptions/bioe/",
        "https://catalog.uic.edu/all-course-descriptions/bios/",
        "https://catalog.uic.edu/all-course-descriptions/bhis/",
        "https://catalog.uic.edu/all-course-descriptions/bps/",
        "https://catalog.uic.edu/all-course-descriptions/bstt/",
        "https://catalog.uic.edu/all-course-descriptions/ba/",
        "https://catalog.uic.edu/all-course-descriptions/cc/",
        "https://catalog.uic.edu/all-course-descriptions/cst/",
        "https://catalog.uic.edu/all-course-descriptions/cees/",
        "https://catalog.uic.edu/all-course-descriptions/che/",
        "https://catalog.uic.edu/all-course-descriptions/chem/",
        "https://catalog.uic.edu/all-course-descriptions/chin/",
        "https://catalog.uic.edu/all-course-descriptions/cd/",
        "https://catalog.uic.edu/all-course-descriptions/cme/",
        "https://catalog.uic.edu/all-course-descriptions/cl/",
        "https://catalog.uic.edu/all-course-descriptions/cler/",
        "https://catalog.uic.edu/all-course-descriptions/cele/",
        "https://catalog.uic.edu/all-course-descriptions/pele/",
        "https://catalog.uic.edu/all-course-descriptions/rele/",
        "https://catalog.uic.edu/all-course-descriptions/uele/",
        "https://catalog.uic.edu/all-course-descriptions/comm/",
        "https://catalog.uic.edu/all-course-descriptions/chsc/",
        "https://catalog.uic.edu/all-course-descriptions/cs/",
        "https://catalog.uic.edu/all-course-descriptions/clj/",
        "https://catalog.uic.edu/all-course-descriptions/ci/",
        "https://catalog.uic.edu/all-course-descriptions/dadm/",
        "https://catalog.uic.edu/all-course-descriptions/daob/",
        "https://catalog.uic.edu/all-course-descriptions/dbcs/",
        "https://catalog.uic.edu/all-course-descriptions/dcle/",
        "https://catalog.uic.edu/all-course-descriptions/dosi/",
        "https://catalog.uic.edu/all-course-descriptions/dost/",
        "https://catalog.uic.edu/all-course-descriptions/des/",
        "https://catalog.uic.edu/all-course-descriptions/dlg/",
        "https://catalog.uic.edu/all-course-descriptions/dhd/",
        "https://catalog.uic.edu/all-course-descriptions/mdc/",
        "https://catalog.uic.edu/all-course-descriptions/mdp/",
        "https://catalog.uic.edu/all-course-descriptions/mdr/",
        "https://catalog.uic.edu/all-course-descriptions/eaes/",
        "https://catalog.uic.edu/all-course-descriptions/econ/",
        "https://catalog.uic.edu/all-course-descriptions/ed/",
        "https://catalog.uic.edu/all-course-descriptions/edps/",
        "https://catalog.uic.edu/all-course-descriptions/epsy/",
        "https://catalog.uic.edu/all-course-descriptions/ece/",
        "https://catalog.uic.edu/all-course-descriptions/eb/",
        "https://catalog.uic.edu/all-course-descriptions/endo/",
        "https://catalog.uic.edu/all-course-descriptions/ener/",
        "https://catalog.uic.edu/all-course-descriptions/engr/",
        "https://catalog.uic.edu/all-course-descriptions/engl/",
        "https://catalog.uic.edu/all-course-descriptions/entr/",
        "https://catalog.uic.edu/all-course-descriptions/eohs/",
        "https://catalog.uic.edu/all-course-descriptions/epid/",
        "https://catalog.uic.edu/all-course-descriptions/epl/",
        "https://catalog.uic.edu/all-course-descriptions/fin/",
        "https://catalog.uic.edu/all-course-descriptions/fr/",
        "https://catalog.uic.edu/all-course-descriptions/gws/",
        "https://catalog.uic.edu/all-course-descriptions/geog/",
        "https://catalog.uic.edu/all-course-descriptions/ger/",
        "https://catalog.uic.edu/all-course-descriptions/glas/",
        "https://catalog.uic.edu/all-course-descriptions/gc/",
        "https://catalog.uic.edu/all-course-descriptions/gems/",
        "https://catalog.uic.edu/all-course-descriptions/gka/",
        "https://catalog.uic.edu/all-course-descriptions/gkm/",
        "https://catalog.uic.edu/all-course-descriptions/gamd/",
        "https://catalog.uic.edu/all-course-descriptions/him/",
        "https://catalog.uic.edu/all-course-descriptions/hpa/",
        "https://catalog.uic.edu/all-course-descriptions/hlp/",
        "https://catalog.uic.edu/all-course-descriptions/heb/",
        "https://catalog.uic.edu/all-course-descriptions/hnur/",
        "https://catalog.uic.edu/all-course-descriptions/hstl/",
        "https://catalog.uic.edu/all-course-descriptions/hist/",
        "https://catalog.uic.edu/all-course-descriptions/hon/",
        "https://catalog.uic.edu/all-course-descriptions/hn/",
        "https://catalog.uic.edu/all-course-descriptions/hum/",
        "https://catalog.uic.edu/all-course-descriptions/ie/",
        "https://catalog.uic.edu/all-course-descriptions/it/",
        "https://catalog.uic.edu/all-course-descriptions/ids/",
        "https://catalog.uic.edu/all-course-descriptions/iphs/",
        "https://catalog.uic.edu/all-course-descriptions/idea/",
        "https://catalog.uic.edu/all-course-descriptions/isa/",
        "https://catalog.uic.edu/all-course-descriptions/ip/",
        "https://catalog.uic.edu/all-course-descriptions/ibt/",
        "https://catalog.uic.edu/all-course-descriptions/inst/",
        "https://catalog.uic.edu/all-course-descriptions/ital/",
        "https://catalog.uic.edu/all-course-descriptions/jpn/",
        "https://catalog.uic.edu/all-course-descriptions/jst/",
        "https://catalog.uic.edu/all-course-descriptions/jd/",
        "https://catalog.uic.edu/all-course-descriptions/kn/",
        "https://catalog.uic.edu/all-course-descriptions/kor/",
        "https://catalog.uic.edu/all-course-descriptions/lat/",
        "https://catalog.uic.edu/all-course-descriptions/lals/",
        "https://catalog.uic.edu/all-course-descriptions/law/",
        "https://catalog.uic.edu/all-course-descriptions/lrsc/",
        "https://catalog.uic.edu/all-course-descriptions/las/",
        "https://catalog.uic.edu/all-course-descriptions/lib/",
        "https://catalog.uic.edu/all-course-descriptions/ling/",
        "https://catalog.uic.edu/all-course-descriptions/lcsl/",
        "https://catalog.uic.edu/all-course-descriptions/lith/",
        "https://catalog.uic.edu/all-course-descriptions/mgmt/",
        "https://catalog.uic.edu/all-course-descriptions/mktg/",
        "https://catalog.uic.edu/all-course-descriptions/mba/",
        "https://catalog.uic.edu/all-course-descriptions/meng/",
        "https://catalog.uic.edu/all-course-descriptions/mj/",
        "https://catalog.uic.edu/all-course-descriptions/mcs/",
        "https://catalog.uic.edu/all-course-descriptions/math/",
        "https://catalog.uic.edu/all-course-descriptions/mtht/",
        "https://catalog.uic.edu/all-course-descriptions/me/",
        "https://catalog.uic.edu/all-course-descriptions/mbt/",
        "https://catalog.uic.edu/all-course-descriptions/mhpe/",
        "https://catalog.uic.edu/all-course-descriptions/mhum/",
        "https://catalog.uic.edu/all-course-descriptions/mdch/",
        "https://catalog.uic.edu/all-course-descriptions/pmmp/",
        "https://catalog.uic.edu/all-course-descriptions/mim/",
        "https://catalog.uic.edu/all-course-descriptions/mils/",
        "https://catalog.uic.edu/all-course-descriptions/movi/",
        "https://catalog.uic.edu/all-course-descriptions/muse/",
        "https://catalog.uic.edu/all-course-descriptions/mus/",
        "https://catalog.uic.edu/all-course-descriptions/nast/",
        "https://catalog.uic.edu/all-course-descriptions/nats/",
        "https://catalog.uic.edu/all-course-descriptions/ns/",
        "https://catalog.uic.edu/all-course-descriptions/neus/",
        "https://catalog.uic.edu/all-course-descriptions/nurs/",
        "https://catalog.uic.edu/all-course-descriptions/nuel/",
        "https://catalog.uic.edu/all-course-descriptions/nupr/",
        "https://catalog.uic.edu/all-course-descriptions/nusp/",
        "https://catalog.uic.edu/all-course-descriptions/ot/",
        "https://catalog.uic.edu/all-course-descriptions/omds/",
        "https://catalog.uic.edu/all-course-descriptions/osci/",
        "https://catalog.uic.edu/all-course-descriptions/osur/",
        "https://catalog.uic.edu/all-course-descriptions/ortd/",
        "https://catalog.uic.edu/all-course-descriptions/path/",
        "https://catalog.uic.edu/all-course-descriptions/psl/",
        "https://catalog.uic.edu/all-course-descriptions/pedd/",
        "https://catalog.uic.edu/all-course-descriptions/peri/",
        "https://catalog.uic.edu/all-course-descriptions/pmpg/",
        "https://catalog.uic.edu/all-course-descriptions/pcol/",
        "https://catalog.uic.edu/all-course-descriptions/phar/",
        "https://catalog.uic.edu/all-course-descriptions/pmpr/",
        "https://catalog.uic.edu/all-course-descriptions/psop/",
        "https://catalog.uic.edu/all-course-descriptions/phil/",
        "https://catalog.uic.edu/all-course-descriptions/pt/",
        "https://catalog.uic.edu/all-course-descriptions/phys/",
        "https://catalog.uic.edu/all-course-descriptions/phyb/",
        "https://catalog.uic.edu/all-course-descriptions/pol/",
        "https://catalog.uic.edu/all-course-descriptions/pols/",
        "https://catalog.uic.edu/all-course-descriptions/port/",
        "https://catalog.uic.edu/all-course-descriptions/prcl/",
        "https://catalog.uic.edu/all-course-descriptions/ptl/",
        "https://catalog.uic.edu/all-course-descriptions/pros/",
        "https://catalog.uic.edu/all-course-descriptions/psch/",
        "https://catalog.uic.edu/all-course-descriptions/pa/",
        "https://catalog.uic.edu/all-course-descriptions/pubh/",
        "https://catalog.uic.edu/all-course-descriptions/ppol/",
        "https://catalog.uic.edu/all-course-descriptions/ppa/",
        "https://catalog.uic.edu/all-course-descriptions/re/",
        "https://catalog.uic.edu/all-course-descriptions/rels/",
        "https://catalog.uic.edu/all-course-descriptions/rest/",
        "https://catalog.uic.edu/all-course-descriptions/russ/",
        "https://catalog.uic.edu/all-course-descriptions/slav/",
        "https://catalog.uic.edu/all-course-descriptions/sj/",
        "https://catalog.uic.edu/all-course-descriptions/socw/",
        "https://catalog.uic.edu/all-course-descriptions/soc/",
        "https://catalog.uic.edu/all-course-descriptions/span/",
        "https://catalog.uic.edu/all-course-descriptions/sped/",
        "https://catalog.uic.edu/all-course-descriptions/spec/",
        "https://catalog.uic.edu/all-course-descriptions/stat/",
        "https://catalog.uic.edu/all-course-descriptions/sabr/",
        "https://catalog.uic.edu/all-course-descriptions/surg/",
        "https://catalog.uic.edu/all-course-descriptions/tx/",
        "https://catalog.uic.edu/all-course-descriptions/thtr/",
        "https://catalog.uic.edu/all-course-descriptions/tadr/",
        "https://catalog.uic.edu/all-course-descriptions/upp/",
        "https://catalog.uic.edu/all-course-descriptions/us/",
        "https://catalog.uic.edu/all-course-descriptions/upa/",
        "https://catalog.uic.edu/all-course-descriptions/usl/",
        "https://catalog.uic.edu/search/?P=ART+112",
        "https://catalog.uic.edu/search/?P=BVIS+505",
        "https://catalog.uic.edu/search/?P=BVIS+510",
        "https://catalog.uic.edu/search/?P=BVIS+552",
        "https://catalog.uic.edu/search/?P=BHIS+499",
        "https://catalog.uic.edu/search/?P=BVIS+519",
        "https://catalog.uic.edu/search/?P=BVIS+520",
        "https://catalog.uic.edu/search/?P=BIOE+523",
        "https://catalog.uic.edu/search/?P=ANAT+441",
        "https://catalog.uic.edu/search/?P=BVIS+522",
        "https://catalog.uic.edu/search/?P=BVIS+535",
        "https://catalog.uic.edu/search/?P=BVIS+518",
        "https://catalog.uic.edu/search/?P=BVIS+536",
        "https://catalog.uic.edu/search/?P=BVIS+537",
        "https://catalog.uic.edu/search/?P=BVIS+500",
        "https://catalog.uic.edu/search/?P=BVIS+541",
        "https://catalog.uic.edu/search/?P=BVIS+542",
        "https://catalog.uic.edu/search/?P=BVIS+543",
        "https://catalog.uic.edu/search/?P=BHIS+500",
        "http://admissions.uic.edu/apply-now",
        "http://admissions.uic.edu/contact-admissions"
    ]
}