{
    "url": "https://catalog.uic.edu/all-course-descriptions/bstt/",
    "title": "Biostatistics (BSTT) < University of Illinois at Chicago",
    "text": [
        "BSTT 401.  Biostatistics II.  4 hours.",
        "",
        "Simple and multiple linear regression, stepwise regression, multifactor analysis of variance and covariance, non-parametric methods, logistic regression, analysis of categorical data; extensive use of computer software. Course Information: Prerequisite(s): BSTT 400.",
        "",
        "BSTT 402.  Health Policy for Epidemiologists and Biostatisticians.  1 hour.",
        "",
        "Epidemiological data and biostatistics provide the evidence to support the development and justification of policies. Public health policy interventions, factors influencing political and social environments and the evaluation of policy-making. Course Information: Same as EPID 402.",
        "",
        "BSTT 413.  Introduction to Data Analysis w/ R.  2 hours.",
        "",
        "An introductory overview of statistical programming using R in the context of describing and analyzing public health data. Course Information: Extensive computer use required. Recommended background: BSTT 400; or IPHS 402.",
        "",
        "BSTT 426.  Health Data Analytics Using Python Programming.  3 hours.",
        "",
        "Covers methodologies of online data collection by Python Programming. Topics include: introduction to Python, Information retrieval Techniques, Retrieving and analyzing information from medical data sources, IBM Bluemix. Course Information: Extensive computer use required. Prerequisite(s): No prerequisites except that some very basic understanding of programming in SAS or R or some other programming language is needed along with basic analytical knowledge. Motivation to learn programming concepts is key.  Recommended Background: IPHS 402 or EPID 406 or BSTT 494.",
        "",
        "BSTT 494.  Introductory Special Topics in Biostatistics.  1-4 hours.",
        "",
        "Special topics in biostatistics. Content varies. Course Information: May be repeated. Students may register in more than one section per term. Prerequisite(s): Consent of the instructor.",
        "",
        "BSTT 505.  Logistic Regression and Survival Analysis.  2 hours.",
        "",
        "Interpretation of logistic regression and survival analysis models. Running logistic and proportional hazards regression models and constructing life-tables using SAS. Course Information: Previously listed as BSTT 402. Prerequisite(s): BSTT 400 and BSTT 401.",
        "",
        "BSTT 506.  Design of Clinical Trials.  3 hours.",
        "",
        "Rationale for clinical trials, blinding, ethical issues, methods of randomization, crossover trials, power and sample size calculations, data management, protocol deviation, data analysis, interim analysis. Course Information: Previously listed as BSTT 430. Prerequisite(s): BSTT 400 and BSTT 401.",
        "",
        "BSTT 507.  Sampling and Estimation Methods Applied to Public Health.  3 hours.",
        "",
        "The purpose of this course is to provide a comprehensive overview of current methods and issues in survey sample design and associated estimation procedures. Course Information: Previously listed as BSTT 440. Credit is not given for BSTT 507 if the student has credit in STAT 431.  Restriction applies only to certification for students pursuing the Interdepartmental Graduate Concentration in Survey Methodology.  Prerequisite(s): BSTT 401 or BSTT 502 or consent of the instructor.",
        "",
        "BSTT 521.  Applied Multivariate Analysis.  3 hours.",
        "",
        "Analysis of vector of responses; MANOVA, data reduction methods; introduction to cluster analysis, discriminant analysis, and structural equation models. Course Information: Prerequisite(s): BSTT 537 and consent of the instructor.",
        "",
        "BSTT 523.  Biostatistics Methods I.  4 hours.",
        "",
        "Foundations for and introduction to statistical inference, including one- and two-sample problems; regression analysis, including multiple regression and indicator variables. Course Information: Previously listed as BSTT 502. Prerequisite(s): College calculus, including multivariable calculus, concurrent registration in BSTT 524, and consent of the instructor.",
        "",
        "BSTT 524.  Biostatistics Laboratory.  2 hours.",
        "",
        "Use of spreadsheets for statistical investigations; use of statistical software; matrix theory, including methods relevant in biostatistical analysis. Course Information: Previously listed as BSTT 503. Prerequisite(s): Concurrent registration in BSTT 523 and consent of the instructor.",
        "",
        "BSTT 525.  Biostatistics Methods II.  4 hours.",
        "",
        "Analysis of variance and multiple comparisons; model building and diagnostics; generalized linear models; logistic and Poisson regression; introduction to repeated measures and mixed models. Course Information: Previously listed as BSTT 504. Prerequisite(s): Grade of B or better in BSTT 523 and Grade of B or better in BSTT 524, or consent of the instructor.",
        "",
        "BSTT 527.  Statistical Learning in Health Analytics.  3 hours.",
        "",
        "Covers multivariate statistical methods such as LASSO, ElasticNet, Decision Trees etc, and machine learning methods Bagging, random Forest, Boosting etc in context of statistical learning in PH applications.  Course Information: Extensive computer use required. Prerequisite(s): IPHS 402 and BSTT 505; or BSTT 523 and BSTT 525.  Recommended Background: IPHS 402 or EPID 406 or BSTT 494.",
        "",
        "BSTT 528.  Machine Learning in Health Analytics.  3 hours.",
        "",
        "Covers several advanced statistical and machine learning methods including graphical models, natural language processing, neural nets, hierarchical modeling, annealing, deep belief networks.  Course Information: Extensive computer use required.  Prerequisite(s): BSTT 526 and BSTT 527.",
        "",
        "BSTT 529.  Health Analytics Investigations.  2 hours.",
        "",
        "This is a main competency measure of MS in Public Health with Health Analytics concentration.  Course Information: Satisfactory/Unsatisfactory grading only. Extensive computer use required. Prerequisite(s): BSTT 526 and BSTT 527 and BSTT 528; or consent of the instructor.",
        "",
        "BSTT 535.  Categorical Data Analysis.  3 hours.",
        "",
        "Contingency tables and their tests, measures of association, stratified analysis, logistic regression, generalized linear model, Poisson regression, log-linear model, matched data, marginal homogeneity, ordinal data. Course Information: Previously listed as BSTT 511. Prerequisite(s): Grade of B or better in BSTT 525; and STAT 411, or consent of the instructor.",
        "",
        "BSTT 536.  Survival Analysis.  3 hours.",
        "",
        "Concepts of lifetime or survival distributions, especially with censored data; nonparametric estimation of the survival function; rank tests; proportional hazards regression models; parametric models. Course Information: Previously listed as BSTT 512. Prerequisite(s): Grade of B or better in BSTT 525 and Grade of B or better in STAT 411, or consent of the instructor.",
        "",
        "BSTT 537.  Longitudinal Data Analysis.  4 hours.",
        "",
        "Application and theory of models for longitudinal data analysis for both continuous and categorical response data, including use of statistical software for these methods. Course Information: Previously listed as BSTT 513. Prerequisite(s): Grade of B or better in STAT 411 and Grade of B or better in BSTT 525, or consent of the instructor.",
        "",
        "BSTT 538.  Biostatistical Consulting.  2 hours.",
        "",
        "Discussion of techniques required for successful biostatistical consultation; effective communication, problem formulation, data analysis, oral and written reports, supervised consulting experience. Course Information: Previously listed as BSTT 514. Prerequisite(s): Grade of B or better in BSTT 525 and consent of the instructor. Restricted to students enrolled in the biostatistics major.",
        "",
        "BSTT 550.  Biostatistical Investigations.  4 hours.",
        "",
        "Analysis of several large data sets that will require integration of numerous biostatistical tools; written summarization and discussion of results. Course Information: Previously listed as BSTT 522. Prerequisite(s): Grade of B or better in BSTT 535 and Grade of B or better in BSTT 536 and Grade of B or better in BSTT 537 and Grade of B or better in BSTT 538 and Grade of B or better or concurrent registration in BSTT 521.",
        "",
        "BSTT 560.  Large Sample Theory.  2 hours.",
        "",
        "Deriving and applying large sample statistical theories. The primary focus will be in limit theorums and their applications in biostatistical problems. Course Information: Meets eight weeks of the semester. Previously listed as BSTT 534. Prerequisite(s): Open only to PhD degree students; or consent of the instructor. Adequate training at the level of intermediate mathematical statistics. Masters degree in biostatistics or mathematics.",
        "",
        "BSTT 561.  Advanced Statistical Inference.  3 hours.",
        "",
        "An in-depth consideration of some important ideas of statistical inference including large-sample theory, estimation and testing. Specific topics to be covered include asymptotic theory, parameter estimation methods and hypothesis testing. Some computer use in class. Course Information: Previously listed as BSTT 531. Prerequisite(s): Open only to Ph.D. degree students; and consent of the instructor. Recommended background: MS degree in Biostatistics or the equivalent.",
        "",
        "BSTT 562.  Linear Models.  4 hours.",
        "",
        "Generalized inverse matrices; distributions for quadratic forms; estimability and testable hypotheses; constrained linear model; applications to regression, ANOVA, ANCOVA models; variance component models. Course Information: Previously listed as BSTT 533. Prerequisite(s): Open only to Ph.D. degree students; or consent of the instructor. Recommended background: MS degree in Biostatistics or the equivalent.",
        "",
        "BSTT 563.  Generalized Linear Models.  4 hours.",
        "",
        "Teaches students the components of generalized linear models and their extensions. Course Information: Previously listed as BSTT 541. Prerequisite(s): BSTT 561 and concurrent registration in or prior completion of BSTT 560. Open only to PhD degree students; or consent of the instructor. Adequate training at level of intermediate mathematical statistics. Masters degree in biostatistics, mathematical statistics or methematics.",
        "",
        "BSTT 564.  Missing Data.  4 hours.",
        "",
        "Students will learn the statistical methods used for analyzing data with missing values. Course Information: Previously listed as BSTT 542. Prerequisite(s): BSTT 561 and concurrent registration in or prior completion of BSTT 560. Open only to PhD degree students; or consent of the instructor. Adequate training at level of intermediate mathematical statistics. Masters degree in biostatistics, mathematical statistics or methematics.",
        "",
        "BSTT 565.  Computational Statistics.  4 hours.",
        "",
        "Developing a broad and thorough working knowledge of modern statistical computing and computational statistics on a practical, conceptual, philosophical and mathematical level. Course Information: Previously listed as BSTT 543. Extensive computer use required. Prerequisite(s): Concurrent registration in or prior completion of BSTT 560. Open only to Ph.D. degree students; or consent of the instructor. Adequate training at level of intermediate mathematical statistics. Masters degree in biostatistics, mathematical statistics or mathematics.",
        "",
        "BSTT 566.  Bayesian Methods.  4 hours.",
        "",
        "Developing a broad and thorough working knowledge of Bayesian applications on a practical, conceptual, philosophical and mathematical level. Course Information: Previously listed as BSTT 544. Prerequisite(s): Concurrent registration in or prior completion of BSTT 560. Open only to Ph.D. degree students; or consent of the instructor. Adequate training at level of intermediate mathematical statistics. Masters degree in biostatistics, mathematical statistics or mathematics. Class Schedule Information: Extensive computer use required.",
        "",
        "BSTT 567.  Advanced Survival Analysis.  4 hours.",
        "",
        "Methods of analysis for multivariate survival data, including transition models and shared frailty models. Theory behind existing methodology is covered as well as implementation. Course Information: Prerequisite(s): Grade of B or better or concurrent registration in BSTT 536; and consent of the instructor. Recommended background: Intended for students in the Biostatistics PhD program.",
        "",
        "BSTT 568.  Programming and Simulation in R.  2 hours.",
        "",
        "Applications in R on a practical, conceptual, philosophical and mathematical level. The focus is on simulation and computation, not on data analysis. Course Information: Extensive computer use required. Prerequisite(s): BSTT 400; or both BSTT 523 and BSTT 524; and graduate or professional standing; or consent of the instructor.",
        "",
        "BSTT 594.  Special Topics in Biostatistics.  1-4 hours.",
        "",
        "Advanced special topics. Content varies. Course Information: May be repeated. Students may register in more than one section per term. Prerequisite(s):  Consent of the instructor.",
        "",
        "BSTT 595.  Biostatistics Research Seminar.  1 hour.",
        "",
        "Current developments in theory and application of biostatistics and epidemiology with presentations by faculty and visiting scientists.  Course Information: Satisfactory/Unsatisfactory grading only.  May be repeated.",
        "",
        "Apply Online | Contact Admissions | Privacy Statement",
        "Having problems accessing this site? Contact the Webmaster.",
        "© 2018-2019 The Board of Trustees of the University of Illinois",
        "",
        "Print this page.",
        "",
        "The PDF will include all information unique to this page.",
        "",
        "All pages in the campus catalog.",
        ""
    ],
    "out_links": [
        "https://catalog.uic.edu/azindex/",
        "https://catalog.uic.edu/",
        "http://www.uic.edu/",
        "https://catalog.uic.edu/ucat/",
        "https://catalog.uic.edu/gcat",
        "https://catalog.uic.edu/gcat/",
        "https://catalog.uic.edu/all-course-descriptions/",
        "https://catalog.uic.edu/all-course-descriptions/asp/",
        "https://catalog.uic.edu/all-course-descriptions/actg/",
        "https://catalog.uic.edu/all-course-descriptions/aast/",
        "https://catalog.uic.edu/all-course-descriptions/anat/",
        "https://catalog.uic.edu/all-course-descriptions/anth/",
        "https://catalog.uic.edu/all-course-descriptions/ahs/",
        "https://catalog.uic.edu/all-course-descriptions/arab/",
        "https://catalog.uic.edu/all-course-descriptions/arst/",
        "https://catalog.uic.edu/all-course-descriptions/arch/",
        "https://catalog.uic.edu/all-course-descriptions/art/",
        "https://catalog.uic.edu/all-course-descriptions/ah/",
        "https://catalog.uic.edu/all-course-descriptions/bms/",
        "https://catalog.uic.edu/all-course-descriptions/bcmg/",
        "https://catalog.uic.edu/all-course-descriptions/bioe/",
        "https://catalog.uic.edu/all-course-descriptions/bios/",
        "https://catalog.uic.edu/all-course-descriptions/bvis/",
        "https://catalog.uic.edu/all-course-descriptions/bhis/",
        "https://catalog.uic.edu/all-course-descriptions/bps/",
        "https://catalog.uic.edu/all-course-descriptions/ba/",
        "https://catalog.uic.edu/all-course-descriptions/cc/",
        "https://catalog.uic.edu/all-course-descriptions/cst/",
        "https://catalog.uic.edu/all-course-descriptions/cees/",
        "https://catalog.uic.edu/all-course-descriptions/che/",
        "https://catalog.uic.edu/all-course-descriptions/chem/",
        "https://catalog.uic.edu/all-course-descriptions/chin/",
        "https://catalog.uic.edu/all-course-descriptions/cd/",
        "https://catalog.uic.edu/all-course-descriptions/cme/",
        "https://catalog.uic.edu/all-course-descriptions/cl/",
        "https://catalog.uic.edu/all-course-descriptions/cler/",
        "https://catalog.uic.edu/all-course-descriptions/cele/",
        "https://catalog.uic.edu/all-course-descriptions/pele/",
        "https://catalog.uic.edu/all-course-descriptions/rele/",
        "https://catalog.uic.edu/all-course-descriptions/uele/",
        "https://catalog.uic.edu/all-course-descriptions/comm/",
        "https://catalog.uic.edu/all-course-descriptions/chsc/",
        "https://catalog.uic.edu/all-course-descriptions/cs/",
        "https://catalog.uic.edu/all-course-descriptions/clj/",
        "https://catalog.uic.edu/all-course-descriptions/ci/",
        "https://catalog.uic.edu/all-course-descriptions/dadm/",
        "https://catalog.uic.edu/all-course-descriptions/daob/",
        "https://catalog.uic.edu/all-course-descriptions/dbcs/",
        "https://catalog.uic.edu/all-course-descriptions/dcle/",
        "https://catalog.uic.edu/all-course-descriptions/dosi/",
        "https://catalog.uic.edu/all-course-descriptions/dost/",
        "https://catalog.uic.edu/all-course-descriptions/des/",
        "https://catalog.uic.edu/all-course-descriptions/dlg/",
        "https://catalog.uic.edu/all-course-descriptions/dhd/",
        "https://catalog.uic.edu/all-course-descriptions/mdc/",
        "https://catalog.uic.edu/all-course-descriptions/mdp/",
        "https://catalog.uic.edu/all-course-descriptions/mdr/",
        "https://catalog.uic.edu/all-course-descriptions/eaes/",
        "https://catalog.uic.edu/all-course-descriptions/econ/",
        "https://catalog.uic.edu/all-course-descriptions/ed/",
        "https://catalog.uic.edu/all-course-descriptions/edps/",
        "https://catalog.uic.edu/all-course-descriptions/epsy/",
        "https://catalog.uic.edu/all-course-descriptions/ece/",
        "https://catalog.uic.edu/all-course-descriptions/eb/",
        "https://catalog.uic.edu/all-course-descriptions/endo/",
        "https://catalog.uic.edu/all-course-descriptions/ener/",
        "https://catalog.uic.edu/all-course-descriptions/engr/",
        "https://catalog.uic.edu/all-course-descriptions/engl/",
        "https://catalog.uic.edu/all-course-descriptions/entr/",
        "https://catalog.uic.edu/all-course-descriptions/eohs/",
        "https://catalog.uic.edu/all-course-descriptions/epid/",
        "https://catalog.uic.edu/all-course-descriptions/epl/",
        "https://catalog.uic.edu/all-course-descriptions/fin/",
        "https://catalog.uic.edu/all-course-descriptions/fr/",
        "https://catalog.uic.edu/all-course-descriptions/gws/",
        "https://catalog.uic.edu/all-course-descriptions/geog/",
        "https://catalog.uic.edu/all-course-descriptions/ger/",
        "https://catalog.uic.edu/all-course-descriptions/glas/",
        "https://catalog.uic.edu/all-course-descriptions/gc/",
        "https://catalog.uic.edu/all-course-descriptions/gems/",
        "https://catalog.uic.edu/all-course-descriptions/gka/",
        "https://catalog.uic.edu/all-course-descriptions/gkm/",
        "https://catalog.uic.edu/all-course-descriptions/gamd/",
        "https://catalog.uic.edu/all-course-descriptions/him/",
        "https://catalog.uic.edu/all-course-descriptions/hpa/",
        "https://catalog.uic.edu/all-course-descriptions/hlp/",
        "https://catalog.uic.edu/all-course-descriptions/heb/",
        "https://catalog.uic.edu/all-course-descriptions/hnur/",
        "https://catalog.uic.edu/all-course-descriptions/hstl/",
        "https://catalog.uic.edu/all-course-descriptions/hist/",
        "https://catalog.uic.edu/all-course-descriptions/hon/",
        "https://catalog.uic.edu/all-course-descriptions/hn/",
        "https://catalog.uic.edu/all-course-descriptions/hum/",
        "https://catalog.uic.edu/all-course-descriptions/ie/",
        "https://catalog.uic.edu/all-course-descriptions/it/",
        "https://catalog.uic.edu/all-course-descriptions/ids/",
        "https://catalog.uic.edu/all-course-descriptions/iphs/",
        "https://catalog.uic.edu/all-course-descriptions/idea/",
        "https://catalog.uic.edu/all-course-descriptions/isa/",
        "https://catalog.uic.edu/all-course-descriptions/ip/",
        "https://catalog.uic.edu/all-course-descriptions/ibt/",
        "https://catalog.uic.edu/all-course-descriptions/inst/",
        "https://catalog.uic.edu/all-course-descriptions/ital/",
        "https://catalog.uic.edu/all-course-descriptions/jpn/",
        "https://catalog.uic.edu/all-course-descriptions/jst/",
        "https://catalog.uic.edu/all-course-descriptions/jd/",
        "https://catalog.uic.edu/all-course-descriptions/kn/",
        "https://catalog.uic.edu/all-course-descriptions/kor/",
        "https://catalog.uic.edu/all-course-descriptions/lat/",
        "https://catalog.uic.edu/all-course-descriptions/lals/",
        "https://catalog.uic.edu/all-course-descriptions/law/",
        "https://catalog.uic.edu/all-course-descriptions/lrsc/",
        "https://catalog.uic.edu/all-course-descriptions/las/",
        "https://catalog.uic.edu/all-course-descriptions/lib/",
        "https://catalog.uic.edu/all-course-descriptions/ling/",
        "https://catalog.uic.edu/all-course-descriptions/lcsl/",
        "https://catalog.uic.edu/all-course-descriptions/lith/",
        "https://catalog.uic.edu/all-course-descriptions/mgmt/",
        "https://catalog.uic.edu/all-course-descriptions/mktg/",
        "https://catalog.uic.edu/all-course-descriptions/mba/",
        "https://catalog.uic.edu/all-course-descriptions/meng/",
        "https://catalog.uic.edu/all-course-descriptions/mj/",
        "https://catalog.uic.edu/all-course-descriptions/mcs/",
        "https://catalog.uic.edu/all-course-descriptions/math/",
        "https://catalog.uic.edu/all-course-descriptions/mtht/",
        "https://catalog.uic.edu/all-course-descriptions/me/",
        "https://catalog.uic.edu/all-course-descriptions/mbt/",
        "https://catalog.uic.edu/all-course-descriptions/mhpe/",
        "https://catalog.uic.edu/all-course-descriptions/mhum/",
        "https://catalog.uic.edu/all-course-descriptions/mdch/",
        "https://catalog.uic.edu/all-course-descriptions/pmmp/",
        "https://catalog.uic.edu/all-course-descriptions/mim/",
        "https://catalog.uic.edu/all-course-descriptions/mils/",
        "https://catalog.uic.edu/all-course-descriptions/movi/",
        "https://catalog.uic.edu/all-course-descriptions/muse/",
        "https://catalog.uic.edu/all-course-descriptions/mus/",
        "https://catalog.uic.edu/all-course-descriptions/nast/",
        "https://catalog.uic.edu/all-course-descriptions/nats/",
        "https://catalog.uic.edu/all-course-descriptions/ns/",
        "https://catalog.uic.edu/all-course-descriptions/neus/",
        "https://catalog.uic.edu/all-course-descriptions/nurs/",
        "https://catalog.uic.edu/all-course-descriptions/nuel/",
        "https://catalog.uic.edu/all-course-descriptions/nupr/",
        "https://catalog.uic.edu/all-course-descriptions/nusp/",
        "https://catalog.uic.edu/all-course-descriptions/ot/",
        "https://catalog.uic.edu/all-course-descriptions/omds/",
        "https://catalog.uic.edu/all-course-descriptions/osci/",
        "https://catalog.uic.edu/all-course-descriptions/osur/",
        "https://catalog.uic.edu/all-course-descriptions/ortd/",
        "https://catalog.uic.edu/all-course-descriptions/path/",
        "https://catalog.uic.edu/all-course-descriptions/psl/",
        "https://catalog.uic.edu/all-course-descriptions/pedd/",
        "https://catalog.uic.edu/all-course-descriptions/peri/",
        "https://catalog.uic.edu/all-course-descriptions/pmpg/",
        "https://catalog.uic.edu/all-course-descriptions/pcol/",
        "https://catalog.uic.edu/all-course-descriptions/phar/",
        "https://catalog.uic.edu/all-course-descriptions/pmpr/",
        "https://catalog.uic.edu/all-course-descriptions/psop/",
        "https://catalog.uic.edu/all-course-descriptions/phil/",
        "https://catalog.uic.edu/all-course-descriptions/pt/",
        "https://catalog.uic.edu/all-course-descriptions/phys/",
        "https://catalog.uic.edu/all-course-descriptions/phyb/",
        "https://catalog.uic.edu/all-course-descriptions/pol/",
        "https://catalog.uic.edu/all-course-descriptions/pols/",
        "https://catalog.uic.edu/all-course-descriptions/port/",
        "https://catalog.uic.edu/all-course-descriptions/prcl/",
        "https://catalog.uic.edu/all-course-descriptions/ptl/",
        "https://catalog.uic.edu/all-course-descriptions/pros/",
        "https://catalog.uic.edu/all-course-descriptions/psch/",
        "https://catalog.uic.edu/all-course-descriptions/pa/",
        "https://catalog.uic.edu/all-course-descriptions/pubh/",
        "https://catalog.uic.edu/all-course-descriptions/ppol/",
        "https://catalog.uic.edu/all-course-descriptions/ppa/",
        "https://catalog.uic.edu/all-course-descriptions/re/",
        "https://catalog.uic.edu/all-course-descriptions/rels/",
        "https://catalog.uic.edu/all-course-descriptions/rest/",
        "https://catalog.uic.edu/all-course-descriptions/russ/",
        "https://catalog.uic.edu/all-course-descriptions/slav/",
        "https://catalog.uic.edu/all-course-descriptions/sj/",
        "https://catalog.uic.edu/all-course-descriptions/socw/",
        "https://catalog.uic.edu/all-course-descriptions/soc/",
        "https://catalog.uic.edu/all-course-descriptions/span/",
        "https://catalog.uic.edu/all-course-descriptions/sped/",
        "https://catalog.uic.edu/all-course-descriptions/spec/",
        "https://catalog.uic.edu/all-course-descriptions/stat/",
        "https://catalog.uic.edu/all-course-descriptions/sabr/",
        "https://catalog.uic.edu/all-course-descriptions/surg/",
        "https://catalog.uic.edu/all-course-descriptions/tx/",
        "https://catalog.uic.edu/all-course-descriptions/thtr/",
        "https://catalog.uic.edu/all-course-descriptions/tadr/",
        "https://catalog.uic.edu/all-course-descriptions/upp/",
        "https://catalog.uic.edu/all-course-descriptions/us/",
        "https://catalog.uic.edu/all-course-descriptions/upa/",
        "https://catalog.uic.edu/all-course-descriptions/usl/",
        "https://catalog.uic.edu/search/?P=BSTT+400",
        "https://catalog.uic.edu/search/?P=EPID+402",
        "https://catalog.uic.edu/search/?P=IPHS+402",
        "https://catalog.uic.edu/search/?P=EPID+406",
        "https://catalog.uic.edu/search/?P=BSTT+494",
        "https://catalog.uic.edu/search/?P=BSTT+402",
        "https://catalog.uic.edu/search/?P=BSTT+401",
        "https://catalog.uic.edu/search/?P=BSTT+507",
        "https://catalog.uic.edu/search/?P=STAT+431",
        "https://catalog.uic.edu/search/?P=BSTT+537",
        "https://catalog.uic.edu/search/?P=BSTT+524",
        "https://catalog.uic.edu/search/?P=BSTT+523",
        "https://catalog.uic.edu/search/?P=BSTT+505",
        "https://catalog.uic.edu/search/?P=BSTT+525",
        "https://catalog.uic.edu/search/?P=BSTT+527",
        "https://catalog.uic.edu/search/?P=BSTT+528",
        "https://catalog.uic.edu/search/?P=STAT+411",
        "https://catalog.uic.edu/search/?P=BSTT+535",
        "https://catalog.uic.edu/search/?P=BSTT+536",
        "https://catalog.uic.edu/search/?P=BSTT+538",
        "https://catalog.uic.edu/search/?P=BSTT+521",
        "https://catalog.uic.edu/search/?P=BSTT+561",
        "https://catalog.uic.edu/search/?P=BSTT+560",
        "http://admissions.uic.edu/apply-now",
        "http://admissions.uic.edu/contact-admissions"
    ]
}