{
    "url": "https://design.uic.edu/newsdetails/784/771",
    "title": "UIC MDes reopen to U.S. applicants with change of circumstance | UIC - School of Design",
    "text": [
        "We are able to accept applications from professional designers based in Chicago or the U.S. who are seeking to deepen their engagement with design theory and practice — and to proactively utilize the period of emerging economic recession to advance their career. The UIC Master of Design is a two-year full-time course of study.",
        "To confirm qualifications for a C-19 special application, due on June 15, please contact the graduate director for your discipline. Please note that our standard admissions process remains closed.",
        "Felicia FerroneDirector of Graduate Studies in Industrial Designfferrone@uic.edu",
        "Cheryl Towler WeeseDirector of Graduate Studies in Graphic Designcheryltw@uic.edu",
        "",
        "Master of DesignThe UIC School of Design prepares future leaders for the expanding field of design practice. From systems and services to objects and communications, we offer advanced designers an opportunity to further develop thier creative abilities in Chicago, one of the world’s most vibrant cities.",
        "YoungUIC is a young, progressive, and rapidly growing public research university. The Master of Design (MDes) program cultivates creative leaders with a global outlook. Students have taken part in academic and exhibition programs in Basel, Copenhagen, Dubai, Mexico City, and Seoul. Graduate students have access to the UIC Innovation Center, a collaboration and development hub that bridges academic research and real-world education with a range of industries; and the UIC Electronic Visualization Laboratory, an internationally renowned high-performance digital visualization center where design is integrated with virtual reality and other advanced technologies.",
        "AmbitiousThe UIC School of Design aims to advance the profession’s emerging and future directions. It enables graduates to make substantive contributions to the profession and the world by balancing deep disciplinary engagement with critical thinking — connecting a work’s meaning and purpose to global, cultural, political, technological and economic influences. A collegial, interdisciplinary community, the school offers a low student/teacher ratio and a large, intellectually engaged full-time faculty who provide individual attention and guidance. Awarded student work has been included in national and international exhibitions, publications and conferences, including Be Original America, DesignBoom, Dubai Design Week, Dutch Design Week, ICFF New York, and the Industrial Design Society of America.",
        "UrbanLocated in a true campus setting in the heart of Chicago, we take the city as an experimental laboratory for students and professionals alike. Internship opportunities are consistently obtained both on campus and in Chicago-based businesses, institutions, and studios. Recent graduates of our ID MDes program work regionally, nationally, and internationally as designers at Airbnb, Ford Motor Company, General Electric, Huawei, IBM Design, Lenovo, PepsiCo, and Target Corporation; while others teach at universities including Kent State University, the University of Michigan, the University of Cincinnati, Texas State University, Wayne State university, and the University of Notre Dame.",
        "Offering the MDes in Industrial Design and Graphic Design, the School of Design promotes discourse across design disciplines, and engages in critical conversations about design as both a disciplinary and cultural force. Recent seminar series lecturers include Charles Adler (Kickstarter), Danielle Aubert (Clanada), Clara Balaguer and Kristian Henson (The Office of Culture and Design, the Philippines), Andrew Blauvelt (Cranbrook Art Museum), Ezio Manzini (Politecnico di Milano), Tim Parsons and Jess Charlesworth (Parsons and Charlesworth), and Tereza and Vit Ruller (The Rodina, The Hague).",
        "Placing 7th in the US for “best value” in the Wall Street Journal and Times higher education rankings, making the cost of graduate education manageable is integral to UIC’s mission. Outstanding applicants are eligible for merit scholarships, and many students are able to obtain on-campus employment as designers during their graduate experience. A number of these positions are graduate or teaching assistantships, which fully cover the cost of tuition and some fees.",
        "UIC School of Design is ranked among the top 20 design schools in the world by Business Insider. The school’s diverse and highly productive faculty, a campus located in one of the world’s great cities, and UIC’s status as a globally-ranked public research university make the School of Design an excellent choice for graduate study.",
        "The UIC MDes in Graphic Design is delivered both in Chicago and in Basel, Switzerland, at FHNW HGK, home of the famed Basel School of Design.",
        "Prospective applicants for our special extended deadline are encouraged to email prior to applying.",
        ""
    ],
    "out_links": [
        "https://design.uic.edu/",
        "https://design.uic.edu/what-is-design",
        "https://design.uic.edu/why-uic",
        "https://design.uic.edu/student-work",
        "https://design.uic.edu/apply",
        "https://design.uic.edu/cada/news/newssearch/new",
        "https://design.uic.edu/custom/events/search/new",
        "https://design.uic.edu/partners/uic-innovation-center",
        "https://design.uic.edu/support",
        "https://design.uic.edu/about/directors-message",
        "https://design.uic.edu/about/mission",
        "https://design.uic.edu/about/advisory-board",
        "https://design.uic.edu/programs/bachelor-design",
        "https://design.uic.edu/programs/ba-design-studies",
        "https://design.uic.edu/programs/master-design",
        "https://design.uic.edu/people/faculty",
        "https://design.uic.edu/people/staff",
        "https://design.uic.edu/people/opportunities",
        "https://design.uic.edu/information/current-students",
        "https://design.uic.edu/information/facultystaff",
        "https://design.uic.edu/cada/news/newssearch/archive",
        "https://innovationcenter.uic.edu/",
        "https://design.uic.edu/newsdetails/688/681",
        "https://design.uic.edu/node/49",
        "http://www.uic.edu/uic/",
        "http://cada.uic.edu/"
    ]
}