{
    "url": "https://catalog.uic.edu/all-course-descriptions/mgmt/",
    "title": "Management (MGMT) < University of Illinois at Chicago",
    "text": [
        "MGMT 350.  Business and Its External Environment.  3 hours.",
        "",
        "Concerns the political, economic, social, legal, regulatory and international environment of business and the ethics and social responsibility of business actions. Course Information: Prerequisite(s): ENGL 161 and MATH 160.",
        "",
        "MGMT 445.  Organizational Theory.  3 hours.",
        "",
        "Emphasis on organizational theories and models to analyze and improve functioning and performance of organizations. Structure, technology, environmental adaptation, and managerial control systems. Course Information: Prerequisite(s): MGMT 340 and junior standing.",
        "",
        "MGMT 447.  Organizations.  3 or 4 hours.",
        "",
        "Characteristics of business, government, and not-for-profit organizations; approaches used to study organizations; theoretical and empirical analysis of organizational processes. Course Information: Same as SOC 447. 3 undergraduate hours. 4 graduate hours. Prerequisite(s): SOC 241 or MGMT 340 or SOC 244; and junior standing or above and an additional 200 or 300-level elective in sociology; or consent of the instructor.",
        "",
        "MGMT 452.  Organizational Behavior.  3 hours.",
        "",
        "Emphasis on understanding and managing people at work. Analysis of individual, group and organization topics including leadership, motivation, attitudes, group dynamics, and organizational culture. Course Information: Prerequisite(s): MGMT 340; or consent of the instructor.",
        "",
        "MGMT 453.  Human Resource Management.  3 hours.",
        "",
        "Examination of the activities involved in attracting, retaining, and motivating employees. Topics include planning, selection, compensation, performance appraisal, succession, and legal issues. Course Information: Prerequisite(s): MGMT 340; or consent of the instructor.",
        "",
        "MGMT 454.  Labor-Management Relations.  3 hours.",
        "",
        "Labor unions and their impact on business firms and society. Labor-management relationships and collective bargaining practices. Public policy, union structure and bargaining theory. Course Information: Prerequisite(s): MGMT 340 and MGMT 350 and junior standing.",
        "",
        "MGMT 455.  Talent Management and Global Human Resources.  3 hours.",
        "",
        "Examination of topics related to performance appraisal: motivating, retaining, and separating employees; compensation and benefits; managing human resources in a global economy. Prerequisite(s): MGMT 340 and credit or concurrent registration in MGMT 453.",
        "",
        "MGMT 460.  Managing Globally.  3 hours.",
        "",
        "Understanding the opportunities and problems that confront managers as they lead a company through complex global economic, political, legal, technological and cultural environment. Focus on people, values and culture. Course Information: Prerequisite(s): MGMT 340 and MGMT 350.",
        "",
        "MGMT 463.  Negotiation and Conflict Resolution.  3 hours.",
        "",
        "Strategies and techniques for successful agreement negotiation and business conflict resolution. Includes applications to classic situations such as collective bargaining, interpersonal relations, and stakeholder concerns. Course Information: Prerequisite(s): MGMT 340.",
        "",
        "MGMT 464.  Employment Recruitment and Selection.  3 hours.",
        "",
        "The design and application of internal and external recruitment, selection and retention systems for the effective management of human capital by line managers and HR professionals. Prerequisite(s): MGMT 452 and MGMT 453.",
        "",
        "MGMT 465.  Compensation and Reward Systems.  3 hours.",
        "",
        "Examination of compensation and reward systems designed to enhance employee motivation and performance. Topics include pay structure design, incentive systems, and benefits. Course Information: Prerequisite(s): MGMT 452 and MGMT 455; or consent of the instructor.",
        "",
        "MGMT 466.  Managerial Effectiveness Through Diversity.  3 hours.",
        "",
        "Management of diverse work forces. Discrimination, affirmative action, career development, socialization and social change policies; historical, psychological, sociological, legal and managerial viewpoints. Course Information: Prerequisite(s): MGMT 340.",
        "",
        "MGMT 467.  Impact of Technological Change.  3 hours.",
        "",
        "Examines the impact of technological change upon the business environment and the managerial process. Emphasis on alternative futures and the planning necessary to attain desired ends. Course Information: Prerequisite(s): MGMT 340 and MGMT 350.",
        "",
        "MGMT 470.  Training and Development.  3 hours.",
        "",
        "Examination of the science, methods, and practice of personnel training and development. Topics include needs determination, training design and delivery, training assessments. Course Information: Prerequisite(s): MGMT 452 and MGMT 453; or consent of the instructor. Recommended background: Experience as an intern or practitioner in an area of human resource management or organizational development.",
        "",
        "MGMT 471.  Organizational Design.  3 hours.",
        "",
        "Strategies for promoting the creativity, flexibility, and productivity of the organization and its management personnel. Readings and case studies from the public and private sectors. Course Information: Prerequisite(s): MGMT 340 and MGMT 452, or consent of the instructor.",
        "",
        "MGMT 475.  Leadership Theories and Personal Leadership Skills Development.  3 hours.",
        "",
        "Overview of leadership theories, assessment of leadership strengths and weaknesses, and leadership skills training. Course Information: Prerequisite(s): MGMT 340.",
        "",
        "MGMT 480.  Transportation Systems Management.  3 hours.",
        "",
        "Provides a fundamental knowledge of problems and practices encountered in the management of transportation systems. Includes impact of public policy; capital facilities; industry structure; costs; operations pricing and environmental relationships. Course Information: Prerequisite(s): MGMT 340 and MGMT 350, or consent of the instructor.",
        "",
        "MGMT 481.  Managerial Logistics.  3 hours.",
        "",
        "Management of activities governing flow of materials and products through stages of production and distribution. Includes design of logistical systems and use of mathematical techniques. Course Information: Prerequisite(s): MGMT 340; and MATH 165 or MATH 180; or consent of the instructor.",
        "",
        "MGMT 485.  Corporate Sustainability and Responsibility.  3 hours.",
        "",
        "Theories and techniques for designing and implementing corporate sustainability and responsibility programs to create private and social value. Course Information: Prerequisite(s): MGMT 340 and MGMT 350.",
        "",
        "MGMT 486.  Managerial Consulting.  3 hours.",
        "",
        "Development of knowledge and critical skills necessary to operate effectively as internal or external management consultants through an applied experience with an organization. Course Information: Field work required. Prerequisite(s): MGMT 452 and MGMT 453; or consent of the instructor.",
        "",
        "MGMT 494.  Special Topics in Management.  3 hours.",
        "",
        "Exploration of areas not covered in existing course offerings or study of selected topics in greater depth. Subject matter will vary from semester to semester. Course Information: May be repeated. Students may register in more than one section per term. Prerequisite(s): Senior standing and 9 hours of 400-level management courses, or consent of the instructor.",
        "",
        "MGMT 495.  Competitive Strategy.  4 hours.",
        "",
        "Multidisciplinary analysis of organization strategy and policy, using case method and/or business simulation. Assignments involve extensive library research and oral and written reports. Course Information: Prerequisite(s): IDS 355 and FIN 301 and FIN 302; Senior standing in the College of Business Administration and completion of all other CBA core courses.",
        "",
        "MGMT 499.  Research Experience.  1-3 hours.",
        "",
        "Research experience under the supervision of a faculty member.  The faculty member and student will determine the research project. Each student must submit a written report and each student must participate at a research event on campus. Course Information: May be repeated to a maximum of 6 hours. Students may register in more than one section per term. Prerequisite(s): Consent of the instructor.",
        "",
        "MGMT 530.  Family Business Management.  4 hours.",
        "",
        "Special issues facing family-owned and closely-held firms. Emphasis on behavioral, operational, and strategic issues, family dynamics, and interpersonal issues in professional settings; succession planning. Course Information: Prerequisite(s): Admission to the MBA Program. Recommended background: MGMT 502 or MKTG 502.",
        "",
        "MGMT 540.  Organizational Analysis and Practice.  4 hours.",
        "",
        "Organizational analysis and applications based on key organization theories; structure, technology, evironmental adaptation, management functions and controls, formal and informal organization. Course Information: Prerequisite(s): Admission to the MBA or M.S. in Accounting program.",
        "",
        "MGMT 541.  Organizational Behavior.  4 hours.",
        "",
        "The organization as a social system. Topics include leadership, interpersonal effectiveness, group behavior, managing change, conflict management, motivation and behavior, and interpersonal communications. Course Information: Credit is not given for MGMT 541 if the student has credit for MBA 505. Prerequisite(s): Graduate standing and admission to MBA, M.S. in Accounting or MS in Marketing program.",
        "",
        "MGMT 550.  Leading for Impact.  4 hours.",
        "",
        "Provides an understanding of how to lead organizations both internally and externally so as to maximize healthy organizational functioning and positive impact. Course Information: Prerequisite(s): MGMT 541.",
        "",
        "MGMT 553.  Human Resource Management.  4 hours.",
        "",
        "Human resource management programs and policies. Staffing, training and development; historical evolution of personnel policies, modern labor force and technological trends; supervision, salary administration, human resource research and utilization. Course Information: Prerequisite(s): MGMT 541 or consent of the instructor.",
        "",
        "MGMT 557.  International Management.  4 hours.",
        "",
        "Management practices and problems in major nations. Legal and cultural factors affecting managerial policies and decisions; organization planning and manpower utilization; comparative management systems and ideologies. Course Information: Prerequisite(s): MGMT 541.",
        "",
        "MGMT 564.  Negotiations.  4 hours.",
        "",
        "Strategies and techniques for successful agreement negotiation and business conflict resolution. Includes applications to classic situations such as collective bargaining, interpersonal relations, and stakeholder concerns. Course Information: Credit is not given for MGMT 564 if the student has credit for MGMT 594.  Special topics:  Negotiations.  Prerequisite(s): MGMT 541.",
        "",
        "MGMT 568.  Compensation Administration.  4 hours.",
        "",
        "Compensation theory policies and practices, including job analysis and evaluation, compensation surveys, wage and salary structures, merit and incentive compensation employee benefits and pension plans. Course Information: Prerequisite(s): MGMT 553.",
        "",
        "MGMT 570.  Social and Legal Environment of the Firm.  4 hours.",
        "",
        "Exploration of current ethical, social, political, technological, economic, and global issues as they relate to business and management in setting goals, making decisions, and creating policy. Course Information: Prerequisite(s): ECON 520.",
        "",
        "MGMT 573.  Research Methods in Organizational Behavior and Human Resource.  4 hours.",
        "",
        "Methodologies and industrial design appropriate for research in human resource and relations management, and organizational behavior. Students expected to complete a theoretically based research paper. Course Information: Prerequisite(s): Ph.D. student status or consent of instructor.",
        "",
        "MGMT 575.  Seminar: Topics in Personnel Practices and Relations.  4 hours.",
        "",
        "Relationships among work environment, compensation, unions and workers performance. Emphasis on legislation affecting employee selection, rewards, and the quality of work life. Course Information: Prerequisite(s): Ph.D. student status or consent of instructor.",
        "",
        "MGMT 576.  Behavioral Science Applications in Human Resource Management.  4 hours.",
        "",
        "Applies concepts, structures, theories and methods of organizational behavior to develop techniques useful for research and practice at the micro level of human resource management. Course Information: Prerequisite(s): Ph.D. student status or consent of the instructor.",
        "",
        "MGMT 579.  Contemporary American and International Management.  4 hours.",
        "",
        "Student teams evaluate case studies, present findings and recommendations for business strategies and research corporations of visiting executives, prepare presentations, and critique lectures.",
        "",
        "MGMT 581.  Administrative Structure and Organizational Design.  4 hours.",
        "",
        "An advanced exploration of theories of administrative structure and organizational design. Course topics include: conceptual models; macro, middle and micro level variables and principles and strategies of organizational change and development. Course Information: Prerequisite(s): MGMT 541.",
        "",
        "MGMT 582.  Global Innovation Management.  4 hours.",
        "",
        "Provides the student with a survey and case studies of successful innovations, their components, strategies and financial structure. Course Information: Same as IDS 542. Prerequisite(s): Graduate or professional standing; and consent of the instructor.",
        "",
        "MGMT 587.  Seminar: Topics in Organizational Behavior and Human Resources.  4 hours.",
        "",
        "Topics of current research interest in human resource systems and organizational behavior. Focuses on current issues in published literature and unpublished research. Course Information: Prerequisite(s): Ph.D. student status or consent of the instructor.",
        "",
        "MGMT 588.  Seminar: Topics in Strategic Management.  4 hours.",
        "",
        "Selected topics and current problems in organizational strategy. Research and field work in strategic planning. Application of theory and concepts to problems in strategic management. Course Information: Prerequisite(s):  Admission to the PhD in Business Administration Program.",
        "",
        "MGMT 589.  Seminar: Topics in Human Resource Management.  4 hours.",
        "",
        "Recent literature including parameters of the field, system designs and applications, information systems, and studies of work systems, quality of work life, productivity and career management. Course Information: Prerequisite(s): Ph.D. student status or consent of the instructor.",
        "",
        "MGMT 590.  Strategic Management.  4 hours.",
        "",
        "Study of strategies and policies that influence the long-term survival, growth, and character of business firms; strategy formulation and implementation in domestic and international organizations. Course Information: Prerequisite(s): Graduate standing and completion of all courses in the MBA core, or permission of the instructor.",
        "",
        "MGMT 591.  Research Apprenticeship.  2-4 hours.",
        "",
        "Directed training in conducting research in specific areas of management, and in developing skills related to the research. Course Information: Satisfactory/Unsatisfactory grading only. May be repeated. Prerequisite(s): Consent of the instructor.",
        "",
        "MGMT 594.  Special Topics in Management.  1-4 hours.",
        "",
        "An intensive study of a selected topic in management. Topics vary by section and by term. Course Information: May be repeated to a maximum of 12 hours if topics vary. Students may register in more than one section per term. Prerequisite(s): Consent of the instructor.",
        "",
        "MGMT 596.  Independent Study in Management.  1-4 hours.",
        "",
        "Independent study under direction of a faculty member. Course Information: May be repeated. Students may register in more than one section per term. Prerequisite(s): Consent of the head of the department.",
        "",
        "MGMT 599.  Ph.D. Thesis Research.  0-16 hours.",
        "",
        "Independent research on topic approved for the doctoral dissertation. Course Information: Satisfactory/Unsatisfactory grading only. May be repeated. Students may register in more than one section per term. Prerequisite(s): Consent of the instructor.",
        "",
        "Apply Online | Contact Admissions | Privacy Statement",
        "Having problems accessing this site? Contact the Webmaster.",
        "© 2018-2019 The Board of Trustees of the University of Illinois",
        "",
        "Print this page.",
        "",
        "The PDF will include all information unique to this page.",
        "",
        "All pages in the campus catalog.",
        ""
    ],
    "out_links": [
        "https://catalog.uic.edu/azindex/",
        "https://catalog.uic.edu/",
        "http://www.uic.edu/",
        "https://catalog.uic.edu/ucat/",
        "https://catalog.uic.edu/gcat",
        "https://catalog.uic.edu/gcat/",
        "https://catalog.uic.edu/all-course-descriptions/",
        "https://catalog.uic.edu/all-course-descriptions/asp/",
        "https://catalog.uic.edu/all-course-descriptions/actg/",
        "https://catalog.uic.edu/all-course-descriptions/aast/",
        "https://catalog.uic.edu/all-course-descriptions/anat/",
        "https://catalog.uic.edu/all-course-descriptions/anth/",
        "https://catalog.uic.edu/all-course-descriptions/ahs/",
        "https://catalog.uic.edu/all-course-descriptions/arab/",
        "https://catalog.uic.edu/all-course-descriptions/arst/",
        "https://catalog.uic.edu/all-course-descriptions/arch/",
        "https://catalog.uic.edu/all-course-descriptions/art/",
        "https://catalog.uic.edu/all-course-descriptions/ah/",
        "https://catalog.uic.edu/all-course-descriptions/bms/",
        "https://catalog.uic.edu/all-course-descriptions/bcmg/",
        "https://catalog.uic.edu/all-course-descriptions/bioe/",
        "https://catalog.uic.edu/all-course-descriptions/bios/",
        "https://catalog.uic.edu/all-course-descriptions/bvis/",
        "https://catalog.uic.edu/all-course-descriptions/bhis/",
        "https://catalog.uic.edu/all-course-descriptions/bps/",
        "https://catalog.uic.edu/all-course-descriptions/bstt/",
        "https://catalog.uic.edu/all-course-descriptions/ba/",
        "https://catalog.uic.edu/all-course-descriptions/cc/",
        "https://catalog.uic.edu/all-course-descriptions/cst/",
        "https://catalog.uic.edu/all-course-descriptions/cees/",
        "https://catalog.uic.edu/all-course-descriptions/che/",
        "https://catalog.uic.edu/all-course-descriptions/chem/",
        "https://catalog.uic.edu/all-course-descriptions/chin/",
        "https://catalog.uic.edu/all-course-descriptions/cd/",
        "https://catalog.uic.edu/all-course-descriptions/cme/",
        "https://catalog.uic.edu/all-course-descriptions/cl/",
        "https://catalog.uic.edu/all-course-descriptions/cler/",
        "https://catalog.uic.edu/all-course-descriptions/cele/",
        "https://catalog.uic.edu/all-course-descriptions/pele/",
        "https://catalog.uic.edu/all-course-descriptions/rele/",
        "https://catalog.uic.edu/all-course-descriptions/uele/",
        "https://catalog.uic.edu/all-course-descriptions/comm/",
        "https://catalog.uic.edu/all-course-descriptions/chsc/",
        "https://catalog.uic.edu/all-course-descriptions/cs/",
        "https://catalog.uic.edu/all-course-descriptions/clj/",
        "https://catalog.uic.edu/all-course-descriptions/ci/",
        "https://catalog.uic.edu/all-course-descriptions/dadm/",
        "https://catalog.uic.edu/all-course-descriptions/daob/",
        "https://catalog.uic.edu/all-course-descriptions/dbcs/",
        "https://catalog.uic.edu/all-course-descriptions/dcle/",
        "https://catalog.uic.edu/all-course-descriptions/dosi/",
        "https://catalog.uic.edu/all-course-descriptions/dost/",
        "https://catalog.uic.edu/all-course-descriptions/des/",
        "https://catalog.uic.edu/all-course-descriptions/dlg/",
        "https://catalog.uic.edu/all-course-descriptions/dhd/",
        "https://catalog.uic.edu/all-course-descriptions/mdc/",
        "https://catalog.uic.edu/all-course-descriptions/mdp/",
        "https://catalog.uic.edu/all-course-descriptions/mdr/",
        "https://catalog.uic.edu/all-course-descriptions/eaes/",
        "https://catalog.uic.edu/all-course-descriptions/econ/",
        "https://catalog.uic.edu/all-course-descriptions/ed/",
        "https://catalog.uic.edu/all-course-descriptions/edps/",
        "https://catalog.uic.edu/all-course-descriptions/epsy/",
        "https://catalog.uic.edu/all-course-descriptions/ece/",
        "https://catalog.uic.edu/all-course-descriptions/eb/",
        "https://catalog.uic.edu/all-course-descriptions/endo/",
        "https://catalog.uic.edu/all-course-descriptions/ener/",
        "https://catalog.uic.edu/all-course-descriptions/engr/",
        "https://catalog.uic.edu/all-course-descriptions/engl/",
        "https://catalog.uic.edu/all-course-descriptions/entr/",
        "https://catalog.uic.edu/all-course-descriptions/eohs/",
        "https://catalog.uic.edu/all-course-descriptions/epid/",
        "https://catalog.uic.edu/all-course-descriptions/epl/",
        "https://catalog.uic.edu/all-course-descriptions/fin/",
        "https://catalog.uic.edu/all-course-descriptions/fr/",
        "https://catalog.uic.edu/all-course-descriptions/gws/",
        "https://catalog.uic.edu/all-course-descriptions/geog/",
        "https://catalog.uic.edu/all-course-descriptions/ger/",
        "https://catalog.uic.edu/all-course-descriptions/glas/",
        "https://catalog.uic.edu/all-course-descriptions/gc/",
        "https://catalog.uic.edu/all-course-descriptions/gems/",
        "https://catalog.uic.edu/all-course-descriptions/gka/",
        "https://catalog.uic.edu/all-course-descriptions/gkm/",
        "https://catalog.uic.edu/all-course-descriptions/gamd/",
        "https://catalog.uic.edu/all-course-descriptions/him/",
        "https://catalog.uic.edu/all-course-descriptions/hpa/",
        "https://catalog.uic.edu/all-course-descriptions/hlp/",
        "https://catalog.uic.edu/all-course-descriptions/heb/",
        "https://catalog.uic.edu/all-course-descriptions/hnur/",
        "https://catalog.uic.edu/all-course-descriptions/hstl/",
        "https://catalog.uic.edu/all-course-descriptions/hist/",
        "https://catalog.uic.edu/all-course-descriptions/hon/",
        "https://catalog.uic.edu/all-course-descriptions/hn/",
        "https://catalog.uic.edu/all-course-descriptions/hum/",
        "https://catalog.uic.edu/all-course-descriptions/ie/",
        "https://catalog.uic.edu/all-course-descriptions/it/",
        "https://catalog.uic.edu/all-course-descriptions/ids/",
        "https://catalog.uic.edu/all-course-descriptions/iphs/",
        "https://catalog.uic.edu/all-course-descriptions/idea/",
        "https://catalog.uic.edu/all-course-descriptions/isa/",
        "https://catalog.uic.edu/all-course-descriptions/ip/",
        "https://catalog.uic.edu/all-course-descriptions/ibt/",
        "https://catalog.uic.edu/all-course-descriptions/inst/",
        "https://catalog.uic.edu/all-course-descriptions/ital/",
        "https://catalog.uic.edu/all-course-descriptions/jpn/",
        "https://catalog.uic.edu/all-course-descriptions/jst/",
        "https://catalog.uic.edu/all-course-descriptions/jd/",
        "https://catalog.uic.edu/all-course-descriptions/kn/",
        "https://catalog.uic.edu/all-course-descriptions/kor/",
        "https://catalog.uic.edu/all-course-descriptions/lat/",
        "https://catalog.uic.edu/all-course-descriptions/lals/",
        "https://catalog.uic.edu/all-course-descriptions/law/",
        "https://catalog.uic.edu/all-course-descriptions/lrsc/",
        "https://catalog.uic.edu/all-course-descriptions/las/",
        "https://catalog.uic.edu/all-course-descriptions/lib/",
        "https://catalog.uic.edu/all-course-descriptions/ling/",
        "https://catalog.uic.edu/all-course-descriptions/lcsl/",
        "https://catalog.uic.edu/all-course-descriptions/lith/",
        "https://catalog.uic.edu/all-course-descriptions/mktg/",
        "https://catalog.uic.edu/all-course-descriptions/mba/",
        "https://catalog.uic.edu/all-course-descriptions/meng/",
        "https://catalog.uic.edu/all-course-descriptions/mj/",
        "https://catalog.uic.edu/all-course-descriptions/mcs/",
        "https://catalog.uic.edu/all-course-descriptions/math/",
        "https://catalog.uic.edu/all-course-descriptions/mtht/",
        "https://catalog.uic.edu/all-course-descriptions/me/",
        "https://catalog.uic.edu/all-course-descriptions/mbt/",
        "https://catalog.uic.edu/all-course-descriptions/mhpe/",
        "https://catalog.uic.edu/all-course-descriptions/mhum/",
        "https://catalog.uic.edu/all-course-descriptions/mdch/",
        "https://catalog.uic.edu/all-course-descriptions/pmmp/",
        "https://catalog.uic.edu/all-course-descriptions/mim/",
        "https://catalog.uic.edu/all-course-descriptions/mils/",
        "https://catalog.uic.edu/all-course-descriptions/movi/",
        "https://catalog.uic.edu/all-course-descriptions/muse/",
        "https://catalog.uic.edu/all-course-descriptions/mus/",
        "https://catalog.uic.edu/all-course-descriptions/nast/",
        "https://catalog.uic.edu/all-course-descriptions/nats/",
        "https://catalog.uic.edu/all-course-descriptions/ns/",
        "https://catalog.uic.edu/all-course-descriptions/neus/",
        "https://catalog.uic.edu/all-course-descriptions/nurs/",
        "https://catalog.uic.edu/all-course-descriptions/nuel/",
        "https://catalog.uic.edu/all-course-descriptions/nupr/",
        "https://catalog.uic.edu/all-course-descriptions/nusp/",
        "https://catalog.uic.edu/all-course-descriptions/ot/",
        "https://catalog.uic.edu/all-course-descriptions/omds/",
        "https://catalog.uic.edu/all-course-descriptions/osci/",
        "https://catalog.uic.edu/all-course-descriptions/osur/",
        "https://catalog.uic.edu/all-course-descriptions/ortd/",
        "https://catalog.uic.edu/all-course-descriptions/path/",
        "https://catalog.uic.edu/all-course-descriptions/psl/",
        "https://catalog.uic.edu/all-course-descriptions/pedd/",
        "https://catalog.uic.edu/all-course-descriptions/peri/",
        "https://catalog.uic.edu/all-course-descriptions/pmpg/",
        "https://catalog.uic.edu/all-course-descriptions/pcol/",
        "https://catalog.uic.edu/all-course-descriptions/phar/",
        "https://catalog.uic.edu/all-course-descriptions/pmpr/",
        "https://catalog.uic.edu/all-course-descriptions/psop/",
        "https://catalog.uic.edu/all-course-descriptions/phil/",
        "https://catalog.uic.edu/all-course-descriptions/pt/",
        "https://catalog.uic.edu/all-course-descriptions/phys/",
        "https://catalog.uic.edu/all-course-descriptions/phyb/",
        "https://catalog.uic.edu/all-course-descriptions/pol/",
        "https://catalog.uic.edu/all-course-descriptions/pols/",
        "https://catalog.uic.edu/all-course-descriptions/port/",
        "https://catalog.uic.edu/all-course-descriptions/prcl/",
        "https://catalog.uic.edu/all-course-descriptions/ptl/",
        "https://catalog.uic.edu/all-course-descriptions/pros/",
        "https://catalog.uic.edu/all-course-descriptions/psch/",
        "https://catalog.uic.edu/all-course-descriptions/pa/",
        "https://catalog.uic.edu/all-course-descriptions/pubh/",
        "https://catalog.uic.edu/all-course-descriptions/ppol/",
        "https://catalog.uic.edu/all-course-descriptions/ppa/",
        "https://catalog.uic.edu/all-course-descriptions/re/",
        "https://catalog.uic.edu/all-course-descriptions/rels/",
        "https://catalog.uic.edu/all-course-descriptions/rest/",
        "https://catalog.uic.edu/all-course-descriptions/russ/",
        "https://catalog.uic.edu/all-course-descriptions/slav/",
        "https://catalog.uic.edu/all-course-descriptions/sj/",
        "https://catalog.uic.edu/all-course-descriptions/socw/",
        "https://catalog.uic.edu/all-course-descriptions/soc/",
        "https://catalog.uic.edu/all-course-descriptions/span/",
        "https://catalog.uic.edu/all-course-descriptions/sped/",
        "https://catalog.uic.edu/all-course-descriptions/spec/",
        "https://catalog.uic.edu/all-course-descriptions/stat/",
        "https://catalog.uic.edu/all-course-descriptions/sabr/",
        "https://catalog.uic.edu/all-course-descriptions/surg/",
        "https://catalog.uic.edu/all-course-descriptions/tx/",
        "https://catalog.uic.edu/all-course-descriptions/thtr/",
        "https://catalog.uic.edu/all-course-descriptions/tadr/",
        "https://catalog.uic.edu/all-course-descriptions/upp/",
        "https://catalog.uic.edu/all-course-descriptions/us/",
        "https://catalog.uic.edu/all-course-descriptions/upa/",
        "https://catalog.uic.edu/all-course-descriptions/usl/",
        "https://catalog.uic.edu/search/?P=ENGL+161",
        "https://catalog.uic.edu/search/?P=MATH+160",
        "https://catalog.uic.edu/search/?P=MGMT+340",
        "https://catalog.uic.edu/search/?P=SOC+447",
        "https://catalog.uic.edu/search/?P=SOC+241",
        "https://catalog.uic.edu/search/?P=SOC+244",
        "https://catalog.uic.edu/search/?P=MGMT+350",
        "https://catalog.uic.edu/search/?P=MGMT+453",
        "https://catalog.uic.edu/search/?P=MGMT+452",
        "https://catalog.uic.edu/search/?P=MGMT+455",
        "https://catalog.uic.edu/search/?P=MATH+165",
        "https://catalog.uic.edu/search/?P=MATH+180",
        "https://catalog.uic.edu/search/?P=IDS+355",
        "https://catalog.uic.edu/search/?P=FIN+301",
        "https://catalog.uic.edu/search/?P=FIN+302",
        "https://catalog.uic.edu/search/?P=MGMT+541",
        "https://catalog.uic.edu/search/?P=MGMT+564",
        "https://catalog.uic.edu/search/?P=MGMT+594",
        "https://catalog.uic.edu/search/?P=MGMT+553",
        "https://catalog.uic.edu/search/?P=ECON+520",
        "https://catalog.uic.edu/search/?P=IDS+542",
        "http://admissions.uic.edu/apply-now",
        "http://admissions.uic.edu/contact-admissions"
    ]
}