{
    "url": "https://catalog.uic.edu/all-course-descriptions/prcl/",
    "title": "Preclinical Medicine (PRCL) < University of Illinois at Chicago",
    "text": [
        "PRCL 602.  Pathology - Peoria.  4 hours.",
        "",
        "General pathology is the study of basic disease mechanisms. Systemic pathology is the study of how the basic disease mechanisms affect the major tissue and organ systems. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 603.  Medical Pharmacology I - Peoria.  3 hours.",
        "",
        "The basic pharmacology of the major drug categories is presented in this course as a foundation to therapeutic application in clinical settings. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 604.  Clinical Skills I - Peoria.  2 hours.",
        "",
        "Prepares the student for taking histories and physicals. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 605.  Psychiatry - Peoria.  3 hours.",
        "",
        "The student becomes familiar with the etiology, phenomenology and diagnosis of the major psychiatric disorders. The student also learns about behavioral medicine. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 606.  Neuromuscular - Peoria.  4 hours.",
        "",
        "The pathophysiology of neurological disease as well as an introduction to clinical neurological medicine and problem solving of patients with neurological diseases. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 607.  Independent Study - Peoria.  0-16 hours.",
        "",
        "Participating students meet with faculty advisors to plan a individual curriculum. Course Information: Prerequisite(s): Approval by the Dean's Office in the College of Medicine.",
        "",
        "PRCL 608.  Clinical Skills II - Peoria.  3 hours.",
        "",
        "Continues PRCL 604. The course prepares the student for taking histories and physicals. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 609.  Skeletal, Connective Tissue and Skin Diseases - Peoria.  2 hours.",
        "",
        "The normal development of the skeletal and connective tissue systems, emphasizing pathology, pathophysiology, relevant immunopathology and clinical correlations in arthritis and other rheumatic diseases. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 610.  Pulmonary - Peoria.  3 hours.",
        "",
        "The data-acquisition process for the respiratory organ system, correlating to anatomy, physiology and pathology. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 611.  Cardiovascular - Peoria.  3 hours.",
        "",
        "Provides an understanding of congenital heart disease, acquired heart disease and hypertension; relating patients to the basic pathological process. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 612.  Renal and Urinary - Peoria.  3 hours.",
        "",
        "Skills necessary to diagnose and treat maladies of renal and urinary systems are taught. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 613.  Hematopoietic and Reticuloendothelial - Peoria.  2 hours.",
        "",
        "Blood cells and hemostatic mechanisms; diseases of the blood, bloodforming organs and hemorrhagic and thrombic disorders. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 614.  Gastrointestinal - Peoria.  4 hours.",
        "",
        "The student becomes acquainted with the gross and histologic pathology as well as the physiological pathology of the gastrointestinal tract. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 615.  Endocrine and Reproductive - Peoria.  3 hours.",
        "",
        "An introduction to the various pathological states. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 616.  Infection and Immunity - Peoria.  3 hours.",
        "",
        "Emphasizes microbiology and immunology concepts and will be sequenced with the pathology and pathophysiology concepts in the second year of the Peoria MD Program. Course Information: Prerequisite(s): BMS 608; and completion of the first year of the Doctor of Medicine program.",
        "",
        "PRCL 617.  Medical Pharmacology II-Peoria.  4 hours.",
        "",
        "A continuation of PRCL 603 in which the basic pharmacology of the major drug categories is presented as a foundation to therapeutic application in clinical settings. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine Program.",
        "",
        "PRCL 618.  Human Disease 1a-Peoria.  4 hours.",
        "",
        "Prepares students to perform a comprehensive History and Physical, to identify topics relevant to community health such as legal and ethical issues and healthcare delivery, and to employ concepts related to clinical epidemiology. Course Information: Prerequisite(s): Enrollment in the Peoria Doctor of Medicine Program. Class Schedule Information: To be properly registered, students must enroll in one Lecture/Discussion and one Clinical Practice.",
        "",
        "PRCL 619.  Preclinical Student Portfolio - Peoria.  1 hour.",
        "",
        "Designed for medical students starting from entry in medical school until graduation to promote self-reflection about their experiences, concerns, cases seen, procedures completed and other medical school activities. Course Information: May be repeated to a maximum of 2 hours. Prerequisite(s): Enrollment in the Peoria Doctor of Medicine program.",
        "",
        "PRCL 620.  Pathology, Infection and Immunity-Peoria.  7 hours.",
        "",
        "Analyzes the disease processes affecting specific organs and anatomic systems, with additional emphasis on the pathogenesis, control and prevention of bacterial, fungal and viral infections. Course Information: Prerequisite(s):  Enrollment in the Peoria Doctor of Medicine program.",
        "",
        "PRCL 621.  Human Disease Ib-Peoria.  4 hours.",
        "",
        "Continuation of PRCL 618 and prepares students to perform a comprehensive History and Physical and to employ concepts related to clinical epidemiology. Course Information: Prerequisite(s): Enrollment in the Peoria Doctor of Medicine Program. Class Schedule Information: To be properly registered, students must enroll in one Lecture/Discussion and one Clinical Practice.",
        "",
        "PRCL 622.  Human Disease II - Peoria.  7 hours.",
        "",
        "Presents the pathophysiology of skeletal, connective tissue and skin diseases, neurologic diseases and psychiatric illnesses, emphasizing clinical presentations, epidemiology, and therapeutic management options. Course Information: 7 hours. Prerequisite(s): Enrollment in the Peoria Doctor of Medicine Program. Course Schedule Information: To be properly registered, students must enroll in one Lecture-Discussion and one Laboratory.",
        "",
        "PRCL 623.  Human Disease III - Peoria.  7 hours.",
        "",
        "Presents the pathophysiology of cardiovascular, respiratory and renal diseases, emphasizing clinical presentations, epidemiology, and therapeutic management options. Course Information: 7 hours. Prerequisite(s): Enrollment in the Peoria Doctor of Medicine Program. Course Schedule Information: To be properly registered, students must enroll in one Lecture-Discussion and one Laboratory.",
        "",
        "PRCL 624.  Preclinical Student Portfolio - Chicago.  1 hour.",
        "",
        "Designed for medical students starting from entry in medical school until graduation to promote self-reflection about their experiences, concerns, cases seen, procedures completed and other medical school activities. Course Information: May be repeated to a maximum of 2 hours. Prerequisite(s): Enrollment in the Chicago Doctor of Medicine program.",
        "",
        "PRCL 625.  Human Disease IV - Peoria.  8 hours.",
        "",
        "Presents the pathophysiology of diseases of the gastrointestinal, hematopoietic and reticuloendothelial, and endocrine and reproductive systems, emphasizing clinical presentations, epidemiology, and therapeutic management options. Course Information: 8 hours. Prerequisite(s): Enrollment in the Peoria Doctor of Medicine Program. Course Schedule Information: To be properly registered, students must enroll in one Lecture-Discussion and one Laboratory.",
        "",
        "PRCL 626.  General and Systemic Pathology I-Chicago.  5 hours.",
        "",
        "Analyzes the disease processes affecting specific organs and anatomic systems. Course Information: Prerequisite(s): Enrollment in the Chicago Doctor of Medicine program.",
        "",
        "PRCL 627.  Clinical Microbiology Immunology - Chicago.  4 hours.",
        "",
        "Students are introduced to the fundamental aspects of the pathogenesis, control and prevention of bacterial, fungal and viral infections in preparation for clinical experiences. Course Information: Prerequisite(s): BMS 662 and enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 628.  Medical Pharmacology I-Chicago.  3 hours.",
        "",
        "The basic pharmacology of the major drug categories is presented in this course as a foundation to therapeutic application in clinical settings. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 629.  Longitudinal Career Development Course.  0 hours.",
        "",
        "A longitudinal course from M1 to M4 years that will assist medical students in developing the knowledge and skills to make a thoughtful and successful specialty choice. Course Information: Extensive computer use required. Class Schedule Information: To be properly registered, students must enroll in one Clinical Practice, one Practice, and one Lecture-Discussion.",
        "",
        "PRCL 630.  Psychiatry-Chicago.  1 hour.",
        "",
        "Introduces students to the epidemiology, pathophysiology, phenomenology, etiological theories, diagnosis and treatment options of mental disorders. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 632.  Independent Study - Chicago.  0-16 hours.",
        "",
        "Participating students meet with faculty advisors to plan a individual curriculum. Course Information: Prerequisite(s): Approval by the Dean's Office in the College of Medicine.",
        "",
        "PRCL 633.  General and Systemic Pathology II-Chicago.  4 hours.",
        "",
        "Continuation of PRCL 626 in which students will analyze the disease processes affecting specific organs and anatomic systems. Course Information: Prerequisite(s): PRCL 626 and enrollment in the Chicago Doctor of Medicine program.",
        "",
        "PRCL 635.  Medical Pharmacology II-Chicago.  2 hours.",
        "",
        "Continuation of PRCL 628 in which the basic pharmacology of the major drug categories is presented as a foundation to therapeutic application in clinical settings.Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 641.  Clinical Pathophysiology I - Chicago.  4 hours.",
        "",
        "Focuses on the integration of the basic and clinical sciences to prepare students for clinical decision making. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 643.  Clinical Pathophysiology II - Chicago.  5 hours.",
        "",
        "Continuation of PRCL 641 and focuses on the integration of the basic and clinical sciences to prepare students for clinical decision making. Course Information: Prerequisite(s): PRCL 641 and enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 645.  Essentials of Clinical Med 3 - Chicago.  6 hours.",
        "",
        "Emphasizes skills necessary for working with patients throughout the life cycle, clinical problem solving, patient advocacy and education, interdisciplinary healthcare and health risk assessments. Course Information: 6 hours. Prerequisite(s): BMS 667. Course Schedule Information: To be properly registered, students must enroll in one Lecture and one Clinical Practice.",
        "",
        "PRCL 646.  Essentials of Clinical Med 4 - Chicago.  10 hours.",
        "",
        "Continuation of PRCL 645 which emphasizes skills necessary for working with patients throughout the life cycle, clinical problem solving, patient advocacy and education, interdisciplinary healthcare and health risk assessments. Course Information: 10 hours. Prerequisite(s): PRCL 645. Course Schedule Information: To be properly registered, students must enroll in one Lecture, one Laboratory-Discussion, and one Clinical Practice.",
        "",
        "PRCL 651.  General and Systemic Pathology I-Rockford.  6 hours.",
        "",
        "Analyzes the disease processes affecting specific organs and anatomic systems. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 652.  Medical Pharmacology I-Rockford.  4 hours.",
        "",
        "The basic pharmacology of the major drug categories is presented in this course as a foundation to therapeutic application in clinical settings. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 653.  Clinical Pathophysiology I-Rockford.  5 hours.",
        "",
        "Focuses on the integration of the basic and clinical sciences to prepare students for clinical decision making. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 654.  Essentials of Patient Care I - Rockford.  5 hours.",
        "",
        "A broad-based behavioral science course in which the social, psychological, legal, ethical and contextual factors that affect patients, physicians, and their relationship are examined. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 655.  Clinical Microbiology Immunology I - Rockford.  3 hours.",
        "",
        "Students are introduced to the fundamental aspects of the pathogenesis, control and prevention of bacterial, fungal and viral infections in preparation for clinical experiences. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 656.  Clinical Medical Skills I-Rockford.  2 hours.",
        "",
        "Basic vocabulary and examination techniques for each body system required to effectively perform a physical examination. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine progam.",
        "",
        "PRCL 657.  Independent Study - Rockford.  0-16 hours.",
        "",
        "Participating students meet with faculty advisors to plan an individual curriculum. Course Information: Prerequisite(s): Approval by the Dean's Office in the College of Medicine.",
        "",
        "PRCL 658.  General and Systemic Pathology II - Rockford.  4 hours.",
        "",
        "Continuation of PRCL 651,  in which students will analyze the disease processes affecting specific organs and anatomic systems. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 659.  Medical Pharmacology II - Rockford.  4 hours.",
        "",
        "Continuation of PRCL 652, in which the basic pharmacology of the major drug categories is presented as a foundation to therapeutic application in clinical settings. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 660.  Clinical Pathophysiology II-Rockford.  5 hours.",
        "",
        "Continuation of PRCL 653, focusing on the integration of the basic and clinical sciences to prepare students for clinical decision making. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 661.  Essentials of Patient Care II - Rockford.  3 hours.",
        "",
        "Continuation of PRCL 654, which is a broad-based behavioral science course in which the social, psychological, legal, ethical and contextual factors that affect patients, physicians, and their relationship are examined. Course Information: Prerequisite(s): PRCL 654.",
        "",
        "PRCL 662.  Clinical Microbiology and Immunology II - Rockford.  2 hours.",
        "",
        "Continuation of PRCL 655, in which students are introduced to the fundamental aspects of the pathogenesis, control and prevention of bacterial, fungal and viral infections in preparation for clinical experiences. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 663.  Clinical Medical Skills II - Rockford.  1 hour.",
        "",
        "Continuation of PRCL 656, in which students are presented with basic vocabulary and examination techniques for each body system required to effectively perform a physical examination. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 664.  Family Medicine Experience - Rockford.  2 hours.",
        "",
        "Beginning in the second year of the Doctor of Medicine program, each student is assigned a panel of patients for whom they will provide primary health care until graduation. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 665.  Foundations in Rural Family and Community Medicine II-Rockford.  1 hour.",
        "",
        "Continues rural community medicine and family medicine concepts. Course Information: May be repeated to a maximum of 2 hours. Prerequisite(s): BMS 621. Restricted to students admitted to the Rural Medical Education Program (RMED) at Rockford.",
        "",
        "PRCL 666.  Preclinical Student Portfolio -  Rockford.  1 hour.",
        "",
        "Designed for medical students starting from entry in medical school until graduation to promote self-reflection about their experiences, concerns, cases seen, procedures completed and other medical school activities. Course Information: May be repeated to a maximum of 2 hours. Prerequisite(s): Enrollment in the Rockford Doctor of Medicine program.",
        "",
        "PRCL 675.  Clinical Pathophysiology I - Urbana.  7 hours.",
        "",
        "Focuses on the integration of the basic and clinical sciences to prepare students for clinical decision making. Course Information:  Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 676.  Epidemiology - Urbana.  2 hours.",
        "",
        "Presents students with the tools to evaluate medical research studies and apply epidemiologic methodologies to population-based medicine in any given community. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 678.  Medical Pharmacology I - Urbana.  4 hours.",
        "",
        "Pharmacology of the major drug categories is presented in this course as a foundation to therapeutic application in clinical settings. Course Information: Prerequisite(s): Enrollment in the Urbana Doctor of Medicine program.",
        "",
        "PRCL 679.  Medical Scholars Program - Urbana/Champaign.  0-16 hours.",
        "",
        "Concurrent registration course for Urbana Medical Scholars Program students. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine Program and the Medical Scholars Program.",
        "",
        "PRCL 680.  Independent Study - Urbana/Champaign.  0-16 hours.",
        "",
        "Participating students meet with faculty advisors to plan an individual curriculum. Course Information: Prerequisite(s): Approval by the Dean's Office in the College of Medicine.",
        "",
        "PRCL 681.  Clinical Tutorials - Urbana.  6 hours.",
        "",
        "Emphasizes development of the basic knowledge, skills and attitudes required of medical professionals, as well as addresses many contexts affecting delivery of healthcare. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program. Class Schedule Information: To be properly registered, students must enroll ine one Clinical Practice and one Lecture-Discussion.",
        "",
        "PRCL 683.  Clinical Microbiology and Immunology - Urbana.  2 hours.",
        "",
        "Students are introduced to the fundamental aspects of the pathogenesis, control and prevention of bacterial, fungal and viral infections in preparation for clinical experiences. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 684.  Medical Imaging - Urbana.  1 hour.",
        "",
        "Provides students with a general knowledge of the technologies available to medical imaging and how they are used to provide anatomic and physiologic data in the normal and pathologic setting.  Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 685.  Clinical Pathophysiology III - Urbana.  7 hours.",
        "",
        "Continuation of PRCL 675, focusing on the integration of the basic and clinical sciences to prepare students for clinical decision making. Course Information: Prerequisite(s): Enrollment in the Urbana Doctor of Medicine program.",
        "",
        "PRCL 686.  History, Physical, Diagnosis - Urbana.  4 hours.",
        "",
        "Focuses on development of skills necessary in patient contact, from taking a history to generating a differential diagnosis. Course Information: 4 hours. Prerequisite(s): Enrollment in the Doctor of Medicine program. Course Schedule Information: To be properly registered, students must ernroll in one Lecture-Discussion and one Laboratory.",
        "",
        "PRCL 687.  Psychiatry - Urbana.  2 hours.",
        "",
        "Introduce students to the epidemiology, pathophysiology, phenomenology, etiological theories, diagnosis and treatment options of mental disorders. Course Information: Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 688.  General and Systemic Pathology I-Urbana.  5 hours.",
        "",
        "Students will analyze the disease processes affecting specific organs and anatomic systems. Course Information:  Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 689.  General and Systemic Pathology II-Urbana.  4 hours.",
        "",
        "Continuation of PRCL 688, in which students will analyze the disease processes affecting specific organs and anatomic systems. Course Information:  Prerequisite(s): Enrollment in the Doctor of Medicine program.",
        "",
        "PRCL 690.  Preclinical Student Portfolio - Urbana.  1 hour.",
        "",
        "Designed for medical students starting from entry in medical school until graduation to promote self-reflection about their experiences, concerns, cases seen, procedures completed and other medical school activities. Course Information: May be repeated to a maximum of 2 hours. Prerequisite(s): Enrollment in the Urbana Doctor of Medicine program.",
        "",
        "PRCL 691.  Medical Pharmacology II - Urbana.  4 hours.",
        "",
        "Continuation of PRCL 678, in which the basic pharmacology of the major drug categories is presented as a foundation to therapeutic application in clinical settings. Course Information: Prerequisite(s): Enrollment in the Urbana Doctor of Medicine program.",
        "",
        "Apply Online | Contact Admissions | Privacy Statement",
        "Having problems accessing this site? Contact the Webmaster.",
        "© 2018-2019 The Board of Trustees of the University of Illinois",
        "",
        "Print this page.",
        "",
        "The PDF will include all information unique to this page.",
        "",
        "All pages in the campus catalog.",
        ""
    ],
    "out_links": [
        "https://catalog.uic.edu/azindex/",
        "https://catalog.uic.edu/",
        "http://www.uic.edu/",
        "https://catalog.uic.edu/ucat/",
        "https://catalog.uic.edu/gcat",
        "https://catalog.uic.edu/gcat/",
        "https://catalog.uic.edu/all-course-descriptions/",
        "https://catalog.uic.edu/all-course-descriptions/asp/",
        "https://catalog.uic.edu/all-course-descriptions/actg/",
        "https://catalog.uic.edu/all-course-descriptions/aast/",
        "https://catalog.uic.edu/all-course-descriptions/anat/",
        "https://catalog.uic.edu/all-course-descriptions/anth/",
        "https://catalog.uic.edu/all-course-descriptions/ahs/",
        "https://catalog.uic.edu/all-course-descriptions/arab/",
        "https://catalog.uic.edu/all-course-descriptions/arst/",
        "https://catalog.uic.edu/all-course-descriptions/arch/",
        "https://catalog.uic.edu/all-course-descriptions/art/",
        "https://catalog.uic.edu/all-course-descriptions/ah/",
        "https://catalog.uic.edu/all-course-descriptions/bms/",
        "https://catalog.uic.edu/all-course-descriptions/bcmg/",
        "https://catalog.uic.edu/all-course-descriptions/bioe/",
        "https://catalog.uic.edu/all-course-descriptions/bios/",
        "https://catalog.uic.edu/all-course-descriptions/bvis/",
        "https://catalog.uic.edu/all-course-descriptions/bhis/",
        "https://catalog.uic.edu/all-course-descriptions/bps/",
        "https://catalog.uic.edu/all-course-descriptions/bstt/",
        "https://catalog.uic.edu/all-course-descriptions/ba/",
        "https://catalog.uic.edu/all-course-descriptions/cc/",
        "https://catalog.uic.edu/all-course-descriptions/cst/",
        "https://catalog.uic.edu/all-course-descriptions/cees/",
        "https://catalog.uic.edu/all-course-descriptions/che/",
        "https://catalog.uic.edu/all-course-descriptions/chem/",
        "https://catalog.uic.edu/all-course-descriptions/chin/",
        "https://catalog.uic.edu/all-course-descriptions/cd/",
        "https://catalog.uic.edu/all-course-descriptions/cme/",
        "https://catalog.uic.edu/all-course-descriptions/cl/",
        "https://catalog.uic.edu/all-course-descriptions/cler/",
        "https://catalog.uic.edu/all-course-descriptions/cele/",
        "https://catalog.uic.edu/all-course-descriptions/pele/",
        "https://catalog.uic.edu/all-course-descriptions/rele/",
        "https://catalog.uic.edu/all-course-descriptions/uele/",
        "https://catalog.uic.edu/all-course-descriptions/comm/",
        "https://catalog.uic.edu/all-course-descriptions/chsc/",
        "https://catalog.uic.edu/all-course-descriptions/cs/",
        "https://catalog.uic.edu/all-course-descriptions/clj/",
        "https://catalog.uic.edu/all-course-descriptions/ci/",
        "https://catalog.uic.edu/all-course-descriptions/dadm/",
        "https://catalog.uic.edu/all-course-descriptions/daob/",
        "https://catalog.uic.edu/all-course-descriptions/dbcs/",
        "https://catalog.uic.edu/all-course-descriptions/dcle/",
        "https://catalog.uic.edu/all-course-descriptions/dosi/",
        "https://catalog.uic.edu/all-course-descriptions/dost/",
        "https://catalog.uic.edu/all-course-descriptions/des/",
        "https://catalog.uic.edu/all-course-descriptions/dlg/",
        "https://catalog.uic.edu/all-course-descriptions/dhd/",
        "https://catalog.uic.edu/all-course-descriptions/mdc/",
        "https://catalog.uic.edu/all-course-descriptions/mdp/",
        "https://catalog.uic.edu/all-course-descriptions/mdr/",
        "https://catalog.uic.edu/all-course-descriptions/eaes/",
        "https://catalog.uic.edu/all-course-descriptions/econ/",
        "https://catalog.uic.edu/all-course-descriptions/ed/",
        "https://catalog.uic.edu/all-course-descriptions/edps/",
        "https://catalog.uic.edu/all-course-descriptions/epsy/",
        "https://catalog.uic.edu/all-course-descriptions/ece/",
        "https://catalog.uic.edu/all-course-descriptions/eb/",
        "https://catalog.uic.edu/all-course-descriptions/endo/",
        "https://catalog.uic.edu/all-course-descriptions/ener/",
        "https://catalog.uic.edu/all-course-descriptions/engr/",
        "https://catalog.uic.edu/all-course-descriptions/engl/",
        "https://catalog.uic.edu/all-course-descriptions/entr/",
        "https://catalog.uic.edu/all-course-descriptions/eohs/",
        "https://catalog.uic.edu/all-course-descriptions/epid/",
        "https://catalog.uic.edu/all-course-descriptions/epl/",
        "https://catalog.uic.edu/all-course-descriptions/fin/",
        "https://catalog.uic.edu/all-course-descriptions/fr/",
        "https://catalog.uic.edu/all-course-descriptions/gws/",
        "https://catalog.uic.edu/all-course-descriptions/geog/",
        "https://catalog.uic.edu/all-course-descriptions/ger/",
        "https://catalog.uic.edu/all-course-descriptions/glas/",
        "https://catalog.uic.edu/all-course-descriptions/gc/",
        "https://catalog.uic.edu/all-course-descriptions/gems/",
        "https://catalog.uic.edu/all-course-descriptions/gka/",
        "https://catalog.uic.edu/all-course-descriptions/gkm/",
        "https://catalog.uic.edu/all-course-descriptions/gamd/",
        "https://catalog.uic.edu/all-course-descriptions/him/",
        "https://catalog.uic.edu/all-course-descriptions/hpa/",
        "https://catalog.uic.edu/all-course-descriptions/hlp/",
        "https://catalog.uic.edu/all-course-descriptions/heb/",
        "https://catalog.uic.edu/all-course-descriptions/hnur/",
        "https://catalog.uic.edu/all-course-descriptions/hstl/",
        "https://catalog.uic.edu/all-course-descriptions/hist/",
        "https://catalog.uic.edu/all-course-descriptions/hon/",
        "https://catalog.uic.edu/all-course-descriptions/hn/",
        "https://catalog.uic.edu/all-course-descriptions/hum/",
        "https://catalog.uic.edu/all-course-descriptions/ie/",
        "https://catalog.uic.edu/all-course-descriptions/it/",
        "https://catalog.uic.edu/all-course-descriptions/ids/",
        "https://catalog.uic.edu/all-course-descriptions/iphs/",
        "https://catalog.uic.edu/all-course-descriptions/idea/",
        "https://catalog.uic.edu/all-course-descriptions/isa/",
        "https://catalog.uic.edu/all-course-descriptions/ip/",
        "https://catalog.uic.edu/all-course-descriptions/ibt/",
        "https://catalog.uic.edu/all-course-descriptions/inst/",
        "https://catalog.uic.edu/all-course-descriptions/ital/",
        "https://catalog.uic.edu/all-course-descriptions/jpn/",
        "https://catalog.uic.edu/all-course-descriptions/jst/",
        "https://catalog.uic.edu/all-course-descriptions/jd/",
        "https://catalog.uic.edu/all-course-descriptions/kn/",
        "https://catalog.uic.edu/all-course-descriptions/kor/",
        "https://catalog.uic.edu/all-course-descriptions/lat/",
        "https://catalog.uic.edu/all-course-descriptions/lals/",
        "https://catalog.uic.edu/all-course-descriptions/law/",
        "https://catalog.uic.edu/all-course-descriptions/lrsc/",
        "https://catalog.uic.edu/all-course-descriptions/las/",
        "https://catalog.uic.edu/all-course-descriptions/lib/",
        "https://catalog.uic.edu/all-course-descriptions/ling/",
        "https://catalog.uic.edu/all-course-descriptions/lcsl/",
        "https://catalog.uic.edu/all-course-descriptions/lith/",
        "https://catalog.uic.edu/all-course-descriptions/mgmt/",
        "https://catalog.uic.edu/all-course-descriptions/mktg/",
        "https://catalog.uic.edu/all-course-descriptions/mba/",
        "https://catalog.uic.edu/all-course-descriptions/meng/",
        "https://catalog.uic.edu/all-course-descriptions/mj/",
        "https://catalog.uic.edu/all-course-descriptions/mcs/",
        "https://catalog.uic.edu/all-course-descriptions/math/",
        "https://catalog.uic.edu/all-course-descriptions/mtht/",
        "https://catalog.uic.edu/all-course-descriptions/me/",
        "https://catalog.uic.edu/all-course-descriptions/mbt/",
        "https://catalog.uic.edu/all-course-descriptions/mhpe/",
        "https://catalog.uic.edu/all-course-descriptions/mhum/",
        "https://catalog.uic.edu/all-course-descriptions/mdch/",
        "https://catalog.uic.edu/all-course-descriptions/pmmp/",
        "https://catalog.uic.edu/all-course-descriptions/mim/",
        "https://catalog.uic.edu/all-course-descriptions/mils/",
        "https://catalog.uic.edu/all-course-descriptions/movi/",
        "https://catalog.uic.edu/all-course-descriptions/muse/",
        "https://catalog.uic.edu/all-course-descriptions/mus/",
        "https://catalog.uic.edu/all-course-descriptions/nast/",
        "https://catalog.uic.edu/all-course-descriptions/nats/",
        "https://catalog.uic.edu/all-course-descriptions/ns/",
        "https://catalog.uic.edu/all-course-descriptions/neus/",
        "https://catalog.uic.edu/all-course-descriptions/nurs/",
        "https://catalog.uic.edu/all-course-descriptions/nuel/",
        "https://catalog.uic.edu/all-course-descriptions/nupr/",
        "https://catalog.uic.edu/all-course-descriptions/nusp/",
        "https://catalog.uic.edu/all-course-descriptions/ot/",
        "https://catalog.uic.edu/all-course-descriptions/omds/",
        "https://catalog.uic.edu/all-course-descriptions/osci/",
        "https://catalog.uic.edu/all-course-descriptions/osur/",
        "https://catalog.uic.edu/all-course-descriptions/ortd/",
        "https://catalog.uic.edu/all-course-descriptions/path/",
        "https://catalog.uic.edu/all-course-descriptions/psl/",
        "https://catalog.uic.edu/all-course-descriptions/pedd/",
        "https://catalog.uic.edu/all-course-descriptions/peri/",
        "https://catalog.uic.edu/all-course-descriptions/pmpg/",
        "https://catalog.uic.edu/all-course-descriptions/pcol/",
        "https://catalog.uic.edu/all-course-descriptions/phar/",
        "https://catalog.uic.edu/all-course-descriptions/pmpr/",
        "https://catalog.uic.edu/all-course-descriptions/psop/",
        "https://catalog.uic.edu/all-course-descriptions/phil/",
        "https://catalog.uic.edu/all-course-descriptions/pt/",
        "https://catalog.uic.edu/all-course-descriptions/phys/",
        "https://catalog.uic.edu/all-course-descriptions/phyb/",
        "https://catalog.uic.edu/all-course-descriptions/pol/",
        "https://catalog.uic.edu/all-course-descriptions/pols/",
        "https://catalog.uic.edu/all-course-descriptions/port/",
        "https://catalog.uic.edu/all-course-descriptions/ptl/",
        "https://catalog.uic.edu/all-course-descriptions/pros/",
        "https://catalog.uic.edu/all-course-descriptions/psch/",
        "https://catalog.uic.edu/all-course-descriptions/pa/",
        "https://catalog.uic.edu/all-course-descriptions/pubh/",
        "https://catalog.uic.edu/all-course-descriptions/ppol/",
        "https://catalog.uic.edu/all-course-descriptions/ppa/",
        "https://catalog.uic.edu/all-course-descriptions/re/",
        "https://catalog.uic.edu/all-course-descriptions/rels/",
        "https://catalog.uic.edu/all-course-descriptions/rest/",
        "https://catalog.uic.edu/all-course-descriptions/russ/",
        "https://catalog.uic.edu/all-course-descriptions/slav/",
        "https://catalog.uic.edu/all-course-descriptions/sj/",
        "https://catalog.uic.edu/all-course-descriptions/socw/",
        "https://catalog.uic.edu/all-course-descriptions/soc/",
        "https://catalog.uic.edu/all-course-descriptions/span/",
        "https://catalog.uic.edu/all-course-descriptions/sped/",
        "https://catalog.uic.edu/all-course-descriptions/spec/",
        "https://catalog.uic.edu/all-course-descriptions/stat/",
        "https://catalog.uic.edu/all-course-descriptions/sabr/",
        "https://catalog.uic.edu/all-course-descriptions/surg/",
        "https://catalog.uic.edu/all-course-descriptions/tx/",
        "https://catalog.uic.edu/all-course-descriptions/thtr/",
        "https://catalog.uic.edu/all-course-descriptions/tadr/",
        "https://catalog.uic.edu/all-course-descriptions/upp/",
        "https://catalog.uic.edu/all-course-descriptions/us/",
        "https://catalog.uic.edu/all-course-descriptions/upa/",
        "https://catalog.uic.edu/all-course-descriptions/usl/",
        "https://catalog.uic.edu/search/?P=PRCL+604",
        "https://catalog.uic.edu/search/?P=BMS+608",
        "https://catalog.uic.edu/search/?P=PRCL+603",
        "https://catalog.uic.edu/search/?P=PRCL+618",
        "https://catalog.uic.edu/search/?P=BMS+662",
        "https://catalog.uic.edu/search/?P=PRCL+626",
        "https://catalog.uic.edu/search/?P=PRCL+628",
        "https://catalog.uic.edu/search/?P=PRCL+641",
        "https://catalog.uic.edu/search/?P=BMS+667",
        "https://catalog.uic.edu/search/?P=PRCL+645",
        "https://catalog.uic.edu/search/?P=PRCL+651",
        "https://catalog.uic.edu/search/?P=PRCL+652",
        "https://catalog.uic.edu/search/?P=PRCL+653",
        "https://catalog.uic.edu/search/?P=PRCL+654",
        "https://catalog.uic.edu/search/?P=PRCL+655",
        "https://catalog.uic.edu/search/?P=PRCL+656",
        "https://catalog.uic.edu/search/?P=BMS+621",
        "https://catalog.uic.edu/search/?P=PRCL+675",
        "https://catalog.uic.edu/search/?P=PRCL+688",
        "https://catalog.uic.edu/search/?P=PRCL+678",
        "http://admissions.uic.edu/apply-now",
        "http://admissions.uic.edu/contact-admissions"
    ]
}