{
    "url": "https://catalog.uic.edu/all-course-descriptions/stat/",
    "title": "Statistics (STAT) < University of Illinois at Chicago",
    "text": [
        "STAT 130.  Introduction to Statistics for the Life Sciences.  4 hours.",
        "",
        "Basic concepts and methods of statistics with illustrations from different areas of the life sciences; graphical and summary representations, probability, random variables, normal distribution, estimation and tests of hypotheses, t, F and chi-square. Course Information: Credit is not given for STAT 130 if the student has credit for STAT 101. Extensive computer use required. Prerequisite(s): Grade of C or better in MATH 110; or appropriate score on the department placement test. Class Schedule Information: To be properly registered, students must enroll in one Lecture and one Laboratory-Discussion.",
        "",
        "STAT 361.  Elements of Statistical Methods.  2 hours.",
        "",
        "Graphical and numerical summaries of data, statistical software package use; introduction to probability, random variables, and sampling distributions; point estimation, confidence intervals, and test of hypotheses. Course Information: Prerequisite(s): Grade of C or better in MATH 181.",
        "",
        "STAT 362.  Elements of Statistical Computing.  2 hours.",
        "",
        "Statistical computation with the SAS and R software packages; data structure, entry, and manipulation; numerical and graphical summaries; basic statistical methods. Course Information: Prerequisite(s): Grade of C or better in STAT 361; or Grade of C or better in IE 342; or Grade of C or better in STAT 381.",
        "",
        "STAT 381.  Applied Statistical Methods I.  3 hours.",
        "",
        "Graphical and tabular representation of data; Introduction to probability, random variables, sampling distributions, estimation, confidence intervals, and tests of hypotheses. Includes SAS and SPSSX applications. Course Information: Prerequisite(s): Grade of C or better in MATH 181.",
        "",
        "STAT 382.  Statistical Methods and Computing.  3 hours.",
        "",
        "Statistical computation with the SAS and R software packages: data structure, entry, and manipulation; numerical and graphical summaries; basic statistical methods; select advanced methods. Course Information: Prerequisite(s): STAT 381.",
        "",
        "STAT 385.  Elementary Statistical Techniques for Machine Learning and Big Data.  3 hours.",
        "",
        "Sampling algorithms; nonparametric tests; data mining: classification, clustering, LASSO, cross-validation, Principle Component Regression; and big data analysis focus on R-package. Course Information: Extensive computer use required. Prerequisite(s): STAT 382 or consent of the instructor.",
        "",
        "STAT 401.  Introduction to Probability.  3 or 4 hours.",
        "",
        "Probability spaces, random variables and their distributions, conditional distribution and stochastic independence, special distributions, sampling distributions, limit theorems. Course Information: 3 undergraduate hours. 4 graduate hours. Prerequisite(s): Grade of C or better in MATH 210; or approval of the department.",
        "",
        "STAT 411.  Statistical Theory.  3 or 4 hours.",
        "",
        "Estimation, tests of statistical hypotheses, best tests, sufficient statistics, Rao-Cramer inequality, sequential probability ratio tests, the multivariate normal distribution, nonparametric methods. Course Information: 3 undergraduate hours. 4 graduate hours. Prerequisite(s): Grade of C or better in STAT 401.",
        "",
        "STAT 416.  Nonparametric Statistical Methods.  3 or 4 hours.",
        "",
        "Distribution free tests for location and dispersion problems, one-way and two-way layouts, the independence problem, regression problems involving slopes, detecting broad alternatives, resampling methods. Course Information: 3 undergraduate hours. 4 graduate hours. Prerequisite(s): Grade of C or better in STAT 381 or STAT 411.",
        "",
        "STAT 431.  Introduction to Survey Sampling.  3 or 4 hours.",
        "",
        "Simple random sampling; sampling proportions; estimation of sample size; stratified random sampling; ratio estimators; regression estimators; systematic and cluster sampling. Course Information: 3 undergraduate hours. 4 graduate hours. Prerequisite(s): Grade of C or better in STAT 411 or STAT 481.",
        "",
        "STAT 451.  Computational Statistics.  3 or 4 hours.",
        "",
        "Modern computationally-intensive statistical methods including Monte Carlo integration and simulation, optimization and maximum likelihood estimation, EM algorithm, MCMC, sampling and resampling methods, non-parametric density estimation. Course Information: 3 undergraduate hours. 4 graduate hours. Extensive computer use required. Prerequisite(s): STAT 411.",
        "",
        "STAT 461.  Applied Probability Models I.  3 or 4 hours.",
        "",
        "Computing probabilities and expectations by conditioning, Markov chains, Chapman-Kolmogorov equations, branching processes, Poisson processes and exponential distribution, continuous-time Markov chains, reversibility, uniformization. Course Information: 3 undergraduate hours. 4 graduate hours. Prerequisite(s): Grade of C or better in STAT 401.",
        "",
        "STAT 471.  Linear and Non-Linear Programming.  3 or 4 hours.",
        "",
        "Linear programming, simplex algorithm, degeneracy, duality theorem sensitivity analysis, convexity, network simplex methods, assignment problems. Constrained and unconstrained minima. Quasi-Newton methods. Ellipsoidal methods of Kachian. Course Information: 3 undergraduate hours. 4 graduate hours. Prerequisite(s): Grade of C or better in MATH 310.",
        "",
        "STAT 473.  Game Theory.  3 or 4 hours.",
        "",
        "Introduction to the basic ideas of game theory. Static and dynamic games; mixed strategies, imperfect information; economic, political and biological applications. Course Information: Same as ECON 473. 3 undergraduate hours. 4 graduate hours. Prerequisite(s): STAT 381; or ECON 270; or equivalents.",
        "",
        "STAT 475.  Mathematics and Statistics for Actuarial Sciences I.  3 or 4 hours.",
        "",
        "Financial mathematics as it pertains to the valuation of deterministic cash flows. Basic concepts and techniques regarding the theory of interest. Course Information: 3 undergraduate hours. 4 graduate hours. Prerequisite(s): MATH 210.",
        "",
        "STAT 481.  Applied Statistical Methods II.  3 or 4 hours.",
        "",
        "Linear regression, introduction to model building, analysis of variance, analysis of enumerative data, nonparametric statistics, product and system reliability, quality control. SAS and SPSSX applications. Course Information: 3 undergraduate hours. 4 graduate hours. Prerequisite(s): Grade of C or better in STAT 381.",
        "",
        "STAT 486.  Statistical Consulting.  3 or 4 hours.",
        "",
        "Introduction to statistical consulting methods and techniques. Handling and transformation of raw data sets in CMS. Statistical analysis of data sets with SAS and SPSSX. Course Information: 3 undergraduate hours. 4 graduate hours. Prerequisite(s): Grade of C or better in STAT 411 or STAT 481.",
        "",
        "STAT 494.  Special Topics in Statistics, Probability and Operations Research.  3 or 4 hours.",
        "",
        "Course content announced prior to each semester in which it is given. Topics drawn from areas such as distribution theory; Bayesian inference; discrete optimization; applied probability models; resampling techniques; biostatistics; environmental sampling. Course Information: 3 undergraduate hours. 4 graduate hours. May be repeated. Students may register in more than one section per term. Prerequisite(s): Approval of the department.",
        "",
        "STAT 496.  Independent Study.  1-4 hours.",
        "",
        "Reading course supervised by a faculty member. Course Information: May be repeated. Students may register in more than one section per term. Prerequisite(s): Approval of the instructor and approval of the department.",
        "",
        "STAT 501.  Probability Theory I.  4 hours.",
        "",
        "Abstract measure theory, probability measures, Kolmogorov extension theorem, sums of independent random variables, the strong and weak laws of large numbers, the central limit theorem, characteristic functions, law of iterated logarithm, infinitely divisible laws. Course Information: Prerequisite(s): MATH 534 or consent of the instructor.",
        "",
        "STAT 502.  Probability Theory II.  4 hours.",
        "",
        "Radon-Nikodym theorem, conditional expectations, martingales, stationary processes, ergodic theorem, stationary Gaussian processes, Markov chains, introduction to stochastic processes, Brownian motions. Course Information: Prerequisite(s): STAT 501.",
        "",
        "STAT 511.  Advanced Statistical Theory I.  4 hours.",
        "",
        "Statistical models, criteria of optimum estimation, large sample theory, optimum tests and confidence intervals, best unbiased tests in exponential families, invariance principle, likelihood ratio tests. Course Information: Prerequisite(s): STAT 411.",
        "",
        "STAT 512.  Advanced Statistical Theory II.  4 hours.",
        "",
        "Basic concepts in decision theory, prior and posterior distributions, Bayesian decision theory, hierarchical models, robustness, minimax analysis, invariance principle, sequential analysis, completeness. Course Information: Prerequisite(s): STAT 511.",
        "",
        "STAT 521.  Linear Statistical Inference.  4 hours.",
        "",
        "Estimation and testing in linear models, generalized inverses of matrices, n-dimensional normal distribution, quadratic forms, likelihood ratio tests, best invariant tests, analysis of variance. Course Information: Prerequisite(s): STAT 411.",
        "",
        "STAT 522.  Multivariate Statistical Analysis.  4 hours.",
        "",
        "Multivariate normal distribution, estimation of mean vector and covariance matrix, T-square statistic, discriminant analysis, general linear hypothesis, principal components, canonical correlations, factor analysis. Course Information: Prerequisite(s): STAT 521.",
        "",
        "STAT 531.  Sampling Theory I.  4 hours.",
        "",
        "Foundations of survey design and inference for finite populations;the Horvitz-Thompson estimator;simple random, cluster,systematic survey designs;auxiliary size measures in design and inference. Course Information: Prerequisite(s): STAT 411.",
        "",
        "STAT 532.  Sampling Theory II.  4 hours.",
        "",
        "Uses of auxiliary size measures in survey sampling; cluster sampling; systematic sampling; stratified sampling; superpopulation methods; randomized response methods; resampling; nonresponse; small area estimations. Course Information: Prerequisite(s): STAT 531.",
        "",
        "STAT 535.  Optimal Design Theory I.  4 hours.",
        "",
        "Gauss-Markov theorem,optimality criteria, optimal designs for 1-way, 2-way elimination of heterogeneity models,repeated measurements, treatment-control ; Equivalence theorem,approximate designs for polynomial regression. Course Information: Prerequisite(s): STAT 521.",
        "",
        "STAT 536.  Optimal Design Theory II.  4 hours.",
        "",
        "Construction of optimal designs: BIB , Latin square and generalized Youden , repeated measurements , treatment-control studies; construction of factorial designs including orthogonal arrays Course Information: Prerequisite(s): STAT 535 or consent of the instructor.",
        "",
        "STAT 591.  Advanced Topics in Statistics, Probability and Operations Research.  4 hours.",
        "",
        "Special topics. Topics drawn from areas such as: Data analysis; Bayesion inference; Nonlinear models; Time series; Computer aided design; reliability models; game theory. Course Information: May be repeated. Prerequisite(s): Approval of the department.",
        "",
        "STAT 593.  Graduate Student Seminar.  1 hour.",
        "",
        "For graduate students who wish to receive credit for participating in a learning seminar whose weekly time commitment is not sufficient for a reading course. This seminar must be sponsored by a faculty member. Course Information: Satisfactory/Unsatisfactory grading only. May be repeated. Students may register in more than one section per term. Prerequisite(s): Approval of the department.",
        "",
        "STAT 595.  Research Seminar.  1 hour.",
        "",
        "Current developments in research with presentations by faculty, students, and visitors. Researchers and practitioners from academia, industry and government will present talks on topics of current interest. Course Information: Satisfactory/Unsatisfactory grading only. May be repeated. Students may register in more than one section per term. Prerequisite(s): Approval of the department.",
        "",
        "STAT 596.  Independent Study.  1-4 hours.",
        "",
        "Reading course supervised by a faculty member. Course Information: May be repeated. Students may register in more than one section per term. Prerequisite(s): Approval of the instructor and the department.",
        "",
        "STAT 598.  Master's Thesis.  0-16 hours.",
        "",
        "Research work under the supervision of a faculty member leading to the completion of a master's thesis. Course Information: Satisfactory/Unsatisfactory grading only. Prerequisite(s): Approval of the department.",
        "",
        "STAT 599.  Doctoral Thesis Research.  0-16 hours.",
        "",
        "Research work under the supervision of a faculty member leading to the completion of a doctoral thesis. Course Information: Satisfactory/Unsatisfactory grading only. May be repeated. Students may register in more than one section per term. Prerequisite(s): Approval of the department.",
        "",
        "Apply Online | Contact Admissions | Privacy Statement",
        "Having problems accessing this site? Contact the Webmaster.",
        "© 2018-2019 The Board of Trustees of the University of Illinois",
        "",
        "Print this page.",
        "",
        "The PDF will include all information unique to this page.",
        "",
        "All pages in the campus catalog.",
        ""
    ],
    "out_links": [
        "https://catalog.uic.edu/azindex/",
        "https://catalog.uic.edu/",
        "http://www.uic.edu/",
        "https://catalog.uic.edu/ucat/",
        "https://catalog.uic.edu/gcat",
        "https://catalog.uic.edu/gcat/",
        "https://catalog.uic.edu/all-course-descriptions/",
        "https://catalog.uic.edu/all-course-descriptions/asp/",
        "https://catalog.uic.edu/all-course-descriptions/actg/",
        "https://catalog.uic.edu/all-course-descriptions/aast/",
        "https://catalog.uic.edu/all-course-descriptions/anat/",
        "https://catalog.uic.edu/all-course-descriptions/anth/",
        "https://catalog.uic.edu/all-course-descriptions/ahs/",
        "https://catalog.uic.edu/all-course-descriptions/arab/",
        "https://catalog.uic.edu/all-course-descriptions/arst/",
        "https://catalog.uic.edu/all-course-descriptions/arch/",
        "https://catalog.uic.edu/all-course-descriptions/art/",
        "https://catalog.uic.edu/all-course-descriptions/ah/",
        "https://catalog.uic.edu/all-course-descriptions/bms/",
        "https://catalog.uic.edu/all-course-descriptions/bcmg/",
        "https://catalog.uic.edu/all-course-descriptions/bioe/",
        "https://catalog.uic.edu/all-course-descriptions/bios/",
        "https://catalog.uic.edu/all-course-descriptions/bvis/",
        "https://catalog.uic.edu/all-course-descriptions/bhis/",
        "https://catalog.uic.edu/all-course-descriptions/bps/",
        "https://catalog.uic.edu/all-course-descriptions/bstt/",
        "https://catalog.uic.edu/all-course-descriptions/ba/",
        "https://catalog.uic.edu/all-course-descriptions/cc/",
        "https://catalog.uic.edu/all-course-descriptions/cst/",
        "https://catalog.uic.edu/all-course-descriptions/cees/",
        "https://catalog.uic.edu/all-course-descriptions/che/",
        "https://catalog.uic.edu/all-course-descriptions/chem/",
        "https://catalog.uic.edu/all-course-descriptions/chin/",
        "https://catalog.uic.edu/all-course-descriptions/cd/",
        "https://catalog.uic.edu/all-course-descriptions/cme/",
        "https://catalog.uic.edu/all-course-descriptions/cl/",
        "https://catalog.uic.edu/all-course-descriptions/cler/",
        "https://catalog.uic.edu/all-course-descriptions/cele/",
        "https://catalog.uic.edu/all-course-descriptions/pele/",
        "https://catalog.uic.edu/all-course-descriptions/rele/",
        "https://catalog.uic.edu/all-course-descriptions/uele/",
        "https://catalog.uic.edu/all-course-descriptions/comm/",
        "https://catalog.uic.edu/all-course-descriptions/chsc/",
        "https://catalog.uic.edu/all-course-descriptions/cs/",
        "https://catalog.uic.edu/all-course-descriptions/clj/",
        "https://catalog.uic.edu/all-course-descriptions/ci/",
        "https://catalog.uic.edu/all-course-descriptions/dadm/",
        "https://catalog.uic.edu/all-course-descriptions/daob/",
        "https://catalog.uic.edu/all-course-descriptions/dbcs/",
        "https://catalog.uic.edu/all-course-descriptions/dcle/",
        "https://catalog.uic.edu/all-course-descriptions/dosi/",
        "https://catalog.uic.edu/all-course-descriptions/dost/",
        "https://catalog.uic.edu/all-course-descriptions/des/",
        "https://catalog.uic.edu/all-course-descriptions/dlg/",
        "https://catalog.uic.edu/all-course-descriptions/dhd/",
        "https://catalog.uic.edu/all-course-descriptions/mdc/",
        "https://catalog.uic.edu/all-course-descriptions/mdp/",
        "https://catalog.uic.edu/all-course-descriptions/mdr/",
        "https://catalog.uic.edu/all-course-descriptions/eaes/",
        "https://catalog.uic.edu/all-course-descriptions/econ/",
        "https://catalog.uic.edu/all-course-descriptions/ed/",
        "https://catalog.uic.edu/all-course-descriptions/edps/",
        "https://catalog.uic.edu/all-course-descriptions/epsy/",
        "https://catalog.uic.edu/all-course-descriptions/ece/",
        "https://catalog.uic.edu/all-course-descriptions/eb/",
        "https://catalog.uic.edu/all-course-descriptions/endo/",
        "https://catalog.uic.edu/all-course-descriptions/ener/",
        "https://catalog.uic.edu/all-course-descriptions/engr/",
        "https://catalog.uic.edu/all-course-descriptions/engl/",
        "https://catalog.uic.edu/all-course-descriptions/entr/",
        "https://catalog.uic.edu/all-course-descriptions/eohs/",
        "https://catalog.uic.edu/all-course-descriptions/epid/",
        "https://catalog.uic.edu/all-course-descriptions/epl/",
        "https://catalog.uic.edu/all-course-descriptions/fin/",
        "https://catalog.uic.edu/all-course-descriptions/fr/",
        "https://catalog.uic.edu/all-course-descriptions/gws/",
        "https://catalog.uic.edu/all-course-descriptions/geog/",
        "https://catalog.uic.edu/all-course-descriptions/ger/",
        "https://catalog.uic.edu/all-course-descriptions/glas/",
        "https://catalog.uic.edu/all-course-descriptions/gc/",
        "https://catalog.uic.edu/all-course-descriptions/gems/",
        "https://catalog.uic.edu/all-course-descriptions/gka/",
        "https://catalog.uic.edu/all-course-descriptions/gkm/",
        "https://catalog.uic.edu/all-course-descriptions/gamd/",
        "https://catalog.uic.edu/all-course-descriptions/him/",
        "https://catalog.uic.edu/all-course-descriptions/hpa/",
        "https://catalog.uic.edu/all-course-descriptions/hlp/",
        "https://catalog.uic.edu/all-course-descriptions/heb/",
        "https://catalog.uic.edu/all-course-descriptions/hnur/",
        "https://catalog.uic.edu/all-course-descriptions/hstl/",
        "https://catalog.uic.edu/all-course-descriptions/hist/",
        "https://catalog.uic.edu/all-course-descriptions/hon/",
        "https://catalog.uic.edu/all-course-descriptions/hn/",
        "https://catalog.uic.edu/all-course-descriptions/hum/",
        "https://catalog.uic.edu/all-course-descriptions/ie/",
        "https://catalog.uic.edu/all-course-descriptions/it/",
        "https://catalog.uic.edu/all-course-descriptions/ids/",
        "https://catalog.uic.edu/all-course-descriptions/iphs/",
        "https://catalog.uic.edu/all-course-descriptions/idea/",
        "https://catalog.uic.edu/all-course-descriptions/isa/",
        "https://catalog.uic.edu/all-course-descriptions/ip/",
        "https://catalog.uic.edu/all-course-descriptions/ibt/",
        "https://catalog.uic.edu/all-course-descriptions/inst/",
        "https://catalog.uic.edu/all-course-descriptions/ital/",
        "https://catalog.uic.edu/all-course-descriptions/jpn/",
        "https://catalog.uic.edu/all-course-descriptions/jst/",
        "https://catalog.uic.edu/all-course-descriptions/jd/",
        "https://catalog.uic.edu/all-course-descriptions/kn/",
        "https://catalog.uic.edu/all-course-descriptions/kor/",
        "https://catalog.uic.edu/all-course-descriptions/lat/",
        "https://catalog.uic.edu/all-course-descriptions/lals/",
        "https://catalog.uic.edu/all-course-descriptions/law/",
        "https://catalog.uic.edu/all-course-descriptions/lrsc/",
        "https://catalog.uic.edu/all-course-descriptions/las/",
        "https://catalog.uic.edu/all-course-descriptions/lib/",
        "https://catalog.uic.edu/all-course-descriptions/ling/",
        "https://catalog.uic.edu/all-course-descriptions/lcsl/",
        "https://catalog.uic.edu/all-course-descriptions/lith/",
        "https://catalog.uic.edu/all-course-descriptions/mgmt/",
        "https://catalog.uic.edu/all-course-descriptions/mktg/",
        "https://catalog.uic.edu/all-course-descriptions/mba/",
        "https://catalog.uic.edu/all-course-descriptions/meng/",
        "https://catalog.uic.edu/all-course-descriptions/mj/",
        "https://catalog.uic.edu/all-course-descriptions/mcs/",
        "https://catalog.uic.edu/all-course-descriptions/math/",
        "https://catalog.uic.edu/all-course-descriptions/mtht/",
        "https://catalog.uic.edu/all-course-descriptions/me/",
        "https://catalog.uic.edu/all-course-descriptions/mbt/",
        "https://catalog.uic.edu/all-course-descriptions/mhpe/",
        "https://catalog.uic.edu/all-course-descriptions/mhum/",
        "https://catalog.uic.edu/all-course-descriptions/mdch/",
        "https://catalog.uic.edu/all-course-descriptions/pmmp/",
        "https://catalog.uic.edu/all-course-descriptions/mim/",
        "https://catalog.uic.edu/all-course-descriptions/mils/",
        "https://catalog.uic.edu/all-course-descriptions/movi/",
        "https://catalog.uic.edu/all-course-descriptions/muse/",
        "https://catalog.uic.edu/all-course-descriptions/mus/",
        "https://catalog.uic.edu/all-course-descriptions/nast/",
        "https://catalog.uic.edu/all-course-descriptions/nats/",
        "https://catalog.uic.edu/all-course-descriptions/ns/",
        "https://catalog.uic.edu/all-course-descriptions/neus/",
        "https://catalog.uic.edu/all-course-descriptions/nurs/",
        "https://catalog.uic.edu/all-course-descriptions/nuel/",
        "https://catalog.uic.edu/all-course-descriptions/nupr/",
        "https://catalog.uic.edu/all-course-descriptions/nusp/",
        "https://catalog.uic.edu/all-course-descriptions/ot/",
        "https://catalog.uic.edu/all-course-descriptions/omds/",
        "https://catalog.uic.edu/all-course-descriptions/osci/",
        "https://catalog.uic.edu/all-course-descriptions/osur/",
        "https://catalog.uic.edu/all-course-descriptions/ortd/",
        "https://catalog.uic.edu/all-course-descriptions/path/",
        "https://catalog.uic.edu/all-course-descriptions/psl/",
        "https://catalog.uic.edu/all-course-descriptions/pedd/",
        "https://catalog.uic.edu/all-course-descriptions/peri/",
        "https://catalog.uic.edu/all-course-descriptions/pmpg/",
        "https://catalog.uic.edu/all-course-descriptions/pcol/",
        "https://catalog.uic.edu/all-course-descriptions/phar/",
        "https://catalog.uic.edu/all-course-descriptions/pmpr/",
        "https://catalog.uic.edu/all-course-descriptions/psop/",
        "https://catalog.uic.edu/all-course-descriptions/phil/",
        "https://catalog.uic.edu/all-course-descriptions/pt/",
        "https://catalog.uic.edu/all-course-descriptions/phys/",
        "https://catalog.uic.edu/all-course-descriptions/phyb/",
        "https://catalog.uic.edu/all-course-descriptions/pol/",
        "https://catalog.uic.edu/all-course-descriptions/pols/",
        "https://catalog.uic.edu/all-course-descriptions/port/",
        "https://catalog.uic.edu/all-course-descriptions/prcl/",
        "https://catalog.uic.edu/all-course-descriptions/ptl/",
        "https://catalog.uic.edu/all-course-descriptions/pros/",
        "https://catalog.uic.edu/all-course-descriptions/psch/",
        "https://catalog.uic.edu/all-course-descriptions/pa/",
        "https://catalog.uic.edu/all-course-descriptions/pubh/",
        "https://catalog.uic.edu/all-course-descriptions/ppol/",
        "https://catalog.uic.edu/all-course-descriptions/ppa/",
        "https://catalog.uic.edu/all-course-descriptions/re/",
        "https://catalog.uic.edu/all-course-descriptions/rels/",
        "https://catalog.uic.edu/all-course-descriptions/rest/",
        "https://catalog.uic.edu/all-course-descriptions/russ/",
        "https://catalog.uic.edu/all-course-descriptions/slav/",
        "https://catalog.uic.edu/all-course-descriptions/sj/",
        "https://catalog.uic.edu/all-course-descriptions/socw/",
        "https://catalog.uic.edu/all-course-descriptions/soc/",
        "https://catalog.uic.edu/all-course-descriptions/span/",
        "https://catalog.uic.edu/all-course-descriptions/sped/",
        "https://catalog.uic.edu/all-course-descriptions/spec/",
        "https://catalog.uic.edu/all-course-descriptions/sabr/",
        "https://catalog.uic.edu/all-course-descriptions/surg/",
        "https://catalog.uic.edu/all-course-descriptions/tx/",
        "https://catalog.uic.edu/all-course-descriptions/thtr/",
        "https://catalog.uic.edu/all-course-descriptions/tadr/",
        "https://catalog.uic.edu/all-course-descriptions/upp/",
        "https://catalog.uic.edu/all-course-descriptions/us/",
        "https://catalog.uic.edu/all-course-descriptions/upa/",
        "https://catalog.uic.edu/all-course-descriptions/usl/",
        "https://catalog.uic.edu/search/?P=STAT+101",
        "https://catalog.uic.edu/search/?P=STAT+130",
        "https://catalog.uic.edu/search/?P=MATH+090",
        "https://catalog.uic.edu/search/?P=MATH+110",
        "https://catalog.uic.edu/search/?P=MATH+181",
        "https://catalog.uic.edu/search/?P=STAT+361",
        "https://catalog.uic.edu/search/?P=IE+342",
        "https://catalog.uic.edu/search/?P=STAT+381",
        "https://catalog.uic.edu/search/?P=STAT+382",
        "https://catalog.uic.edu/search/?P=MATH+210",
        "https://catalog.uic.edu/search/?P=STAT+401",
        "https://catalog.uic.edu/search/?P=STAT+411",
        "https://catalog.uic.edu/search/?P=STAT+481",
        "https://catalog.uic.edu/search/?P=MATH+310",
        "https://catalog.uic.edu/search/?P=ECON+473",
        "https://catalog.uic.edu/search/?P=ECON+270",
        "https://catalog.uic.edu/search/?P=MATH+534",
        "https://catalog.uic.edu/search/?P=STAT+501",
        "https://catalog.uic.edu/search/?P=STAT+511",
        "https://catalog.uic.edu/search/?P=STAT+521",
        "https://catalog.uic.edu/search/?P=STAT+531",
        "https://catalog.uic.edu/search/?P=STAT+535",
        "http://admissions.uic.edu/apply-now",
        "http://admissions.uic.edu/contact-admissions"
    ]
}