{
    "url": "https://otm.uic.edu/resources/innovation-ecosystem/",
    "title": "Innovation Ecosystem | Office of Technology Management | University of Illinois at Chicago",
    "text": [
        "Every innovation follows a unique path to impact, and so the University has cultivated a system of resources to support innovators with different needs and at different stages in the commercialization process.  These resources are offered both by the University and in partnership with external programs.",
        "Illinois Ventures",
        "Launched by the University of Illinois Board of Trustees in 2002, Illinois Ventures is a premier seed and early-stage technology investment firm focused on research-derived companies in information technologies, physical sciences, life sciences and clean technology. IllinoisVENTURES professionals provide guidance in market assessment, business strategy, and competitive analysis. The firm also provides funding through all stages of business creation and development.",
        "Chicago’s first shared wet lab facility, the 12,000 square feet of shared wet laboratory and office space is available for rent by UIC and non-UIC startups to perform proof-of-concept stage development.  HTI brings scientists, clinicians, engineers and industry together for an interdisciplinary approach to drug, diagnostic, device, material and information technology development. As a proof of concept center, HTI aims to increase the viability for life science and complex research based start-ups by focusing on the methodology that technology feasibility must occur in parallel to market feasibility. HTI addresses the unique challenges of life science and engineering based start-ups, by creating a platform that lowers barriers, addresses early stage risks and provides access to resources to better plan the commercial path.",
        "",
        "",
        "",
        "First apply here!",
        "After application is submitted wait for email with confirmation.",
        "1871 was created to support Chicago’s digital startup community. Since that time, it has become the hub for the city’s thriving technology and entrepreneurial ecosystem. Today 1871 is the home of nearly 500 early-stage, high-growth digital startups. Located in The Merchandise Mart, this 140,000 square foot facility is also the headquarters of nationally recognized accelerators, industry-specific incubators, and tech talent schools. It includes Chicago’s brightest digital designers, engineers and entrepreneurs are shaping new technologies, disrupting old business models, and resetting the boundaries of what’s possible.",
        "Visit 1871 to learn more and apply!",
        "",
        "U of I’s 1871 membership is available to current students, faculty, and staff from all of the University’s main campuses in Chicago, Urbana-Champaign, and Springfield, and regional campuses in Rockford and Peoria, who can demonstrate that they are engaged in entrepreneurial pursuits that would be advanced by accessing 1871.",
        "",
        "",
        "1871 hosts unique and educational events every month, several of which are free to members, including the University. Visit the 1871 events calendar to register for 1871’s programs. (Please note that some events at 1871 are also open to the public or may require a fee to attend.)",
        "",
        "Step 1: User Application Form (for first-time users)",
        "First-time users must complete the University’s User Application before they are able to access the membership (for security purposes). Users only need to fill out this form once and will receive email confirmation within 1-2 business days.",
        "All applicants and users must review and agree to the U of I @ 1871 Usage Policy before using the space.",
        "Step 2:  Create an 1871 Member Profile",
        "Create an 1871 member profile here. We use 1871’s online member portal to make reservations so this will allow you to access the room’s online reservation system so that you can reserve to use the room and register for select 1871 events and workshops that are open to University of Illinois (UIC, UIUC, and UIS) students.",
        "Please note, it will take about 1-2 business days to approve your user application and activate your 1871 member profile.",
        "Step 3: Access 1871’s Online Reservation Portal",
        "Once you’re approved, you can login to 1871’s online portal here. We will also send you a complete user guide with instructions on how to book your spot and access 1871 events.",
        "mHUB is the nation’s largest and fastest growing innovation center for physical product development and manufacturing. mHUB is a community of product designers and developers, entrepreneurs, engineers and manufacturers, a network of manufacturing mentors, industry experts and investors, and a source of intellectual and economic capital. mHUB is home to more than $5 million in resources including ten unique prototyping labs and microfactory for onsite low-volume production runs. Learn more at mHUBChicago.com.",
        "",
        "UIC’s mHUB Associate Membership is available to current students, faculty, staff, and alumni* from the Univeristy’s Chicago campus and regional campuses in Rockford and Peoria. Interested students must demonstrate that they are engaged in entrepreneurial pursuits that would be advanced by accessing mHUB. An application through mHUB is required to gain access to the facility.",
        "*UIC alumni have access to mHUB through UIC’s Associate Membership for up to 6 months after graduation",
        "",
        "",
        "",
        "Every year mHUB hosts more than 300 events throughout its space including everything from meetup groups, to hackathons, to networking events and more. Many of the events are free to members including UIC students. Visit the mHUB events calendar to learn more register for events. (Please note that some events at mHUB are also open to the public or may require a fee to attend.)",
        "Visit mHUB to learn more!",
        "",
        "",
        "First apply here!",
        "After application is submitted wait for email with confirmation.",
        "MATTER is a healthcare startup incubator, community nexus and corporate innovation accelerator. They are mobilizing a community of entrepreneurs, industry innovators, scientists and clinicians committed to improving health and care for every patient.",
        "",
        "UIC’s MATTER membership is available to current students, faculty, and staff from the University’s Chicago campus and regional campuses in Rockford and Peoria, who can demonstrate that they are engaged in entrepreneurial pursuits that would be advanced by accessing MATTER",
        "",
        "",
        "",
        "",
        "MATTER hosts unique and educational events every month, several of which are free to members, including the University. Visit the MATTER’s events calendar to register for events. (Please note that some events at MATTER are also open to the public or may require a fee to attend.)",
        "Visit MATTER to learn more!",
        "",
        "",
        "First apply here!",
        "After application is submitted wait for email with confirmation.",
        "The Illinois University Incubator Network (IUIN) provides direct services to entrepreneurs and small businesses such as funding support for innovation research and assistance with graphic design, marketing communication, market surveys, websites, social media, etc.",
        "The Small Business Assistance program provides free creative and marketing services for qualified entrepreneurs, businesses, and business start-ups in the state of Illinois. Applications are evaluated on a competitive basis. A team of student specialists provide free services for applications that are accepted.",
        "Types of Services include graphic design (logo, brochure, etc.), marketing communication, social media strategy, basic website design, market survey design, business plan review, pitch presentation review, packaging design, trade show graphics, etc.",
        "To learn more about the Small Business Assistance program, click here",
        "The IUIN provides SBIR assistance through free workshops and free one-on-one counseling to assist with SBIR funding applications.",
        "Counseling, to assist with SBIR funding applications, is awarded to companies through a competitive application process. Applicants must be associated with a university and be referred by an incubator in the Illinois University Incubator Network or an institution of higher education in the following Illinois counties: Champaign, Coles, Cook, DeKalb, Jackson, Kankakee, Macon, Peoria, Sangamon, Winnebago.",
        "To learn more, click here."
    ],
    "out_links": [
        "https://otm.uic.edu/",
        "http://uic.edu/",
        "https://otm.uic.edu/uic-community/",
        "https://otm.uic.edu/uic-community/submit-your-idea/",
        "https://otm.uic.edu/resources/ctri-2/",
        "https://otm.uic.edu/inventor-of-the-year/",
        "https://otm.uic.edu/uic-community/ownership-guidelines/",
        "https://otm.uic.edu/uic-community/how-to-disclose/",
        "https://otm.uic.edu/uic-community/what-happens-next/",
        "https://otm.uic.edu/industry-2/",
        "https://otm.uic.edu/available-technologies/",
        "https://otm.uic.edu/industry-2/technology-portfolio/",
        "https://otm.uic.edu/industry-2/ndas/",
        "https://otm.uic.edu/industry-2/mtas-sras/",
        "https://otm.uic.edu/industry-2/ready-sign-licenses/",
        "https://otm.uic.edu/industry-2/faqs/",
        "https://otm.uic.edu/resources/",
        "https://otm.uic.edu/resources/innovation-handbooks/",
        "https://otm.uic.edu/resources/funding-awards/",
        "https://otm.uic.edu/resources/educational-series/",
        "https://otm.uic.edu/about/",
        "https://otm.uic.edu/about/fy19-impact-report/",
        "https://otm.uic.edu/about/contact-us/",
        "https://otm.uic.edu/about/staff/",
        "https://otm.uic.edu/about/careers/",
        "https://otm.uic.edu/about/news-events/",
        "https://otm.uic.edu/about/events-2/",
        "https://otm.uic.edu/about/general-faqs/",
        "http://maps.uic.edu/",
        "https://forms.uofi.uic.edu/sec/175939",
        "https://forms.uofi.uic.edu/sec/4493869",
        "https://otm.uic.edu/listserv/",
        "https://otm.uic.edu/resources/funding-awards/upcoming-awards/",
        "https://otm.uic.edu/resources/funding-awards/poc/",
        "https://otm.uic.edu/resources/funding-awards/chicago-biomedical-consortium-cbc/",
        "https://otm.uic.edu/resources/funding-awards/sbir-sttr-awards/",
        "https://otm.uic.edu/resources/funding-awards/sbir-sttr-awards/sbir-sttr-consulting-program/",
        "https://otm.uic.edu/resources/educational-series/patents/",
        "https://otm.uic.edu/resources/educational-series/copyrights/",
        "https://otm.uic.edu/resources/educational-series/trademarks-101/",
        "https://otm.uic.edu/resources/educational-series/start-ups-101/",
        "https://otm.uic.edu/resources/educational-series/introduction-to-sbir-sttrs/",
        "https://otm.uic.edu/about/events-2/uic-pitch-series/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}