{
    "url": "https://swe.students.uic.edu/join/swe-leading-members/",
    "title": "SWE Leading Members | Society of Women Engineers | University of Illinois at Chicago",
    "text": [
        "How do you become a SWE Leading Member? It’s pretty simple, you must gain points by being an active member who is officially a SWE member. Once you are a registered SWE member, you can get points by actively participating in the following activities:",
        "If you are selected to be a SWE Leading Member, you will also get a special SWE goodie bag and be featured on our social media platforms like these wonderful members:",
        "Preferred name and pronouns",
        "Angie, she/her/hers",
        "Where are you from?",
        "Indonesia",
        "What is your major/year?",
        "Chemical Engineering/Sophomore",
        "Why did you decide to major in engineering?",
        "I wanted to be a part of something that can help make the world better and be hands-on with it. Other than that, my dad is an engineer and growing up I’ve always wanted to be like him so he inspired me to become one.",
        "Do you have any hobbies?",
        "Singing, playing piano, guitar, saxophone and binge-watching tv series",
        "Preferred Name and Pronouns:",
        "Siva Sreedhar",
        "(she/her/hers)",
        "Where are you from?",
        "Elmhurst, IL",
        "What is your major/year?",
        "Sophomore in Chemical Engineering",
        "Why did you decide to major in engineering?",
        "“I loved math, physics, and chem in high school, so chemical engineering just seemed to be the perfect combination of the three!”",
        "Do you have any hobbies?",
        "Lifting and baking",
        "Preferred Name and Pronouns",
        "Stephanie Flores",
        "(she/her/hers)",
        "Where are you from?",
        "Aurora, IL",
        "What is your major/year?",
        "Junior in Mechanical Engineering",
        "Why did you decide to major in engineering?",
        "“Besides my passion for math and science, it’s the impact and countless opportunities that engineering offers that has led me towards Mechanical Engineering. Taking part in making a difference in a changing society on a large or small scale while taking on challenges is what has inspired me to follow my career path.”",
        "Do you have any hobbies?",
        "Listening to GOOD music, drawing portraits, and watching documentaries/movies",
        "Preferred Name:",
        "Noemi, she/her/hers",
        "Where are you from?",
        "I am originally from Romania with hungarian ethnicity. The reason for this is that I grew up in Romania in a Hungarian family. It is like when a family lives in the US: they learn to speak English, but they also try to keep their mother tongue. My family moved to the states when I was 15 years old. I currently live in Morton Grove and I commute every day.",
        "Major/year:",
        "Computer Science, Sophomore year",
        "Why did I decide to major in engineering?",
        "I was good at math in school and using my creativity for the greater good seemed to be the driving force of my life. Through Computer Science, I can think and create at the same time, while making the world a better place!",
        "Hobbies and Interests Outside of School:",
        "I absolutely love to learn, so I am trying to keep up with the 4 languages I speak. That is partly why I am intending to minor in Germanic Studies, so I can perfect my German skills next to Hungarian, Romanian and English, and maybe pick up a fifth language in the future!",
        "In my free time, I enjoy being a scout leader at ‘Hunyadi Mátyás Scout Troop 19’, a Hungarian scout organization that supports the beliefs of boy scouts, as well as Hungarian culture.",
        "As in my alone time, you can catch me thinking about the meaning of life or appreciating the little things, like train rides, the sound of the city, and the beautiful buildings in Chicago!"
    ],
    "out_links": [
        "https://swe.students.uic.edu/",
        "http://uic.edu/",
        "https://involvement.uic.edu/",
        "https://swe.students.uic.edu/join/",
        "https://swe.students.uic.edu/join/swe-leading-members-2/",
        "https://swe.students.uic.edu/officers/",
        "https://swe.students.uic.edu/gradswe/",
        "https://swe.students.uic.edu/events-2/",
        "https://swe.students.uic.edu/mmswe/",
        "https://swe.students.uic.edu/swe-in-the-city/",
        "https://swe.students.uic.edu/fundraisers/",
        "https://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}