{
    "url": "https://catalog.uic.edu/gcat/colleges-schools/council-teacher-education/",
    "title": "Council on Teacher Education < University of Illinois at Chicago",
    "text": [
        "Administration: Director, Dr. Aginah M. Muhammad, (312) 996-9177Assistant Director and Licensure Officer, Sierra Ryan, (312) 355-0718Student Teaching Coordinator, Brittney Beck-James, (312) 355-1872Customer Service Representative, Shatell Coleman, (312) 355-0714Educational Program Evaluation Coordinator, (312) 355-1875",
        "The Council on Teacher Education (CTE) is the professional education unit for the University of Illinois at Chicago responsible for coordinating Professional Educator Licensure (PEL)  programs and maintaining the State of Illinois Licensure requirements.",
        "Decisions about licensure are a joint effort of a candidate’s program, CTE, and the Illinois State Board of Education (ISBE). The program coordinator and faculty have the main responsibility for ensuring that candidates are prepared to become licensed teachers and are, thus, entitled to apply for licensure. Program coordinators approve qualifications before the CTE evaluation process begins. The CTE’s licensure officer entitles an individual to apply for a license at the state level. The CTE checks that candidates have met state requirements, such as passing the required state-level tests and completing the course, assessment, and grade requirements stipulated by the program as addressing state objectives. ISBE makes the final decision about whether or not a candidate receives licensure based upon the information it receives from the institution and a candidate’s application.",
        "The CTE serves programs in the College of Education, the College of Liberal Arts and Sciences, the College of Nursing, and the Jane Addams College of Social Work.",
        "To be eligible for candidacy, candidates must meet the following criteria:",
        "To be eligible for student teaching, candidates must meet the following criteria:",
        "Teacher candidates are responsible for bearing the expense of exams, licensure, TB test and criminal background checks.",
        "ACT cut score is based upon test dates occurring after September 10, 2016.  SAT cut score is based upon test dates occurring after March 5, 2016.",
        "To become licensed, candidates must have done the following:",
        "Illinois Licensure Test Requirements",
        "Before the license is issued, the candidate must also pass a series of examinations required by ISBE. The TAP or a substitute test must be passed prior to applying for candidacy. The Illinois content area test must be passed before the candidate is allowed to student teach. Lastly, a teaching license is not issued until a student passes the final performance assessment, the edTPA.",
        "ISBE occasionally changes the requirements for licensure. For current information, contact the academic advisor in the major field of study or the CTE.",
        "The College of Education also offers several graduate-level early childhood and special education programs. Students can earn an MEd in Instructional Leadership with a concentration in Early Childhood/Early Childhood Special Education, an MEd in Special Education: LBSI, or an MEd in Special Education: LBSII (which includes options for Assistive Technology Specialist, Behavior Intervention Specialist, Bilingual Specialist, Curriculum Adaptation Specialist, Multiple Disabilities Specialist, and Transition Specialist). These programs prepare students to apply for the ISBE Special Education PEL, grades P-21. For more information about these options, please contact the College of Education Office of Student Services, 3145 ETMSW, (312) 996-4532.",
        "Literacy, Language, & Culture Concentration within Instructional Leadership MEd Programs",
        "The College of Education offers a Literacy, Language, and Culture concentration within the Instructional Leadership MEd program, which provides students with high-quality advanced training in literacy education that enables them to understand and foster children’s and adolescents’ language and literacy development. Strand A (Classroom Literacy Instruction) prepares students to apply for the ISBE Reading Teacher endorsement. Strand B (Reading Specialist certification) prepares students to apply for the ISBE Reading Specialist endorsement, grades K–12. For more information about these options, please contact the College of Education Office of Student Services, 3145 ETMSW, (312) 996-4532.",
        "The College of Liberal Arts and Sciences (LAS) offers several graduate-level secondary teacher education programs. Through LAS, the student can study the Teaching of English, Teaching of History, Teaching of Mathematics, and Teaching of Spanish. The programs provide for the development of a major field of study with an emphasis on teaching.",
        "Licensure in the teaching of biology, chemistry, physics, environmental science, or earth and space sciences is available through the College of Education in the MEd in Instructional Leadership: Science Education.",
        "Since each program is slightly different, contact the secondary program coordinators to learn more about requirements and ISBE licensure options.",
        "The School Nurse Certificate program is designed for those who have already earned an RN license with a BSN degree. The certification program prepares students to apply for the ISBE PEL with School Nurse endorsement. For more information about the certification program, contact the College of Nursing at: sncert@uic.edu.",
        "The Jane Addams College of Social Work offers School Social Work Concentration curriculum, preparing students to become school social workers. The Post-MSW School Social Worker endorsement program is for those who have already earned an MSW degree. Both the MSW and Post-MSW programs prepare students to apply for the ISBE PEL with School Social Worker endorsement. For more information about the program and application process, contact the Jane Addams College of Social Work, (312) 996-0033.",
        "The College of Education offers the EdD program in Urban Education Leadership. The EdD program is designed to prepare and develop principals who are able to lead significantly improved teaching and learning in urban schools. This program prepares outstanding teachers and assistant principals seeking to transition to school leadership positions, as well as principals interested in enhancing their leadership skills. Students have the option of completing the EdD program with Superintendent endorsement, P–12 Principal endorsement or a Certificate of Advanced Studies (CAS). Contact the Center for Urban Education Leadership at (312) 355-0546. For more information about the program, contact the Center for Urban Education Leadership, (312) 355-0546.",
        "Apply Online | Contact Admissions | Privacy Statement",
        "Having problems accessing this site? Contact the Webmaster.",
        "© 2018-2019 The Board of Trustees of the University of Illinois",
        "",
        "Print this page.",
        "",
        "The PDF will include all information unique to this page.",
        "",
        "All pages in the campus catalog.",
        ""
    ],
    "out_links": [
        "https://catalog.uic.edu/azindex/",
        "https://catalog.uic.edu/",
        "http://www.uic.edu/",
        "https://catalog.uic.edu/ucat/",
        "https://catalog.uic.edu/gcat",
        "https://catalog.uic.edu/gcat/",
        "https://catalog.uic.edu/gcat/academic-calendar/",
        "https://catalog.uic.edu/gcat/the-university/",
        "https://catalog.uic.edu/gcat/graduate-study/",
        "https://catalog.uic.edu/gcat/degree-programs/",
        "https://catalog.uic.edu/gcat/colleges-schools/",
        "https://catalog.uic.edu/gcat/colleges-schools/applied-health-sciences/",
        "https://catalog.uic.edu/gcat/colleges-schools/architecture-design-arts/",
        "https://catalog.uic.edu/gcat/colleges-schools/business-administration/",
        "https://catalog.uic.edu/gcat/colleges-schools/dentistry/",
        "https://catalog.uic.edu/gcat/colleges-schools/education/",
        "https://catalog.uic.edu/gcat/colleges-schools/engineering/",
        "https://catalog.uic.edu/gcat/graduate-college/",
        "https://catalog.uic.edu/gcat/colleges-schools/uic-john-marshall-law-school/",
        "https://catalog.uic.edu/gcat/colleges-schools/liberal-arts-sciences/",
        "https://catalog.uic.edu/gcat/colleges-schools/medicine/",
        "https://catalog.uic.edu/gcat/colleges-schools/nursing/",
        "https://catalog.uic.edu/gcat/colleges-schools/pharmacy/",
        "https://catalog.uic.edu/gcat/colleges-schools/public-health/",
        "https://catalog.uic.edu/gcat/colleges-schools/social-work/",
        "https://catalog.uic.edu/gcat/colleges-schools/urban-planning-public-affairs/",
        "https://catalog.uic.edu/gcat/colleges-schools/addl-opps/",
        "https://catalog.uic.edu/gcat/course-descriptions/",
        "https://catalog.uic.edu/gcat/faculty/",
        "https://catalog.uic.edu/gcat/archive-links/",
        "http://grad.uic.edu/",
        "https://catalog.uic.edu/all-course-descriptions/",
        "http://cte.uic.edu/",
        "http://admissions.uic.edu/apply-now",
        "http://admissions.uic.edu/contact-admissions"
    ]
}