{
    "url": "https://drc.uic.edu/frequently-asked-questions-faq/",
    "title": "Frequently Asked Questions (FAQ) | Disability Resource Center | University of Illinois at Chicago",
    "text": [
        "Got a question for the DRC? Take a look at some of our most frequently asked questions below.",
        "There is an office like the DRC at pretty much every college or university in the U.S.! That’s because it’s our job to protect the rights of college students with disabilities to full and equal access to their college experience. We do so by working one-on-one with students to identify barriers in the campus environment and to create a plan of reasonable accommodations that removes those barriers.",
        "For example, a student with ADHD may face barriers when taking tests in a distracting environment. A potential accommodation for this student would be a distraction-reduced environment for testing, so they get equal access to the test and are able to really show what they know.",
        "Any UIC student with a documented disability can register with the DRC. This includes all undergraduate, graduate, professional program and continuing education students on east and west campus. Our services are completely free, and do not require US citizenship or Social Security Number. If you have a disability, or you think you might, contact us and we can help you with your next steps. We believe you and we are here for you.",
        "YES. We support students with Diabetes, Crohn’s disease, chronic migraines, fibromyalgia, MS, Lupus, HIV/AIDS, just to name a few. If your chronic health condition affects you in an academic setting, please come in and get support.",
        "YES. We support students with Generalized Anxiety Disorder, PTSD, Depression, Bipolar Disorder, Schizophrenia, just to name a few. If your mental health affects you in an academic setting, please come in and get support.",
        "Yes, accommodations can be provided on a temporary basis for temporary disabilities or injuries that affect a student academically. Contact DRC for more information on your specific situation.",
        "People who are pregnant are protected and can received accommodations under Title IX, which is handled at UIC by the Office for Access and Equity. You can contact the Office for Access and Equity (OAE) at oae@uic.edu or 312-996-8670. A student who is experiencing medical complications in pregnancy might also qualify for temporary disability accommodations through the DRC, but we encourage students to make OAE their first point of contact.",
        "The registration process is three steps:",
        "1) a student registration form which usually takes 5-10 minutes to complete",
        "2) an intake with one of our Disability Services Specialists, which you can usually schedule a few days in advance and takes 1 hour",
        "3) gathering disability documentation, which can either be very quick if you already have it, or take a while if you need to contact your care provider or get evaluated for the first time.",
        "On average, the whole process takes less than a week to complete, but it depends a lot on your specific situation. PLEASE",
        "NOTE: our highest traffic times are at the very beginning of the semester. During this time it may take longer than usual to get on our calendar for an intake. You can start the registration process at any time during the year, but we highly recommend that you schedule your appointment as early as possible to avoid the rush at our high traffic times.",
        "One of the major differences between high school and college for students with disabilities is that at the college level, you MUST SELF-IDENTIFY by disclosing disability to the DRC in order to receive accommodations. This means that unless you contact the DRC, we will not know that you are a student with a disability, nor will we have any of your information or documentation.",
        "Some of the accommodations on your IEP/504 from high school might still be possible to implement in college, but please do not assume that we know anything about your disability or your accommodations if you have not contact us directly. You can call us, email us, or stop by using the contact information at the bottom of this website.",
        "All documentation and conversation with the DRC remains confidential unless a student gives us express permission to share. This means that you as a student are in the driver’s seat of who knows about your accommodations and your disability. Our Letters of Accommodation (LOAs) do not include any information about diagnosis, only details about accommodations to be implemented. Instructors and/or staff members should not ask for a student’s medical or diagnostic information – if this happens to you, notify the DRC right away and we can help to explain your rights to the faculty or staff member in question.",
        "While we don’t do diagnostic testing within the DRC, we can point you to resources on and off campus. Check in with us via phone,  email, or in person and we can talk about the option that’s best for you.",
        "At UIC, the Dean of Students Office (DOS) handles the process for informing instructors when a student will miss class because they have been hospitalized. This process keeps all information about the hospitalization confidential, and can be employed for emergency or voluntary hospitalization, as well as for students undergoing gender affirmation procedures. If a student requires accommodations after release, and/or is already working with the DRC, the DOS and DRC can work collaboratively to ensure the student is supported. The first step is to complete the Student Assistance form on the homepage of the DOS website: dos.uic.edu.",
        "The DRC determines accommodations during a one-on-one interactive intake with each student. Two students with the same disability may face different barriers, require different accommodations, and have different preferences for their accommodation plan. We encourage you to meet with a Disability Services Specialist to talk more about your specific situation.",
        "Once a Letter of Accommodation (LOA) is created, the DRC will send a PDF of the letter directly to the student. LOAs do not expire, so while student’s always have the option to update their LOA with the DRC as needed, the same LOA can be used for their entire college career.",
        "Every semester, the student can send the LOA to instructors in the classes for which they need accommodations. It is important to keep in mind that accommodations cannot be applied retroactively, so the DRC encourages students to send their LOAs early. Once the LOA has been sent, the student and instructor should touch base in a private meeting to go over the accommodations and ensure that they are on the same page about implementation. The contact information for that student’s Disability Services Specialist is at the top of the letter, and the DRC is always available for assistance in answering questions and/or facilitating conversation about implementation of accommodations.",
        "If any person (including employees, students, visitors, and members of the public) believes that they have been subjected to unlawful discrimination or harassment of any kind, they may submit a complaint by contacting the Office for Access and Equity at 312-996-8670 or oae@uic.edu."
    ],
    "out_links": [
        "https://drc.uic.edu/",
        "http://uic.edu/",
        "https://drc.uic.edu/about/",
        "https://drc.uic.edu/students-2/rights-and-responsibilities/",
        "https://drc.uic.edu/accommodations/",
        "https://drc.uic.edu/about/people/",
        "https://drc.uic.edu/students-2/new-to-drc/",
        "https://drc.uic.edu/information-about-evaluation-and-assessment/",
        "https://drc.uic.edu/facultystaff/",
        "https://drc.uic.edu/drc-referral-materials/",
        "https://drc.uic.edu/drc-exam-proctoring-form-for-instructors/",
        "https://drc.uic.edu/facultystaff/faculty/",
        "https://drc.uic.edu/faculty-resources-for-making-online-course-content-accessible/",
        "https://drc.uic.edu/facultystaff/guide-to-accommodations/",
        "https://drc.uic.edu/facultystaff/disability-policies-laws/",
        "https://drc.uic.edu/universal-design/",
        "https://drc.uic.edu/report-an-issue/",
        "https://drc.uic.edu/accommodations-complaint-process/",
        "https://forms.uofi.uic.edu/sec/7074059",
        "https://drc.uic.edu/contact-us/",
        "http://maps.uic.edu/",
        "http://dos.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}