{
    "url": "https://registrar.uic.edu/student_records/transcripts/",
    "title": "Transcripts | UIC Office of the Registrar",
    "text": [
        "The official transcript is the University's statement of a student's academic record issued by the Office of the Registrar. It lists all courses completed and grades earned in chronological order by term. Transcripts also contain notations of distinctions, transfer coursework summary, academic status, administrative actions and degrees received.",
        "Immediately after a term's final exams have ended, transcripts listing final grades may not be available for a period of up to two weeks. Transcripts listing final degree awarded may not be available for a period of four to six weeks following final exams of the final term in which the degree is earned. Transcripts will not be released if there is a hold on the student's record.",
        "Visit Order Electronic Transcript page.",
        "Check the status of your order.",
        "Once logged in to my.uic.edu, search for Transcript Ordering.  Indicate postal mailing address.",
        "If you are unable to access my.UIC.edu, you can still order transcripts from an online system. University Identification Number (UIN) is requested to assist us in processing your request. If you were enrolled in 1981 or later, you may have had a UIN assigned to you.  If you have difficulty retrieving your UIN, the Transcripts Office can process your transcript request using other information about you.  You'll need your SSN and birthday to look up your UIN.",
        "The site will walk you through placing your order, including delivery options and fees. You can order as many transcripts as you like in a single session. A $2.35 processing fee will be charged per copy with additional fees for first class postal mailing, or express mailing of transcripts. Order updates will be emailed to all requestors and updates can be sent through cell phone texts if you choose.",
        "Order electronic transcript",
        "Please make sure that your recipient accepts transcripts via e-mailed secure PDF and that you have the correct email address.  University Identification Number (UIN) is requested to assist us in processing your request. If you were enrolled in 1981 or later, you may have had a UIN assigned to you.  If you have difficulty retrieving your UIN, the Transcripts Office can process your transcript request using other information about you. Social Security Number and birthday is required to look up your UIN.  Cost per electronic copy is $14.35.",
        "If you do not have  access to the Internet or use of a credit card, transcripts may also be requested in writing. Print and complete the Transcript Request Form, or write a letter providing the information below:",
        "Mail your request to:",
        "Office of the Registrar (MC 018)",
        "University of Illinois at Chicago",
        "Suite 1200 Student Services Building",
        "1200 West Harrison Street",
        "Chicago, Illinois 60607-7161",
        "Please note that transcripts are mailed first class standard via the United States Postal Service. If you require express mail service delivery of paper transcripts, select that option when ordering online.",
        "A Co-Curricular Transcript provides an official record of out-of-the-classroom student involvement, participation, awards, honors, and certificates.  Co-Curricular Transcripts may include: student organization involvement, student organization leadership, community service, leadership training, workshops and seminars, awards, honors, and certifications.",
        "To order a Co-Curricular Transcript for current students visit: https://impact.uic.edu/ and under Quick Links select Order a Co-Curricular Transcript on the right hand side of the webpage.",
        "Transcripts from the Michael Reese School of Nursing may be obtained from the University of Illinois at Chicago (UIC).  Print and complete the Michael Reese School of Nursing Transcript Request Form, or write a letter providing the information below:",
        "Mail your request to:",
        "For additional information on transcripts please contact the Transcripts Department.",
        "",
        ""
    ],
    "out_links": [
        "https://registrar.uic.edu/index.html",
        "https://registrar.uic.edu/registration/",
        "https://registrar.uic.edu/contact/",
        "http://www.uic.edu/",
        "https://registrar.uic.edu/current_students/",
        "https://registrar.uic.edu/current_students/calendars/",
        "https://registrar.uic.edu/financial_matters/",
        "https://registrar.uic.edu/student_records/",
        "https://registrar.uic.edu/campus_policies/",
        "https://registrar.uic.edu/uic_faculty_staff/",
        "https://registrar.uic.edu/uic_faculty_staff/classroom_scheduling/",
        "https://registrar.uic.edu/uic_faculty_staff/faculty_self_service/",
        "https://registrar.uic.edu/uic_faculty_staff/calendars/",
        "https://registrar.uic.edu/uic_faculty_staff/classes.html",
        "https://registrar.uic.edu/uic_faculty_staff/grades/",
        "https://registrar.uic.edu/uic_faculty_staff/registration/",
        "https://registrar.uic.edu/uic_faculty_staff/student_records_policy/",
        "https://admissions.uic.edu/undergraduate",
        "https://aes.uic.edu/aes-staff/",
        "http://my.uic.edu/",
        "https://impact.uic.edu/",
        "https://registrar.uic.edu/contact/form_current_students.html",
        "https://registrar.uic.edu/sitemap"
    ]
}