{
    "url": "https://drc.uic.edu/facultystaff/faculty/",
    "title": "Faculty Testing Forms and Resources | Disability Resource Center | University of Illinois at Chicago",
    "text": [
        "Once you have approved of the student taking the exam or quiz at the DRC, please complete the Instructors: Exam Proctoring Form via the DRC home page. The form will ask you information as to how you’d like your exam proctored, including:",
        "If you have any questions about the form, please contact DRC Testing at accesstesting@uic.edu.",
        "Before the exam, you may attach a copy of the exam directly to the Exam Proctoring Form, email a copy of the exam to DRC Testing at accesstesting@uic.edu OR you may drop off the physical exam here at the DRC, located in the Student Services Building (SSB), Suite 1070.",
        "Ideally we like to have the exams at least one day in advance in order to prepare all of the necessary materials.",
        "In addition, you will need to fill out the Instructors: Exam Proctoring Form to give DRC Testing instructions on how to administer the exam.",
        "Each student has the responsibility to share their LOA with the instructor of the course. LOAs are written for all classes a student may take, and students may find that they do not need certain accommodations in your course or many times may not realize that they need their accommodations until some time has passed.",
        "Accommodations are not retroactive, and so would be in effect from the time a student shares their LOA moving forward. Of course, they also need to give you and the DRC time to prepare and organize materials, so if they share exam accommodations the day before an exam we/you might not have time to arrange for those accommodations.",
        "Students need to first discuss their Letter of Accommodation (LOA) with you, along with their request to take the exam at the Disability Resource Center (DRC). If you agree to the student testing at the DRC or cannot otherwise implement their accommodations in the classroom, the student will need to submit an exam scheduling request via the DRC Accommodate portal at least 72 hours (3 days) prior to the requested exam date.",
        "Once the scheduling request has been processed, DRC Testing will send a confirmation to the student and copy (cc) the instructor with the date and time of the exam. There will also be a direct link to the Exam Proctoring Form that instructors must to fill out prior to the exam. DRC Testing does not automatically send any other reminders before the date of the test, so please take note so that you can send materials in a timely manner.",
        "Yes, DRC Testing has scantrons and scratch paper that students can use, if they are required or permitted to use the items during the exam. However, if the exam requires the use of a Blue Book and loose leaf paper cannot be substituted, then the student or the instructor must provide in order to use it for the exam. The DRC does not provide Blue Books.",
        "For students who need accessible technology, such as a computer, assistive software, or digital recorders, DRC Testing can coordinate the use of technology for the exam.",
        "The DRC is open for testing Monday through Friday, 9am – 4pm. Exams are scheduled to start on the top of the hour."
    ],
    "out_links": [
        "https://drc.uic.edu/",
        "http://uic.edu/",
        "https://drc.uic.edu/about/",
        "https://drc.uic.edu/students-2/rights-and-responsibilities/",
        "https://drc.uic.edu/accommodations/",
        "https://drc.uic.edu/about/people/",
        "https://drc.uic.edu/students-2/new-to-drc/",
        "https://drc.uic.edu/information-about-evaluation-and-assessment/",
        "https://drc.uic.edu/frequently-asked-questions-faq/",
        "https://drc.uic.edu/facultystaff/",
        "https://drc.uic.edu/drc-referral-materials/",
        "https://drc.uic.edu/drc-exam-proctoring-form-for-instructors/",
        "https://drc.uic.edu/faculty-resources-for-making-online-course-content-accessible/",
        "https://drc.uic.edu/facultystaff/guide-to-accommodations/",
        "https://drc.uic.edu/facultystaff/disability-policies-laws/",
        "https://drc.uic.edu/universal-design/",
        "https://drc.uic.edu/report-an-issue/",
        "https://drc.uic.edu/accommodations-complaint-process/",
        "https://forms.uofi.uic.edu/sec/7074059",
        "https://drc.uic.edu/contact-us/",
        "http://maps.uic.edu/",
        "https://drc.uic.edu/facultystaff/faculty/accesstesting@uic.edu",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}