{
    "url": "https://drc.uic.edu/facultystaff/guide-to-accommodations/",
    "title": "Guide to Accommodations | Disability Resource Center | University of Illinois at Chicago",
    "text": [
        "NOTE: Accommodations for students with disabilities are determined on a case-by-case basis with input from the student, instructor, and Disability Resource Center (DRC) staff. Your input in this process is important; accommodations should in no way compromise the essential elements or objectives of your course.",
        "o   Please note that if the student takes the exam in a separate location, the area should not be unusually loud or crowded. If it is difficult for the student to concentrate with, they will not be able to demonstrate their course knowledge on the exam.",
        "o   If you or your department cannot provide extended testing accommodations for the student, students are welcome to take their exam at the DRC.",
        "o   If students prefer to take their exam at the DRC, they have the right to a separate, distraction-reduced room within our facility.",
        "o   Scribe (Peer Note-Taker). Students approved for this accommodation may seek the DRC assistance in identifying a peer note taker by completing the Request for Peer Note Taker form. The DRC will contact the roster of the class soliciting a volunteer and create an anonymous Box folder for the DRC student and the peer note taker to upload and access notes. If a peer note taker is not identified after two attempts via email, the DRC will be in contact with the instructor to arrange for an alternative.",
        "o   Recording of Lectures. Students should be awarded the opportunity to record lectures using either digital recorders, Sonocent software or Livescribe smart pen provided by the DRC, or their own electronic device. Recording the lecture should be used solely for the purpose of note-taking. The DRC enforces the confidentiality of the material presented in lectures.",
        "o   Acquiring Professor’s Notes. Students with disabilities are eligible to receive copies of their professors’ notes prior to lecture pending the professor has created notes. Therefore, if a professor has created a PowerPoint presentation, but does not intend to share with the class, a student with this accommodation should be given the presentation prior to class to aid with his/her note-taking. If the professor does NOT have any type of written outline, notes, and/or formal presentation, he or she does NOT need to create one for the student.",
        "http://ahead.org/",
        "http://www.washington.edu/doit/"
    ],
    "out_links": [
        "https://drc.uic.edu/",
        "http://uic.edu/",
        "https://drc.uic.edu/about/",
        "https://drc.uic.edu/students-2/rights-and-responsibilities/",
        "https://drc.uic.edu/accommodations/",
        "https://drc.uic.edu/about/people/",
        "https://drc.uic.edu/students-2/new-to-drc/",
        "https://drc.uic.edu/information-about-evaluation-and-assessment/",
        "https://drc.uic.edu/frequently-asked-questions-faq/",
        "https://drc.uic.edu/facultystaff/",
        "https://drc.uic.edu/drc-referral-materials/",
        "https://drc.uic.edu/drc-exam-proctoring-form-for-instructors/",
        "https://drc.uic.edu/facultystaff/faculty/",
        "https://drc.uic.edu/faculty-resources-for-making-online-course-content-accessible/",
        "https://drc.uic.edu/facultystaff/disability-policies-laws/",
        "https://drc.uic.edu/universal-design/",
        "https://drc.uic.edu/report-an-issue/",
        "https://drc.uic.edu/accommodations-complaint-process/",
        "https://forms.uofi.uic.edu/sec/7074059",
        "https://drc.uic.edu/contact-us/",
        "http://maps.uic.edu/",
        "https://drc.uic.edu/alternative-text-request-form/",
        "https://drc.uic.edu/peer-note-taker-request-form/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}