{
    "url": "https://drc.uic.edu/facultystaff/disability-policies-laws/",
    "title": "Policies and Laws | Disability Resource Center | University of Illinois at Chicago",
    "text": [
        "As mandated by the Americans with Disabilities Act of 1990 (ADA), the Americans with Disabilities Act Amendments of 2008 (ADAAA), and Section 504 of the Rehabilitation Act of 1973 (Section 504) students with a documented disability must be allowed to receive services to augment their education. This includes classroom and outside services such as social groups, support services, counseling, and even mentoring services.",
        "Section 504 of the Rehabilitation Act of 1973",
        "\"No otherwise qualified individual with a disability in the United States . . . shall, solely by reason of her or his disability, be excluded from the participation in, be denied the benefits of, or be subjected to discrimination under any program or activity receiving Federal financial assistance . . . .\"",
        "Section 504 of the Rehabilitation Act of 1973 (Section 504)  is a federal law designed to protect the rights of individuals with disabilities in programs and activities that receive Federal financial assistance from the U.S. Department of Education. Recipients of this Federal financial assistance include public school districts, institutions of higher education, and other state and local education agencies.",
        "Section 504 is a civil rights law that prohibits discrimination against individuals with disabilities. Section 504 ensures equal access to qualified individuals that: (1) have a physical or mental impairment that substantially limits one or more major life activities; or (2) have a record of such an impairment; or (3) be regarded as having such an impairment.",
        "Higher educational institutions are required to provide students with appropriate academic adjustments and auxiliary aids and services that are necessary to afford an individual with a disability an equal opportunity to participate in a school's program. Recipients are not required to make adjustments or provide aids or services that would result in a fundamental alteration of a recipient's program or impose an undue burden.",
        "The Americans with Disabilities Act of 1990 (ADA)",
        "The ADA ensures civil rights protections to individuals with disabilities similar to those provided to individuals on the basis of race, color, sex, national origin, age, and religion. The ADA guarantees equal opportunity for individuals with disabilities in public accommodations, employment, transportation, state and local government services, and telecommunications.",
        "The Americans with Disabilities Act Amendments Act of 2008 (ADAAA)",
        "The Amendments Act made changes to the definition of the term “disability” and its interpretations by the court. It served to clarify and broaden coverage of the ADA , focusing on discriminatory practices as opposed to identification standards."
    ],
    "out_links": [
        "https://drc.uic.edu/",
        "http://uic.edu/",
        "https://drc.uic.edu/about/",
        "https://drc.uic.edu/students-2/rights-and-responsibilities/",
        "https://drc.uic.edu/accommodations/",
        "https://drc.uic.edu/about/people/",
        "https://drc.uic.edu/students-2/new-to-drc/",
        "https://drc.uic.edu/information-about-evaluation-and-assessment/",
        "https://drc.uic.edu/frequently-asked-questions-faq/",
        "https://drc.uic.edu/facultystaff/",
        "https://drc.uic.edu/drc-referral-materials/",
        "https://drc.uic.edu/drc-exam-proctoring-form-for-instructors/",
        "https://drc.uic.edu/facultystaff/faculty/",
        "https://drc.uic.edu/faculty-resources-for-making-online-course-content-accessible/",
        "https://drc.uic.edu/facultystaff/guide-to-accommodations/",
        "https://drc.uic.edu/universal-design/",
        "https://drc.uic.edu/report-an-issue/",
        "https://drc.uic.edu/accommodations-complaint-process/",
        "https://forms.uofi.uic.edu/sec/7074059",
        "https://drc.uic.edu/contact-us/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}