{
    "url": "https://drc.uic.edu/asl-cart-requestform/",
    "title": "ASL and CART Captioning Request Form | Disability Resource Center | University of Illinois at Chicago",
    "text": [
        "UIC is committed to full inclusion and participation of people with disabilities in all aspects of university life. UIC seeks to provide an academic, social and physical environment that makes persons with disability integral to the diversity of perspectives that is vital to an academic community. This includes providing auxiliary aids and services such as American Sign Language (ASL) Interpretation and Communication Access Real-time Translation (CART) live captioning for students, faculty, staff, and members of the public who require and request such accommodations for full participation in UIC classes, events and programming.",
        "Generally, services provided by outside vendors that are requested for accessibility purposes, such as ASL Interpretation, CART Live Captioning, audio description, and creation of closed captioning for video are scheduled and facilitated through the Disability Resource Center, though arrangements may be made outside of the DRC. No student, member of faculty or staff, or community member needing accessibility services, and who has requested services in a timely manner, will be denied the benefit of such services.",
        "Payment for Services",
        "Once services are sought, coordinated, and rendered, the following guidelines will govern the billing process for payment of third party accessibility service vendors.",
        "The Disability Resource Center (DRC) will pay for services rendered when 1) a UIC student or prospective student with a disability is the recipient of the services and 2) the materials, course, or event that services are requested for is required as part of a student’s academic program, or admission into said program.",
        "Accessibility services will be billed to the department hosting the event when a 1) department, student, or member of the public initiates a request for a departmental or public-facing event held on UIC’s campus or otherwise hosted by UIC that is not required for a student’s academic program (even if a registered DRC student is attending) or 2) when a UIC employee registered for accommodations with the Office for Access and Equity (OAE) requires accessibility services to perform the essential functions of their job.",
        "If you have any further questions, contact the Disability Resource Center at 312-413-2183 or by email at drc@uic.edu."
    ],
    "out_links": [
        "https://drc.uic.edu/",
        "http://uic.edu/",
        "https://drc.uic.edu/about/",
        "https://drc.uic.edu/students-2/rights-and-responsibilities/",
        "https://drc.uic.edu/accommodations/",
        "https://drc.uic.edu/about/people/",
        "https://drc.uic.edu/students-2/new-to-drc/",
        "https://drc.uic.edu/information-about-evaluation-and-assessment/",
        "https://drc.uic.edu/frequently-asked-questions-faq/",
        "https://drc.uic.edu/facultystaff/",
        "https://drc.uic.edu/drc-referral-materials/",
        "https://drc.uic.edu/drc-exam-proctoring-form-for-instructors/",
        "https://drc.uic.edu/facultystaff/faculty/",
        "https://drc.uic.edu/faculty-resources-for-making-online-course-content-accessible/",
        "https://drc.uic.edu/facultystaff/guide-to-accommodations/",
        "https://drc.uic.edu/facultystaff/disability-policies-laws/",
        "https://drc.uic.edu/universal-design/",
        "https://drc.uic.edu/report-an-issue/",
        "https://drc.uic.edu/accommodations-complaint-process/",
        "https://forms.uofi.uic.edu/sec/7074059",
        "https://drc.uic.edu/contact-us/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}