{
    "url": "https://cme.uic.edu/undergraduate/admitted-students/",
    "title": "Undergraduate Admitted Students | Department of Civil and Materials Engineering | University of Illinois at Chicago",
    "text": [
        "Welcome to the undergraduate program in civil engineering at UIC!",
        "Congratulations on your acceptance. We look forward to introducing you to the faculty, staff, and fellow students who will help you to develop your knowledge and skills in civil engineering—and set you on your way toward a rewarding career.",
        "We encourage all of our incoming students to visit a few important places to gather all the information you need for a great start at UIC.",
        "UIC has a dedicated page for new undergraduate students. Start here to get all the information you will need as you start your education at UIC.",
        "You will receive one-on-one guidance from our faculty to make sure you are enrolling in the courses you need to complete your degree on time and be well-positioned to achieve your post-graduation goals.",
        "Before you begin your UIC program is a great time to familiarize yourself with all the prospects that await you here—whether it’s courses in environmental engineering or transportation engineering, foundational classes in structural analysis and strength of materials, or finding out how to make computer models of the built world. Start on our courses page; we also recommend you check out the degree requirements and undergraduate course descriptions for civil engineering.",
        "Below are some of the questions that incoming students ask us before they start at UIC. We encourage you to expand each one to gain some key basic information. You also should feel free to explore this entire website to see what awaits you!",
        "Degree requirements are the courses you must complete with passing grades to earn your undergraduate degree. Think of it as the university’s academic contract with you. You can find the degree requirements for the BS in civil engineering here.",
        "All students in the civil and materials engineering department pursue an undergraduate degree in civil engineering, but within that degree, there is choice. Concentrations allow you to add a measure of specialization to your undergraduate degree. We offer five:",
        "For more details on each concentration and the courses they require, visit the civil engineering major page.",
        "You will choose your concentration area electives in consultation with your academic advisor, who is a faculty member. He or she will help you to make choices that will benefit you after UIC. Most concentration courses are 400-level courses in our department, which means you are more likely to take them toward the middle or end of your undergraduate study at UIC.",
        "The curriculum flowchart offers a visual “map” of the civil engineering major, giving you a rough plan for each semester. This is not to say that all students proceed through the program in exactly the same way—you and your faculty advisor may develop a plan that is slightly different. Either way, the flowchart is a helpful guide.",
        "You can download a copy here or on the student resources page.",
        "You should not take a course without having taken the listed prerequisite. If you have any questions, or if you believe strongly that you have a special case that merits an exception, please consult your faculty advisor.",
        "Engineering is driven by advances in research. UIC allows you to participate in research as an undergraduate—and you should!",
        "UIC maintains a website devoted to undergraduate research. Here, you can find faculty members who have active projects that could use some help from interested undergraduates. This is a great way to learn how research is done and to see research in action. Click on the “Students: Start Here” button to find out about current opportunities.",
        "The civil and materials engineering department also has a course called CME 392 Undergraduate Research, which allows you to conduct your own research project with the supervision of a faculty member. Ask your faculty advisor for more information.",
        "Come visit us! One of the advantages of UIC CME is that we are a small, close-knit department that values our students above all. We are happy to answer your questions and work together to resolve your concerns.",
        "You can stop by our department office during regular business hours (Room 2095 of the Engineering Research Facility, commonly known as ERF) or email us at cme@uic.edu."
    ],
    "out_links": [
        "https://cme.uic.edu/",
        "http://uic.edu/",
        "https://cme.uic.edu/undergraduate/",
        "https://cme.uic.edu/undergraduate/admissions/",
        "https://cme.uic.edu/undergraduate/abet-accreditation/",
        "https://cme.uic.edu/undergraduate/civil-engineering-major/",
        "https://cme.uic.edu/undergraduate/courses/",
        "https://cme.uic.edu/undergraduate/minors/",
        "https://cme.uic.edu/undergraduate/internships-and-jobs/",
        "https://cme.uic.edu/undergraduate/student-organizations/",
        "https://cme.uic.edu/undergraduate/undergraduate-student-profiles/",
        "https://cme.uic.edu/undergraduate/student-resources/",
        "https://cme.uic.edu/graduate/",
        "https://cme.uic.edu/graduate/admitted-students/",
        "https://cme.uic.edu/graduate/admissions/",
        "https://cme.uic.edu/graduate/courses/",
        "https://cme.uic.edu/graduate/ms-in-construction-engineering-and-management/",
        "https://cme.uic.edu/graduate/ms-programs/",
        "https://cme.uic.edu/graduate/doctoral-programs/",
        "https://cme.uic.edu/graduate/phd-dissertations/",
        "https://cme.uic.edu/graduate/post-graduation-outcomes/",
        "https://cme.uic.edu/graduate/student-profiles/",
        "https://cme.uic.edu/graduate/student-resources/",
        "https://cme.uic.edu/cme-research/",
        "https://cme.uic.edu/cme-research/labs/highbay/",
        "https://cme.uic.edu/cme-research/labs/",
        "https://cme.uic.edu/cme-research/cme-research-areas/",
        "https://cme.uic.edu/cme-research/students/",
        "https://cme.uic.edu/cme-research/seminars/",
        "https://cme.uic.edu/faculty-and-staff/",
        "https://cme.uic.edu/faculty-and-staff/department-head/",
        "https://cme.uic.edu/faculty-and-staff/faculty/",
        "https://cme.uic.edu/faculty-and-staff/courtesy-and-dual-faculty/",
        "https://cme.uic.edu/faculty-and-staff/emeritus-faculty/",
        "https://cme.uic.edu/faculty-and-staff/faculty-awards/",
        "https://cme.uic.edu/faculty-and-staff/cepac/",
        "https://cme.uic.edu/faculty-and-staff/staff/",
        "https://cme.uic.edu/faculty-and-staff/open-positions/",
        "https://cme.uic.edu/cme-news/",
        "https://cme.uic.edu/cme-events/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://admissions.uic.edu/undergraduate/application-process/newly-admitted-students",
        "http://cme.uic.edu/undergraduate/courses/",
        "https://catalog.uic.edu/ucat/colleges-depts/engineering/cme/bs-cive/",
        "https://catalog.uic.edu/ucat/course-descriptions/cme/",
        "http://cme.uic.edu/undergraduate/civil-engineering-major/",
        "http://cme.uic.edu/undergraduate/student-resources/",
        "https://ure.uic.edu/",
        "https://cme.uic.edu/cme-room-reservation-form/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}