{
    "url": "https://ecc.uic.edu/international-students/",
    "title": "International Students | Engineering Career Center | University of Illinois at Chicago",
    "text": [
        "The Engineering Career Center is dedicated to supporting UIC international students with their job and/or internship search. Below you will find resources to assist you with your employment search, as well as the CPT and OPT application processes. Please also review the FAQ section below for information on tuition pricing, and how to obtain a Social Security Number.",
        "Students: please note during the academic year you can work a maximum of 20 hours on CPT. The 20 hours is combined between both external internships and also on-campus positions (e.g. if you work 10 hours for an external internship, you can only work 10 hours in an on-campus position). During the summer session, international students can work 40 hours a week on CPT.",
        "UIC Summer Session Registration UPDATED: class registration will now begin on April 15th for UIC students. Check your Time Ticket to see your specific registration date and time for the summer session.",
        "International students must complete a Curricular Practical Training (CPT) application in order to obtain work authorization for off-campus internships. The Engineering Career Center can assist you with the CPT application process.",
        "The Engineering Career Center DOES NOT process Optional Practical Training (OPT) applications for full-time employment. If you have obtained a full-time position, and need help with your OPT application, please visit with the Office of International Students (OIS) at UIC.",
        "",
        "International students may face unique challenges in the job search process, so we’ve compiled some resources to help.",
        "International students should use the ECC’s Career Readiness Tools for advice on resumes, cover letters, interviewing, negotiating offers, and more.",
        "If you have determined that the ECC can help with your CPT application:",
        "Your CPT application will be processed once:",
        "From the time you drop off the CPT application at OIS, it can take up to 14 days to process your I-20.",
        "You must first determine whether you are eligible to have the ECC assist you with your CPT application.",
        "You do not need to bring your current I-20, social security card, or passport.",
        "One CPT application can last as long as the academic term in which it is processed. You must complete a new CPT application for each semester that you intern (Fall, Spring, and Summer).",
        "For Students Registering for ENGR 289:",
        "The Office of International Services has a wonderful handout on how to obtain a Social Security Number.",
        "Please note that as of March 17th, some Social Security Offices are now closed as a result of COVID-19. They are however still providing services online.",
        "If you have any additional questions about obtaining a social security number, please visit the Office of International Services.",
        "Letter of Support – created by the ECC",
        "Your CPT application process is complete after:",
        "Undergraduate and graduate students who are on academic probation may not apply for CPT during the academic year. Academic probation is a serious concern and puts students at risk for dismissal from UIC. Therefore, students applying for CPT during the Fall or Spring semesters will be denied – students should use their time during the academic year to focus on coursework and getting off of academic probation.",
        "Undergraduate and graduate students who are on academic probation and obtain an internship over the summer months, may apply for CPT.",
        "An undergraduate student is placed on academic probation at the end of any term in which the student earns less than a 2.00/4.00 grade point average. This rule applies even for the student with a cumulative GPA of 2.00/4.00 or higher. For more information on UIC’s probation and dismissal rules, please review the UIC course catalog.",
        "A graduate student is placed on academic probation when their grade point average falls below a 3.00. For more information on UIC’s probation and dismissal rules for graduate students, please visit the UIC Graduate College.",
        "Contact the Office of International Services (OIS) at UIC: 312-996-3121 or visit the OIS website for more information.",
        "OIS hosts open advising Monday-Thursday from 10:30am-3:30pm. Friday is by appointment only.",
        "I did my Master’s in Industrial Engineering. After graduating I was searching for a job but it was difficult out there. I was not able to get the desired outcome as needed. I knew something was going wrong in my job search.",
        "That’s when ECC came in. I took serious efforts in improving my resume, interview skills, etc., and the ECC helped me a lot. When I was a student I hardly visited them, but as an alum, I started visiting them regularly. They were very helpful. They helped me a lot by giving me job search tips, conducting mock interviews, and preparing me for opportunities. I started getting more and more interview calls, and finally I landed a job.",
        "I would advise all the current students to start seeking help from the ECC from early on so that you are ready for the opportunity when it knocks your door. I would again like to THANK the ECC for helping me out. Thank you."
    ],
    "out_links": [
        "https://ecc.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/",
        "http://engineeringalumni.uic.edu/",
        "https://www.ois.uic.edu/",
        "http://studentemployment.uic.edu/",
        "http://careerservices.uic.edu/",
        "https://counseling.uic.edu/",
        "https://ecc.uic.edu/this-week-archives/",
        "https://ecc.uic.edu/career-toolbox/",
        "https://ecc.uic.edu/career-toolbox/resume/",
        "https://ecc.uic.edu/career-toolbox/cover-letter/",
        "https://ecc.uic.edu/career-toolbox/go-search/",
        "https://ecc.uic.edu/career-toolbox/networking/",
        "https://ecc.uic.edu/career-toolbox/linkedin/",
        "https://ecc.uic.edu/career-toolbox/interviewing/",
        "https://ecc.uic.edu/career-toolbox/following-up/",
        "https://ecc.uic.edu/career-toolbox/negotiating/",
        "https://ecc.uic.edu/career-toolbox/meet/",
        "https://ecc.uic.edu/students/",
        "https://ecc.uic.edu/students/search-uiccareers/",
        "https://ecc.uic.edu/students/graduation-survey-results/",
        "https://ecc.uic.edu/students/international-students/",
        "https://ecc.uic.edu/students/diverse-student-groups/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://ecc.uic.edu/students/mentor-students/",
        "https://ecc.uic.edu/students/freshman-internship-program/",
        "https://ecc.uic.edu/students/transfer-internship-program/",
        "https://ecc.uic.edu/students/alumni/",
        "https://ecc.uic.edu/employers/",
        "https://ecc.uic.edu/employers/services-to-employers/",
        "https://ecc.uic.edu/employers/post-openings-uiccareers/",
        "https://ecc.uic.edu/employers/graduation-survey-results/",
        "https://ecc.uic.edu/employers/career-fairs/",
        "https://ecc.uic.edu/employers/mentoring-program/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://ecc.uic.edu/employers/hiring-international-students/",
        "https://ecc.uic.edu/events-2/",
        "https://ecc.uic.edu/events-2/find-local-events/",
        "https://ecc.uic.edu/events-2/engineering-career-fair/",
        "https://ecc.uic.edu/contact/",
        "https://ecc.uic.edu/meet-the-staff/",
        "http://maps.uic.edu/",
        "https://summer.uic.edu/uic-students/registering",
        "https://www.ois.uic.edu/home/",
        "http://ecc.uic.edu/meet/",
        "https://registrar.uic.edu/tuition/grad/graduate-tuition-summer-2018",
        "http://summer.uic.edu/uic-students/tuition_and_fees",
        "https://www.ois.uic.edu/aboutois/hours_and_location",
        "https://catalog.uic.edu/ucat/degree-programs/academic-standing/",
        "https://grad.uic.edu/academic-support/graduate-college-policies/academic-standing-continuation-and-probation-rules/",
        "http://www.ois.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}