{
    "url": "https://cme.uic.edu/graduate/admitted-students/",
    "title": "Admitted Graduate Students | Department of Civil and Materials Engineering | University of Illinois at Chicago",
    "text": [
        "We look forward to your arrival on campus to begin graduate study in civil and materials engineering. This is a phase of your education in which you fully tap the potential to conduct your own investigations and take ownership of your research discoveries. At UIC, you will expand your knowledge of the field and sharpen your skills in independent inquiry.",
        "The civil and materials engineering department offers outstanding graduate programs taught by highly regarded faculty who represent diverse backgrounds and areas of research expertise. Graduate students collaborate on work funded by the National Science Foundation and other prestigious sponsors. UIC’s College of Engineering is a thriving institution, driven by the value proposition offered by a Carnegie 1 public research university in the heart of Chicago.",
        "We welcome you to our UIC CME family.",
        "With the start of your program coming up, we encourage you to familiarize yourself with information that will help you become a successful new student. This page offers easy access to the resources that new MS and PhD students need to get started at UIC. If, after reading this page, you still have any questions, please contact us at cme@uic.edu. We are happy to help you and look forward to meeting you!",
        "Visit our Admitted Student Guide for important information and next steps in the matriculation process, including activating your UIC account and accessing the my.UIC.edu portal. You will need your university identification number (UIN) and assigned “token.” Once you have activated your my.UIC account, you will be able to manage all aspects of your education at UIC through this site. The portal has information on UIC e-mail, registration, academic records, financial records, and more.",
        "All students should plan on attending the Graduate College new student orientation and the CME graduate student orientation in August. Registration is required for the Graduate College new student orientation. Notification of the CME graduate student orientation will sent by email.",
        "International students on a visa can enter the country 30 days prior to the start of the term. We strongly suggest you arrive early enough to allow plenty of time to find housing, register for classes and get acclimated to campus. International students are required to attend an additional Office of International Services (OIS) student orientation.",
        "Departmental advising is not required for registration. Students are responsible for reading the graduate program information and selecting courses for which they have the background. Please review prerequisites when selecting coursework. Students who have specific questions on course content should consult with the appropriate course instructor directly. Students who experience registration issues or need clarification on program rules may contact the student affairs office.",
        "All of our graduate courses are geared for students with an undergraduate degree in civil or materials engineering or an equivalent understanding. Rules and minimum requirements for class levels will be discussed during the CME graduate student orientation.",
        "New CME graduate students may be required to attend a number of orientation events depending on their specific academic and personal situations. The orientation sessions include:",
        "All new CME graduate students are strongly encouraged to attend this session. Degree requirements, department policies, student expectations, and other important topics are covered in this session. This orientation is held only once per year, prior to the start of the fall semester.",
        "A confirmation of date and location will be sent by the CME student affairs office to new students. Students who start in the spring semester must attend this orientation in the fall after they begin at UIC.",
        "This orientation is conducted by UIC’s International Teaching Assistant Program and is mandatory for ALL new TAs. New international TAs will attend the OIS ‘New International Student Summit’ on the same day but will be dismissed in time to attend the TA orientation. Information, including dates and times, is updated on the ITAP website.",
        "UIC’s Office of International Services (OIS) runs an orientation program that is mandatory for all new international students. There is an orientation fee for this program, which is charged to international students’ accounts. Visit the OIS website for information and schedules.",
        "UIC’s Graduate College holds an orientation session for new graduate students from across UIC’s colleges each fall. There is no session in the spring term. Limited spaces are available for this orientation, which has no fee, and registration is required. The CME department highly recommends that new graduate students choose to attend. Learn more on the Graduate College orientation page."
    ],
    "out_links": [
        "https://cme.uic.edu/",
        "http://uic.edu/",
        "https://cme.uic.edu/undergraduate/",
        "https://cme.uic.edu/undergraduate/admitted-students/",
        "https://cme.uic.edu/undergraduate/admissions/",
        "https://cme.uic.edu/undergraduate/abet-accreditation/",
        "https://cme.uic.edu/undergraduate/civil-engineering-major/",
        "https://cme.uic.edu/undergraduate/courses/",
        "https://cme.uic.edu/undergraduate/minors/",
        "https://cme.uic.edu/undergraduate/internships-and-jobs/",
        "https://cme.uic.edu/undergraduate/student-organizations/",
        "https://cme.uic.edu/undergraduate/undergraduate-student-profiles/",
        "https://cme.uic.edu/undergraduate/student-resources/",
        "https://cme.uic.edu/graduate/",
        "https://cme.uic.edu/graduate/admissions/",
        "https://cme.uic.edu/graduate/courses/",
        "https://cme.uic.edu/graduate/ms-in-construction-engineering-and-management/",
        "https://cme.uic.edu/graduate/ms-programs/",
        "https://cme.uic.edu/graduate/doctoral-programs/",
        "https://cme.uic.edu/graduate/phd-dissertations/",
        "https://cme.uic.edu/graduate/post-graduation-outcomes/",
        "https://cme.uic.edu/graduate/student-profiles/",
        "https://cme.uic.edu/graduate/student-resources/",
        "https://cme.uic.edu/cme-research/",
        "https://cme.uic.edu/cme-research/labs/highbay/",
        "https://cme.uic.edu/cme-research/labs/",
        "https://cme.uic.edu/cme-research/cme-research-areas/",
        "https://cme.uic.edu/cme-research/students/",
        "https://cme.uic.edu/cme-research/seminars/",
        "https://cme.uic.edu/faculty-and-staff/",
        "https://cme.uic.edu/faculty-and-staff/department-head/",
        "https://cme.uic.edu/faculty-and-staff/faculty/",
        "https://cme.uic.edu/faculty-and-staff/courtesy-and-dual-faculty/",
        "https://cme.uic.edu/faculty-and-staff/emeritus-faculty/",
        "https://cme.uic.edu/faculty-and-staff/faculty-awards/",
        "https://cme.uic.edu/faculty-and-staff/cepac/",
        "https://cme.uic.edu/faculty-and-staff/staff/",
        "https://cme.uic.edu/faculty-and-staff/open-positions/",
        "https://cme.uic.edu/cme-news/",
        "https://cme.uic.edu/cme-events/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://admissions.uic.edu/graduate-professional/application-process/newly-admitted-students",
        "http://my.uic.edu/",
        "https://grad.uic.edu/graduate-college-new-student-orientation",
        "https://www.ois.uic.edu/cms/one.aspx?pageId=213600&portalId=1581",
        "https://www.ois.uic.edu/",
        "http://idcenter.uic.edu/",
        "http://idcenter.uic.edu/cta-u-pass/",
        "http://cme.uic.edu/graduate/student-resources/",
        "http://grad.uic.edu/",
        "https://my.uic.edu/uPortal/f/welcome/normal/render.uP",
        "https://www.ois.uic.edu/resources/social_security_number",
        "https://www.ois.uic.edu/resources/money__banking",
        "https://grad.uic.edu/campus-wide-new-ta-orientation",
        "http://grad.uic.edu/graduate-college-new-student-orientation",
        "https://grad.uic.edu/admissions",
        "https://cme.uic.edu/graduate/admissions/financial-aid-funding/",
        "https://cme.uic.edu/graduate/admissions/faq/",
        "https://cme.uic.edu/graduate/doctoral-programs/qualifying-examination/",
        "https://cme.uic.edu/graduate/doctoral-programs/preliminary-examination/",
        "https://cme.uic.edu/graduate/doctoral-programs/dissertation-process/",
        "https://cme.uic.edu/cme-room-reservation-form/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}