{
    "url": "https://cme.uic.edu/graduate/ms-programs/",
    "title": "MS Programs | Department of Civil and Materials Engineering | University of Illinois at Chicago",
    "text": [
        "Our department offers three master’s degrees: an MS in Civil Engineering, an MS in Materials Engineering, and a new MS in Construction Engineering and Management. In general, MS degrees are an excellent choice for students who seek higher-level jobs in industry and want to expand their knowledge base in the field.",
        "Get acquainted with all of our master’s-level programs in our MS degree overview booklet (PDF).",
        "If you are looking for information on MS programs in civil and materials engineering, see below for details on requirements and options. In addition to providing knowledge and skills for jobs in industry, these two programs set the stage for an eventual doctoral degree, if you decide you wish to go on for further study.",
        "If you are looking for information on the MS in construction engineering and management program, please visit its program page.",
        "Civil engineering is a broad-based discipline that encompasses many specialties in the areas of structural engineering and mechanics, environmental engineering, geotechnical engineering, and transportation engineering. Through the careful selection of courses, you can tailor the UIC MS in Civil Engineering program to meet your interests and needs.",
        "Students pursuing the MS in Civil Engineering may choose between two options to complete their degree:",
        "A thesis option, which provides the opportunity to gain research experience and is ideal for students who may be considering PhD study in the future. Thesis students often make connections in the field that can lead to career advice, research sponsorship, or other forms of funding.",
        "A coursework-only option, intended for students who seek additional knowledge or who hope to obtain a professional license in the civil engineering field. This option is available for part-time as well as full-time students.",
        "MS in Civil Engineering students also have the opportunity to focus their study in a specific area of concentration, which helps to target their master’s degree experience toward their desired outcomes. Our concentration choices include:",
        "Graduate studies in construction engineering and management mainly focus on best practices in Integrated Construction Project Management (IPM).",
        "Students learn how to optimize construction projects in the face of multiple and varied constraints, such as budgets, schedules, risk, quality requirements, human resources, communication channels, procurement practices, and stakeholder management.",
        "Students in this concentration explore the interdisciplinary connections that exist between construction engineering and other areas of society and economics. Examples include:",
        "The environmental engineering concentration at UIC is broadly conceived, extending beyond the traditional boundaries of the field.",
        "This concentration covers topics such as:",
        "Courses in this concentration draw on the expertise of faculty from several other UIC departments, such as biology, chemical engineering, chemistry, environmental and occupational health sciences, geology, mathematics, and mechanical and industrial engineering. The involvement of these faculty members in our program allows students to explore a wide range of topics in the water resources and environmental engineering field.",
        "The geotechnical and geoenvironmental engineering area of concentration encompasses classical geotechnical engineering—analyzing and designing foundations, retaining structures, and underground structures—as well as environmental geotechnics, such as designing waste containment systems and performing remediation studies.",
        "Students are able to work with faculty whose research addresses a variety of subjects in this area, including environmental geotechnics (e.g. the characterization, containment, remediation, and performance of contaminated materials), earthquake engineering, pavement analysis, and geomechanics.",
        "MS students in the structural engineering and structural mechanics concentration learn static and dynamic analysis of linear and nonlinear structures including modal analysis, the behavior of structural materials, and the design of structural systems in concrete and steel.",
        "Students examine both current and potential problems in structural engineering. Topics covered include, but are not limited to:",
        "This curriculum provides a strong foundation for advanced work in professional practice, research, and teaching. It lays the groundwork for careers in private consulting or construction firms, industrial and governmental research laboratories, and universities, among others.",
        "The transportation engineering concentration is oriented toward methods for the planning, design, and operation of surface transportation systems.",
        "Through their coursework and research, students work alongside faculty to learn about and develop solutions to problems related to surface transportation facilities (infrastructure) through the application of optimization and simulation methods, as well as knowledge-based systems. In recent years, the faculty has also engaged in the design and evaluation of intelligent transportation systems.",
        "The curriculum requirements for the MS in Civil Engineering vary based on whether students select the thesis option or the coursework-only option. Expand the sections below to view the curriculum plan for each option.",
        "Required credit hours: 36",
        "Credit hours from coursework: 24",
        "Credit hours from thesis research: 12",
        "As part of their 24 credit hours of coursework, MS thesis students must complete a minimum of 12 credits from 500-level courses. Of these 12 credits, 8 must be from courses with CME course codes, excluding CME 596, and 4 may come from either CME or COE courses, excluding CME 596 or its equivalent.",
        "The remaining 12 credit hours of coursework must come from 400-level or 500-level CME or COE courses. Only one instance of CME 596 or its equivalent will be accepted toward graduation. CME 496 or its equivalent does not count for graduation credit, and 400-level ENGR courses are not accepted. Any course outside of the College of Engineering must receive prior approval from the academic advisor.",
        "The 12 credit hours of research come from enrolling in CME 598.",
        "Required credit hours: 36",
        "Credit hours from coursework: 36",
        "As part of their 36 credit hours of coursework, MS course-work only students must complete a minimum of 12 credits from 500-level courses. Of these 12 credits, 8 must be from courses with CME course codes, excluding CME 596, and 4 may come from either CME or COE courses, excluding CME 596 or its equivalent.",
        "The remaining 24 credit hours of coursework must come from 400-level or 500-level CME or COE courses. Only one instance of CME 596 or its equivalent will be accepted toward graduation. CME 496 or its equivalent does not count for graduation credit, and 400-level ENGR courses are not accepted. Any course outside of the College of Engineering must receive prior approval from the academic advisor.",
        "Materials—including metals, intermetallics, polymers, ceramics, composites, and electronic materials—are critical to modern industrial society. Materials engineering is an expansive field that encompasses many specialties and offers rich opportunities for interdisciplinary collaboration.",
        "Materials engineering addresses the design, manufacture, and characterization of materials for specific applications. Materials development is an enabling step to the production of advanced engineering devices. Materials selection is a key element in the design, manufacturing, and quality control of structures and devices.",
        "Because UIC and many other universities do not offer an undergraduate program in materials engineering, it is common for students with degrees in relevant subjects other than materials engineering to pursue this degree and enter the field. Our faculty help our graduate students in materials engineering to design an individualized academic program that makes use of the strengths in their background and gives them the knowledge and skills needed to move forward.",
        "The MS in Materials Engineering is offered as a thesis option, a research-oriented degree that provides research experience and potential pathways toward research sponsorship or other funding, or a coursework-only option.",
        "The areas of concentration for this master’s program are:",
        "Topics of focus in the materials processing and characterization concentration include:",
        "Topics of focus in the mechanics of solids concentration include:",
        "The curriculum requirements for the MS in Materials Engineering vary based on whether students select the thesis option or the coursework-only option. Expand the sections below to view the curriculum plan for each option.",
        "Required credit hours: 36",
        "Credit hours from coursework: 24",
        "Credit hours from thesis research: 12",
        "As part of their 24 credit hours of coursework, MS thesis students must complete a minimum of 12 credits from 500-level courses. Of these 12 credits, 8 must be from courses with CME course codes, excluding CME 596, and 4 may come from either CME or COE courses, excluding CME 596 or its equivalent.",
        "The remaining 12 credit hours of coursework must come from 400-level or 500-level CME or COE courses. Only one instance of CME 596 or its equivalent will be accepted toward graduation. CME 496 or its equivalent does not count for graduation credit, and 400-level ENGR courses are not accepted. Any course outside of the College of Engineering must receive prior approval from the academic advisor.",
        "The 12 credit hours of research come from enrolling in CME 598.",
        "Required credit hours: 36",
        "Credit hours from coursework: 36",
        "As part of their 36 credit hours of coursework, MS course-work only students must complete a minimum of 12 credits from 500-level courses. Of these 12 credits, 8 must be from courses with CME course codes, excluding CME 596, and 4 may come from either CME or COE courses, excluding CME 596 or its equivalent.",
        "The remaining 24 credit hours of coursework must come from 400-level or 500-level CME or COE courses. Only one instance of CME 596 or its equivalent will be accepted toward graduation. CME 496 or its equivalent does not count for graduation credit, and 400-level ENGR courses are not accepted. Any course outside of the College of Engineering must receive prior approval from the academic advisor."
    ],
    "out_links": [
        "https://cme.uic.edu/",
        "http://uic.edu/",
        "https://cme.uic.edu/undergraduate/",
        "https://cme.uic.edu/undergraduate/admitted-students/",
        "https://cme.uic.edu/undergraduate/admissions/",
        "https://cme.uic.edu/undergraduate/abet-accreditation/",
        "https://cme.uic.edu/undergraduate/civil-engineering-major/",
        "https://cme.uic.edu/undergraduate/courses/",
        "https://cme.uic.edu/undergraduate/minors/",
        "https://cme.uic.edu/undergraduate/internships-and-jobs/",
        "https://cme.uic.edu/undergraduate/student-organizations/",
        "https://cme.uic.edu/undergraduate/undergraduate-student-profiles/",
        "https://cme.uic.edu/undergraduate/student-resources/",
        "https://cme.uic.edu/graduate/",
        "https://cme.uic.edu/graduate/admitted-students/",
        "https://cme.uic.edu/graduate/admissions/",
        "https://cme.uic.edu/graduate/courses/",
        "https://cme.uic.edu/graduate/ms-in-construction-engineering-and-management/",
        "https://cme.uic.edu/graduate/doctoral-programs/",
        "https://cme.uic.edu/graduate/phd-dissertations/",
        "https://cme.uic.edu/graduate/post-graduation-outcomes/",
        "https://cme.uic.edu/graduate/student-profiles/",
        "https://cme.uic.edu/graduate/student-resources/",
        "https://cme.uic.edu/cme-research/",
        "https://cme.uic.edu/cme-research/labs/highbay/",
        "https://cme.uic.edu/cme-research/labs/",
        "https://cme.uic.edu/cme-research/cme-research-areas/",
        "https://cme.uic.edu/cme-research/students/",
        "https://cme.uic.edu/cme-research/seminars/",
        "https://cme.uic.edu/faculty-and-staff/",
        "https://cme.uic.edu/faculty-and-staff/department-head/",
        "https://cme.uic.edu/faculty-and-staff/faculty/",
        "https://cme.uic.edu/faculty-and-staff/courtesy-and-dual-faculty/",
        "https://cme.uic.edu/faculty-and-staff/emeritus-faculty/",
        "https://cme.uic.edu/faculty-and-staff/faculty-awards/",
        "https://cme.uic.edu/faculty-and-staff/cepac/",
        "https://cme.uic.edu/faculty-and-staff/staff/",
        "https://cme.uic.edu/faculty-and-staff/open-positions/",
        "https://cme.uic.edu/cme-news/",
        "https://cme.uic.edu/cme-events/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://grad.uic.edu/admissions",
        "https://cme.uic.edu/graduate/admissions/financial-aid-funding/",
        "https://cme.uic.edu/graduate/admissions/faq/",
        "https://cme.uic.edu/graduate/doctoral-programs/qualifying-examination/",
        "https://cme.uic.edu/graduate/doctoral-programs/preliminary-examination/",
        "https://cme.uic.edu/graduate/doctoral-programs/dissertation-process/",
        "https://cme.uic.edu/cme-room-reservation-form/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}