{
    "url": "https://counseling.uic.edu/about-us/meet-our-staff/",
    "title": "Meet Our Staff | Counseling Center | University of Illinois at Chicago",
    "text": [
        "The Counseling Center is staffed by licensed psychologists, psychiatrists, post-doctoral clinicians, and advanced doctoral psychology trainees. All are trained to help students with a wide range of personal problems, emotional and psychological difficulties, career questions, and relationship issues. The Counseling Center staff adheres to all relevant ethical codes of conduct and state and federal laws and regulations. The staff is committed to the highest standards of competency in meeting the needs of individuals from diverse backgrounds, including differences of culture, race, ethnicity, national origin, class, gender, ability, age, and sexual orientation.",
        "Assistant Director for Paraprofessional Training, Staff Psychologist",
        "(The Chicago School of Professional Psychology, 2011)",
        "Areas of special interest: Depression, men’s issues, LGBTQ issues, couples therapy, multicultural counseling, adult children of alcoholics, family of origin issues, suicide prevention, relationship issues, identity/self-esteem/self-confidence issues, community psychology, and counselor training and development.",
        "Liaison to: Psychology Department, Social Work, Study Abroad Office, College of Liberal Arts and Sciences (LAS), and Library",
        "Assistant Director for Mind/Body Programs, Staff Psychologist",
        "(California School of Professional Psychology- Alliant International University, 2011)",
        "Areas of special interest: Mindfulness meditation, mind/body wellness, eating disorders and body image, multiculturalism, abuse and trauma, relational issues, family-of-origin concerns, identity development, and self-compassion.",
        "Liaison to: Graduate College, Athletics, College of Nursing, and Campus Housing (West Campus)",
        "Staff Psychologist",
        "(University of Georgia, 2015)",
        "Areas of special interest: Multicultural counseling, diversity and social justice, grief and loss, women’s issues, abuse and trauma, training and supervision, suicide prevention, and relationship issues.",
        "Liaison to: College of Medicine, Language and Cultural Learning Center, Office of Diversity, and Arab American Cultural Center",
        "Director, Staff Psychologist",
        "(Loyola University Chicago, 1985)",
        "Areas of special interest: Administration of mental health services in university settings, brief therapies, consultation and psychoeducational outreach, and supervision/mentoring of trainees.",
        "Liaison to: Campus Police, Family Medicine/Student Health, Legal Counsel, Neuropsychiatric Institute (NPI)/Campus Care, University Hospital/ER, and Office of Diversity",
        "Assistant Director for Training, Staff Psychologist",
        "(Chicago School of Professional Psychology, 2011)",
        "Areas of special interest: Depression, women’s issues, working with immigrant and international students, trauma, identity exploration, grief/loss, existential issues, mindfulness and self-compassion, sexual assault awareness and prevention, and counselor training and development.",
        "Liaison to: Chancellor’s Committee on the Status of Women, Campus Housing (East Campus), Office of International Services (OIS), and College of Urban Planning and Public Affairs",
        "Assistant Director for Clinical Services, Staff Psychologist",
        "(The Chicago School of Professional Psychology, 2007)",
        "Areas of special interest: Trauma, relational issues, gender identity and sexual orientation concerns, autism spectrum issues, social justice, chronic medical issues, and grief and loss.",
        "Liaison to: College of Applied Health Sciences, Chancellor’s Committee on the Status of LGBTQI Peoples and Allies, Chancellor’s Committee on the Status of Persons with Disabilities, Disability Resource Center, and Gender and Sexuality Center",
        "Staff Psychologist",
        "(Virginia Commonwealth University, 2016)",
        "Areas of special interest: Group psychotherapy, family and relationship concerns, depression, anxiety, OCD, trauma, social justice, identity and character development, forgiveness, humility, and positive psychology.",
        "Liaison to: Academic Center for Excellence, Campus Ministries, Commuter Resource Center, and Campus Housing (South Campus)",
        "Associate Director for Clinical Services, Staff Psychologist",
        "(University of North Carolina, 1988)",
        "Areas of special interest: Eating disorders, treatment of trauma, women’s mental health, social justice, and research and technology.",
        "Liaison to: College of Architecture & the Arts, College of Dentistry, Family Medicine/Student Health, Neuropsychiatric Institute (NPI)/Campus Care, and Office of Applied Psychological Services",
        "Staff Psychologist",
        "(University of Kentucky, 2017)",
        "Areas of special interest: International students’ concerns, group therapy, relational dynamics, minority identity development, couples therapy, social justice and advocacy, and trauma.",
        "Liaison to: College of Education, Office of International Services (OIS), Office of the Vice Provost for Student Inclusion, Asian American Resource Center (AARC), and Chancellor’s Committee on the Status of Asian Americans",
        "Staff Psychologist",
        "(Roosevelt University, 2013)",
        "Areas of special interest: Multicultural counseling, diversity and social justice, student persistence and retention, training and supervision, anxiety disorders, substance use disorders, and anger management.",
        "Liaison to: African American Academic Network (AAAN), Career Services, the CHANCE Program, and the Chancellor’s Committee on the Status of Blacks",
        "Staff Psychologist",
        "(The Chicago School of Professional Psychology, 2013)",
        "Areas of special interest: Relationship and family concerns/issues, depression, anxiety, trauma and inter-generational trauma, grief and loss, identity exploration, academic issues, culturally sensitive counseling, supervision and training.",
        "Liaison to: College of Engineering, LARES/Latin American Cultural Center, Native American Support, and Office for Student Veterans (DOS)",
        "Case Manager",
        "(University of Illinois’ Jane Addams College of Social Work – Chicago, 2009)",
        "Areas of interest: Paraprofessional administration, supervising/mentoring student volunteers, mental health issues, college adjustment issues, social justice, multicultural issues, relational issues, and family issues.",
        "Liaison to: Chancellor’s Committee on the Status of Latinos/as and Undocumented Students Task Force, and Office of Applied Psychological Services",
        "Assistant Director for Psychiatry & Integrative Medicine, Staff Psychiatrist",
        "(Baylor College of Medicine, 2001)",
        "Areas of special interest: Psychiatric management of college mental health, women’s mental health, mood and anxiety disorders, Integrative Holistic Medicine, and Clinical Nutrition and its application in mental health treatment.",
        "Liaison to: Family Medicine/Student Health, Neuropsychiatric Institute (NPI)/Campus Care, and University Hospital/ER",
        "Associate Director for Training, Staff Psychologist",
        "(Illinois School of Professional Psychology, 1997)",
        "Areas of special interest: Training and supervision, relational issues (including couples, family and parenting concerns), gender issues, and substance abuse.",
        "Liaison to: The Wellness Center, Women’s Affairs/Campus Advocacy Network, The Writing Center, and TRIO",
        "Assistant Director for Group Psychotherapy, Staff Psychologist",
        "(The Chicago School of Professional Psychology, 2012)",
        "Areas of special interest: Relational and family-of-origin concerns/issues, complex personality concerns/issues, gender issues, couples counseling, group psychotherapy, supervision and training, and identity development.",
        "Liaison to: College of Business Administration, College of Pharmacy, and Honors College",
        "Assistant Director for Outreach, Staff Psychologist",
        "(University of Louisville, 2015)",
        "Areas of special interest: Relationship and family-of-origin concerns/issues, couples counseling, group psychotherapy, grief and loss, anxiety, supervision and training, and identity development.",
        "Liaison to: Campus Programs, School of Public Health, Athletics, and Student Development Services and Orientation",
        "(The Chicago School of Professional Psychology, 2019)",
        "Areas of special interest: Trauma, grief and loss, religion and spirituality, mindfulness, LGBTQIA issues, identity development, multiculturalism, group psychotherapy.",
        "(University of Missouri-Columbia, 2019)",
        "Areas of special interest: Mood and anxiety disorders, disordered eating, grief and loss, perfectionism, family of origin concerns, career self-efficacy and development, self-compassion, and feminist-multicultural therapy.",
        "Michael Acosta, M.A. (University of Hartford, Clinical Psychology)",
        "Courtney Dinsmore, M.Psy. (George Washington University, Clinical Psychology)",
        "Yue Li, M.S., M.Ed. (Indiana University – Bloomington, Counseling Psychology)",
        "Yun Lu, M.A. (University of Maryland, Counseling Psychology)",
        "Angela Green, M.A. (Midwestern University)",
        "Jayne Kenny, B.A. (Argosy – Illinois School of Professional Psychology)",
        "Sarah Khazoum, M.A. (Roosevelt University)",
        "Stephanie Sommers, M.A. (Roosevelt University)"
    ],
    "out_links": [
        "https://counseling.uic.edu/",
        "http://uic.edu/",
        "https://counseling.uic.edu/about-us/",
        "https://counseling.uic.edu/about-us/mission-and-values/",
        "https://counseling.uic.edu/about-us/scope-of-practice/",
        "https://counseling.uic.edu/about-us/hours-and-location/",
        "https://counseling.uic.edu/services/",
        "https://counseling.uic.edu/services/what-to-expect/",
        "https://counseling.uic.edu/services/individual-therapy/",
        "https://counseling.uic.edu/services/group-therapy/",
        "https://counseling.uic.edu/services/couples-therapy/",
        "https://counseling.uic.edu/services/mind-body-services/",
        "https://counseling.uic.edu/services/psychiatry-and-integrative-medicine/",
        "https://counseling.uic.edu/services/outreach-services-and-programs/",
        "https://counseling.uic.edu/services/usn/",
        "https://counseling.uic.edu/crisis-services/",
        "https://counseling.uic.edu/online-resources/suicide-prevention-and-education-at-uic/",
        "https://counseling.uic.edu/online-resources/",
        "https://counseling.uic.edu/news-stories/introducing-counseling-center-e-newsletters/",
        "https://counseling.uic.edu/online-resources/mental-health-resources/",
        "https://counseling.uic.edu/online-resources/coping-with-recent-events/",
        "https://dos.uic.edu/infostudents.shtml",
        "https://counseling.uic.edu/faculty-staff-concerned-others/",
        "https://counseling.uic.edu/faculty-staff-concerned-others/for-parents-facultystaff-and-concerned-others/",
        "https://counseling.uic.edu/online-resources/suicide-prevention-and-education-at-uic/helping-someone-in-distress/",
        "https://counseling.uic.edu/training/",
        "https://counseling.uic.edu/training/internship/",
        "https://counseling.uic.edu/training/externship/",
        "https://counseling.uic.edu/training/postdoctoral-fellowship/",
        "https://counseling.uic.edu/training/usn_training/",
        "https://dos.uic.edu/uicare.shtml",
        "http://sa.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}