{
    "url": "https://counseling.uic.edu/services/what-to-expect/",
    "title": "What to Expect | Counseling Center | University of Illinois at Chicago",
    "text": [
        "The first step to getting connected to counseling services is to schedule an initial consultation appointment. Though availability for the initial consultation appointment varies across the year, we do our best to meet with you as soon as possible. The receptionist will speak with you about the reasons you are seeking assistance and will schedule you with an appropriate counselor. If you are experiencing a mental health crisis, please be sure to let us know.",
        "The first thing you will be asked to do when you arrive to your initial consultation appointment is to complete preliminary information forms using a computer in our reception area. (If you are not able to use the computer, alternate means to complete these forms can be provided.) These forms ask about demographic and contact information, as well as your reasons for pursuing counseling services. You will also be asked to read and sign forms that explain our confidentiality policy and your rights and responsibilities in counseling. In order to ensure there is enough time to complete this process, we ask that you arrive 30 minutes prior to your scheduled appointment time. After you have completed all forms, this information goes to the receptionist, who will make them available to your scheduled counselor to review before your session.",
        "After reviewing your completed paperwork, a counselor will meet you in the waiting room and walk with you to their office to speak in private. The purpose of the initial consultation at the Counseling Center is to assess your concerns and to develop a plan of how to address those concerns. During your meeting with the counselor, you will have a chance to briefly describe why you are seeking assistance and why you have chosen this particular time to do so. The counselor will ask for information about your present situation, your family background, general health and self-care, and important relationships in your life. You may be asked to discuss past experiences with this or similar problems and how you have tried to solve them. They will also explain and answer your questions about the counseling process. UIC students may request this initial consultation, but not all students are offered ongoing treatment at the counseling center.",
        "Some students find that talking with a counselor once is sufficient to resolve the immediate concern. If further services would be beneficial, these will be discussed, and a recommendation will be made by the counselor. These additional services may include resources offered by the Counseling Center or referral to another campus or community resource. In many instances, the counselor that you meet with initially could be the same person that you see for continued services, or you may be referred to another counselor at the center. Please note that, due to limited availability of our psychiatrist, we cannot offer medication management as a stand-alone service. Only clients who will be pursuing some form of psychotherapy at the center are eligible for medication evaluation and/or medication management.",
        "After the initial consultation, there may be a brief wait for an opening for the desired service, depending on the general demand at that time for that service. Your counselor will assess the urgency of your situation and this will be considered when making the recommendation of where, when and with whom you would best pursue further treatment.",
        "Your privacy is a top priority for us. We understand that many students have concerns about personal information or identities shared in counseling being shared with others. Matters shared with Counseling Services staff are kept private within the Counseling Center unless you give your counselor written permission to release specific information. This means that visits here are not part of your academic record, nor are they a part of any medical record you may have at campus medical facilities, such as at UIC Family Medicine.",
        "State and Federal law states that there are exceptions to this general rule:"
    ],
    "out_links": [
        "https://counseling.uic.edu/",
        "http://uic.edu/",
        "https://counseling.uic.edu/about-us/",
        "https://counseling.uic.edu/about-us/mission-and-values/",
        "https://counseling.uic.edu/about-us/scope-of-practice/",
        "https://counseling.uic.edu/about-us/meet-our-staff/",
        "https://counseling.uic.edu/about-us/hours-and-location/",
        "https://counseling.uic.edu/services/",
        "https://counseling.uic.edu/services/individual-therapy/",
        "https://counseling.uic.edu/services/group-therapy/",
        "https://counseling.uic.edu/services/couples-therapy/",
        "https://counseling.uic.edu/services/mind-body-services/",
        "https://counseling.uic.edu/services/psychiatry-and-integrative-medicine/",
        "https://counseling.uic.edu/services/outreach-services-and-programs/",
        "https://counseling.uic.edu/services/usn/",
        "https://counseling.uic.edu/crisis-services/",
        "https://counseling.uic.edu/online-resources/suicide-prevention-and-education-at-uic/",
        "https://counseling.uic.edu/online-resources/",
        "https://counseling.uic.edu/news-stories/introducing-counseling-center-e-newsletters/",
        "https://counseling.uic.edu/online-resources/mental-health-resources/",
        "https://counseling.uic.edu/online-resources/coping-with-recent-events/",
        "https://dos.uic.edu/infostudents.shtml",
        "https://counseling.uic.edu/faculty-staff-concerned-others/",
        "https://counseling.uic.edu/faculty-staff-concerned-others/for-parents-facultystaff-and-concerned-others/",
        "https://counseling.uic.edu/online-resources/suicide-prevention-and-education-at-uic/helping-someone-in-distress/",
        "https://counseling.uic.edu/training/",
        "https://counseling.uic.edu/training/internship/",
        "https://counseling.uic.edu/training/externship/",
        "https://counseling.uic.edu/training/postdoctoral-fellowship/",
        "https://counseling.uic.edu/training/usn_training/",
        "https://dos.uic.edu/uicare.shtml",
        "http://sa.uic.edu/",
        "http://maps.uic.edu/",
        "https://counseling.uic.edu/services/mind-body-services/koru-mindfulness-workshops/",
        "https://counseling.uic.edu/services/mind-body-services/self-compassion-workshop/",
        "https://counseling.uic.edu/services/mind-body-services/trauma-informed-yoga-group/",
        "https://counseling.uic.edu/services/mind-body-services/biofeedback/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}