{
    "url": "https://counseling.uic.edu/news-stories/coping-with-stress-related-to-covid-19/",
    "title": "Coping with Stress Related to COVID-19 | Counseling Center | University of Illinois at Chicago",
    "text": [
        "Social media and other online resources have no shortage of ideas for how to handle stress in the era of",
        "COVID-19. While this is positive in many ways, we are aware that integrating these suggestions can be overwhelming. The Counseling Center staff has compiled the following list of both general ideas for",
        "coping, as well as situation-specific suggestions.",
        "Eat well and move often!",
        "Physical and mental health are closely intertwined, and taking care of your body with proper eating, sleeping, and exercising offers an invaluable foundation for good mental health. Try some at-home workouts (even if it’s just getting off the couch and doing a lap around your place), and don’t forget to eat fruits and veggies, even if they’re frozen or canned! Consider a consistent “bedtime,” which leads nicely into…",
        "Create a balanced routine",
        "You may not have a routine figured out just yet, and that’s okay. Consider waking up around the same time every day, and include a combination of restful and productive activities. Remember that you may not be as productive as you would like each day! Be gentle with yourself and try to engage in something good for your mental, physical, relational, and spiritual health on as many days as you can. It may help to differentiate the days by earmarking certain activities for certain days of the week. It may take a few tries to get the balance just right – just pay attention to how you feel and assess at the end of the day what was and was not helpful.",
        "Limit news intake",
        "While staying informed can soothe anxiety to a certain extent, reading too much news tends to cause",
        "unnecessary stress. Sometimes, less is more! Try to get a sense of your threshold for news before it starts to get overwhelming. In addition to limiting the quantity of news you consume, consider the quality by limiting to only 1-2 credible news sources  (perhaps a trusted local news network and the CDC/WHO).",
        "Consider what you can control",
        "We engage in solution-focused coping when we have control in a situation. Ventra card running low? The solution-focused way to cope with this is to refill your card. It makes sense that you may be feeling like you don’t have control over the current circumstances of your life. In these situations, attempts to cope in a solution-focused way be frustrating, and emotion-focused coping is the way to go. To engage in emotion-focused coping, think about what you need to make the situation more comfortable and survivable – this list is a good place to start! Other ideas are deep, diaphragmatic breathing and mindfulness meditations, which can help us accept what we cannot change. You can explore more ideas by considering how you have coped with uncertainty or other similar feelings in the past.",
        "Connect with others",
        "Though the internet jokes that the stay-at-home order is an introvert’s paradise, most people eventually feel the impact of limited social contact. Try talking with a friend or family member regularly and at a rate that helps you feel uniquely connected (once a day, once a week, etc.) Even if you are feeling secure, consider reaching out to those who may be especially lonely or impacted at this time. Remember, “social distancing” is really just “physical distancing” – social connection is as important as ever!",
        "Try to see this as an opportunity",
        "How many times have you thought, “If only life would stand still, I would finally have time for ___!” Though many people are limited in where they can physically be and how much they can afford, this is a great time to work on yourself and your relationships. It could be taking on anything from a new hobby, to self-improvement, to something you’ve been meaning to do for ages. How can you make the most of this strange circumstance?",
        "Be gracious with yourself",
        "This is an adjustment for everyone in varying degrees – do not expect yourself to be able to easily figure all of this out. Try to be aware of how you are feeling and compassionate toward yourself when you are struggling. You are not alone!",
        "See our new e-newsletter for more information! Additional resources to address and manage anxiety at this time include:",
        "Facts about COVID-19",
        "Mental Health and Coping with COVID-19",
        "Taking Care of Your Behavioral Health: Tips for Social Distancing, Quarantine, and Isolation During an Infectious Disease Outbreak",
        "Combating Bias and Stigma Related to COVID-19",
        "Stigma and Resilience",
        "Road to Resilience brochure from the American Psychological Association"
    ],
    "out_links": [
        "https://counseling.uic.edu/",
        "http://uic.edu/",
        "https://counseling.uic.edu/about-us/",
        "https://counseling.uic.edu/about-us/mission-and-values/",
        "https://counseling.uic.edu/about-us/scope-of-practice/",
        "https://counseling.uic.edu/about-us/meet-our-staff/",
        "https://counseling.uic.edu/about-us/hours-and-location/",
        "https://counseling.uic.edu/services/",
        "https://counseling.uic.edu/services/what-to-expect/",
        "https://counseling.uic.edu/services/individual-therapy/",
        "https://counseling.uic.edu/services/group-therapy/",
        "https://counseling.uic.edu/services/couples-therapy/",
        "https://counseling.uic.edu/services/mind-body-services/",
        "https://counseling.uic.edu/services/psychiatry-and-integrative-medicine/",
        "https://counseling.uic.edu/services/outreach-services-and-programs/",
        "https://counseling.uic.edu/services/usn/",
        "https://counseling.uic.edu/crisis-services/",
        "https://counseling.uic.edu/online-resources/suicide-prevention-and-education-at-uic/",
        "https://counseling.uic.edu/online-resources/",
        "https://counseling.uic.edu/news-stories/introducing-counseling-center-e-newsletters/",
        "https://counseling.uic.edu/online-resources/mental-health-resources/",
        "https://counseling.uic.edu/online-resources/coping-with-recent-events/",
        "https://dos.uic.edu/infostudents.shtml",
        "https://counseling.uic.edu/faculty-staff-concerned-others/",
        "https://counseling.uic.edu/faculty-staff-concerned-others/for-parents-facultystaff-and-concerned-others/",
        "https://counseling.uic.edu/online-resources/suicide-prevention-and-education-at-uic/helping-someone-in-distress/",
        "https://counseling.uic.edu/training/",
        "https://counseling.uic.edu/training/internship/",
        "https://counseling.uic.edu/training/externship/",
        "https://counseling.uic.edu/training/postdoctoral-fellowship/",
        "https://counseling.uic.edu/training/usn_training/",
        "https://dos.uic.edu/uicare.shtml",
        "http://sa.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}