{
    "url": "https://counseling.uic.edu/services/group-therapy/group-therapy-schedule/",
    "title": "Group Therapy Schedule | Counseling Center | University of Illinois at Chicago",
    "text": [
        "While some of our therapy group activity has been suspended due to the coronavirus outbreak,  the Counseling Center is offering select process and structured groups, as well as workshops remotely via online video platforms. Please see below for more details.",
        "Mondays 3:05 p.m – 4:30 p.m., planning to resume Fall 2020",
        "Tuesdays 2:05 p.m. – 3:20 p.m.",
        "Wednesdays 1:00 p.m. – 2:30 p.m.",
        "Fridays 11:00 a.m. – 12:30 p.m.",
        "Fridays 2:00 p.m. – 3:30 p.m., planning to resume Fall 2020",
        "Tuesdays 4:00 p.m. – 5:30 p.m.",
        "Wednesdays 3:30 p.m. – 4:45 p.m.",
        "Thursdays 3:05 p.m. – 4:30 p.m.",
        "Mondays 3:00 p.m. – 4:30 p.m.",
        "Interpersonal process group for students who identify as Women of Color and have both an awareness of and openness to discussing in group the ways in which their minority identities impact their experiences.",
        "Thursdays 2:05 p.m – 3:25 p.m.",
        "Interpersonal process group for students who identify as a Person of Color and have both an awareness of and openness to discussing in group the ways in which their minority identities impact their experiences.",
        "Fall offerings TBD",
        "This Mood Masters group is a condensed, 7-week, structured, Dialectical Behavior Therapy (DBT) skills-based group designed to help members identify and replace unhelpful patterns and ways of coping with more healthy coping strategies. The group teaches skills that help members tolerate difficult emotions, increase mindfulness, reduce distress, and increase positive emotions. The group will include skills-building worksheets and activities, mindfulness exercises, and discussion among members.",
        "Fall offerings TBD",
        "This group is a 6-week structured group based on the Interpersonal Dialectical Behavior Therapy (DBT) skills. This group is designed to help members identify and change unhealthy patterns that they engage in with their relationships. The group will also teach members various interpersonal skills, i.e. assertiveness skills, how to effectively express your feelings and needs, how to be more conscientious toward other people even when you disagree with them. The group will include skills-building worksheets and activities, role plays, and discussion among members.",
        "",
        "Fridays, 1:15 p.m. – 2:30 p.m, three offerings starting on May 22nd, May 29th, and July 10th",
        "This five-week group will help you address anxiety using the evidence-based approach behind Acceptance and Commitment Therapy (ACT).  The aim of ACT is to bring an open and willing attitude toward all internal experiences and actively working on what you truly care about, even when pain is present. The goal of this group is to help you relate differently to your anxious feelings, depressed moods, worrying mind, and self-defeating behaviors. Sessions will include skill-building, mindfulness activities, group discussion, and experiential exercises.",
        "Wednesdays 12:30 p.m. – 2:00 p.m., starting February 26th",
        "This ten-week, semi-structured group aims to help students who experienced or anticipate the death of a loved one. The goal of the group is to foster active grieving in relationship with others within a supportive space. Grieving with others can allow participants to embrace hope, face the feelings of loss, and feel “companioned” in their healing journey. Sessions will include topic-based discussion, open-ended processing, and experiential activities, such as journaling.",
        "Tuesdays 3:00 p.m – 4:30 p.m.",
        "Mixed grad and undergrad interpersonal process therapy group for students who identify as Lesbian, Gay, Bisexual, Questioning, Queer, and/or other sexual minority identities to explore issues related to sexual orientation, gender identity, and interpersonal experiences.  Trans and gender nonconforming individuals who also hold sexual minority identities are welcome to this group. The LGBQ interpersonal process group offers a space for group members to gain support in integrating orientation and identity with other areas of the students’ lives.",
        "Thursdays 3:30 p.m. – 4:45 p.m., planning to resume Fall 2020",
        "Interpersonal process group for students who identify as women and want to better understand themselves and others in relationships. This group addresses emotional expression, relationship building, and exploration of roles assumed by women.",
        "Wednesdays 4:15 p.m. – 5:30 p.m., planning to resume Fall 2020",
        "Interpersonal process group for students who identify as men and want to better understand themselves and others in relationships. This group addresses emotional expression, relationship building, and exploration of roles assumed by men.",
        "Thursdays, 1:00 p.m. – 2:30 p.m., planning to resume Fall 2020",
        "The Trauma-Informed Yoga Group is an ongoing weekly group that utilizes movement and the body as tools to promote healing from trauma. This group is specifically designed to support individuals with a history of Complex Trauma (trauma with a relational component such as sexual assault, childhood sexual, physical or emotional abuse, domestic abuse/abusive relationships, or war-trauma). The group includes about 45 minutes of a gentle trauma-informed yoga practice and about 45 minutes of psychoeducation about trauma and discussion. All levels of yoga experience are welcome, and we will provide mats and any equipment needed for the group. Please note there will be NO physical touch/assists in the group at any time.",
        "*Please note that new members are often welcomed to join process groups at any time of the year, pending availability. Please also note that the majority of the subsequent groups have a maximum capacity of eight group therapy clients at a given time. Group therapy offerings can change from semester to semester."
    ],
    "out_links": [
        "https://counseling.uic.edu/",
        "http://uic.edu/",
        "https://counseling.uic.edu/about-us/",
        "https://counseling.uic.edu/about-us/mission-and-values/",
        "https://counseling.uic.edu/about-us/scope-of-practice/",
        "https://counseling.uic.edu/about-us/meet-our-staff/",
        "https://counseling.uic.edu/about-us/hours-and-location/",
        "https://counseling.uic.edu/services/",
        "https://counseling.uic.edu/services/what-to-expect/",
        "https://counseling.uic.edu/services/individual-therapy/",
        "https://counseling.uic.edu/services/group-therapy/",
        "https://counseling.uic.edu/services/couples-therapy/",
        "https://counseling.uic.edu/services/mind-body-services/",
        "https://counseling.uic.edu/services/psychiatry-and-integrative-medicine/",
        "https://counseling.uic.edu/services/outreach-services-and-programs/",
        "https://counseling.uic.edu/services/usn/",
        "https://counseling.uic.edu/crisis-services/",
        "https://counseling.uic.edu/online-resources/suicide-prevention-and-education-at-uic/",
        "https://counseling.uic.edu/online-resources/",
        "https://counseling.uic.edu/news-stories/introducing-counseling-center-e-newsletters/",
        "https://counseling.uic.edu/online-resources/mental-health-resources/",
        "https://counseling.uic.edu/online-resources/coping-with-recent-events/",
        "https://dos.uic.edu/infostudents.shtml",
        "https://counseling.uic.edu/faculty-staff-concerned-others/",
        "https://counseling.uic.edu/faculty-staff-concerned-others/for-parents-facultystaff-and-concerned-others/",
        "https://counseling.uic.edu/online-resources/suicide-prevention-and-education-at-uic/helping-someone-in-distress/",
        "https://counseling.uic.edu/training/",
        "https://counseling.uic.edu/training/internship/",
        "https://counseling.uic.edu/training/externship/",
        "https://counseling.uic.edu/training/postdoctoral-fellowship/",
        "https://counseling.uic.edu/training/usn_training/",
        "https://dos.uic.edu/uicare.shtml",
        "http://sa.uic.edu/",
        "http://maps.uic.edu/",
        "https://counseling.uic.edu/upcoming-workshops/",
        "https://counseling.uic.edu/services/mind-body-services/koru-mindfulness-workshops/",
        "https://counseling.uic.edu/services/mind-body-services/self-compassion-workshop/",
        "https://counseling.uic.edu/services/mind-body-services/trauma-informed-yoga-group/",
        "https://counseling.uic.edu/services/mind-body-services/biofeedback/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}