{
    "url": "https://cs.uic.edu/cs-research/lectures-seminars/the-return-of-the-traveling-salesman-approximation-algorithm-design-via-randomization-and-linear-programming/",
    "title": "The Return of the Traveling Salesman: Approximation Algorithm Design via Randomization and Linear Programming | Department of Computer Science | University of Illinois at Chicago",
    "text": [
        "The traveling salesman problem (TSP) has stimulated work in a number of areas, ranging from computational complexity to algorithm engineering; in this problem, we are given a set of n cities along with the distance between each pair, which we assume are symmetric and satisfy the triangle inequality, and we wish to find the minimum-length tour that visits each city once. In spite of a vast improvement over the past 40 years in our ability to derive both positive and negative results for approximation algorithms ? polynomial-time algorithms with a provable relative error performance guarantee ? there has been only minimal progress for the TSP; we know that a polynomial-time algorithm guaranteed to yield better than 123/122 times the optimum would imply that P=NP, and the best known approximation algorithm is Christofides Algorithm from the mid-1970s, which finds a solution of cost at most 3/2 times the optimum. Although randomization and linear programming have become indispensable tools in the algorithm designers toolkit, recent work has shown that both can be exploited more extensively to obtain improved algorithms. We will discuss a number of these developments, focusing on results on variants of the TSP, starting with work of Asadpour, Goemans, Madry, Oveis Gharan, & Saberi and of Oveis Gharan, Saberi, & Singh that has now led to improvements to Christofides Algorithm, not for the ordinary TSP, but for the s-t path TSP, in which we are also given two specified endpoints s and t, and the aim is to find the minimum-length path between s and t, visiting each other city once along the way.",
        "This is joint work with Hyung-Chun An and Bobby Kleinberg.",
        "David Shmoys is the Laibe/Acheson Professor and Director of the School of Operations Research and Information Engineering at Cornell University. He obtained his Ph.D. in Computer Science from the University of California at Berkeley in 1984, and held postdoctoral positions at MSRI in Berkeley and Harvard University, and a faculty position at MIT before joining the Cornell faculty. He is also Associate Director of the Institute of Computational Sustainability at Cornell University. He is a Fellow of the ACM, INFORMS, and of SIAM, was an NSF Presidential Young Investigator, and has served on numerous editorial boards, including Mathematics of Operations Research (for which he is currently an Associate Editor), and the SIAM Journals of both Computing and Discrete Mathematics, where for the latter he also served as Editor-in-Chief. He has been the advisor for 21 graduated PhD students, and his former students are currently on the faculties of many leading universities and research labs, including MIT, Waterloo, Brown, Maryland, Georgetown, and D-Wave. Shmoys’ research has focused on the design and analysis of efficient algorithms for discrete optimization problems, with applications including scheduling, inventory theory, computational biology, and most recently, computational sustainability. His work has highlighted the central role that linear programming plays in the design of approximation algorithms for NP-hard problems; his recent book, co-authored with David Williamson, The Design of Approximation Algorithms, was awarded the 2013 Lanchester Prize by INFORMS.",
        "Host: Bhaskar DasGupta"
    ],
    "out_links": [
        "https://cs.uic.edu/",
        "http://uic.edu/",
        "https://cs.uic.edu/undergraduate/",
        "https://cs.uic.edu/undergraduate/admitted-students/",
        "http://engineering.uic.edu/undergraduate-admissions/",
        "https://cs.uic.edu/undergraduate/abet-accreditation/",
        "https://cs.uic.edu/undergraduate/cs-major/",
        "https://cs.uic.edu/undergraduate/cs-minor/",
        "https://cs.uic.edu/undergraduate/undergrad-courses/",
        "https://cs.uic.edu/undergraduate/internships-and-jobs/",
        "https://cs.uic.edu/undergraduate/student-organizations/",
        "https://cs.uic.edu/undergraduate/student-profiles/",
        "https://cs.uic.edu/undergraduate/student-resources/",
        "https://cs.uic.edu/undergraduate/women/",
        "https://cs.uic.edu/graduate/",
        "https://cs.uic.edu/graduate/admitted-students/",
        "https://cs.uic.edu/graduate/admissions/",
        "https://cs.uic.edu/graduate/graduate-courses/",
        "https://cs.uic.edu/graduate/ms-program/",
        "https://cs.uic.edu/graduate/phd/",
        "https://cs.uic.edu/graduate/cs-dissertations/",
        "https://cs.uic.edu/graduate/post-grad-outcomes/",
        "https://cs.uic.edu/graduate/student-profiles/",
        "https://cs.uic.edu/graduate/graduate-student-resources/",
        "https://cs.uic.edu/cs-research/",
        "https://cs.uic.edu/cs-research/research-areas-2/",
        "https://cs.uic.edu/cs-research/labs/",
        "https://cs.uic.edu/cs-research/lectures-seminars/",
        "https://cs.uic.edu/cs-research/reus/",
        "https://cs.uic.edu/faculty-staff/",
        "https://cs.uic.edu/faculty-staff/department-head/",
        "https://cs.uic.edu/faculty-staff/faculty/",
        "https://cs.uic.edu/faculty-staff/emeritus-faculty/",
        "https://cs.uic.edu/faculty-staff/adjunct-faculty/",
        "https://cs.uic.edu/faculty-staff/staff/",
        "https://cs.uic.edu/faculty-staff/faculty-resources/",
        "https://cs.uic.edu/faculty-staff/open-positions/",
        "https://cs.uic.edu/cs-news/",
        "https://cs.uic.edu/cs-news/all-news/",
        "https://cs.uic.edu/cs-news/press-mentions/",
        "https://cs.uic.edu/cs-events/",
        "https://cs.uic.edu/cs-events/calendar/",
        "https://cs.uic.edu/cs-events/student-opportunities/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://www.cs.uic.edu/bin/edit/News/PhD?nowysiwyg=0&topicparent=News.NewsItem",
        "https://www.cs.uic.edu/bin/edit/News/DasGupta?nowysiwyg=0&topicparent=News.NewsItem",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}