{
    "url": "https://www.ois.uic.edu/news/coronavirus__c_o_v_i_d-19_updates_for_the_u_i_c_in",
    "title": "Coronavirus/COVID-19 Updates for the UIC International Comm...",
    "text": [
        "Is UIC’s Office of International Services open during the COVID-19",
        "pandemic?",
        "In",
        "response to federal and state government recommendations regarding size limits",
        "for group gatherings, the Office of International Services has moved all",
        "services online, effective immediately, March 17. Our office in SSB will be",
        "closed to visitors until further notice, but our services remain available.",
        "Read the full",
        "announcement including information on how the UIC international community can",
        "connect with us for advising, document processing and workshops. Contact OIS",
        "at (312) 996-3121 or ois@uic.edu, Monday through",
        "Friday, 8:30 a.m. to 5 p.m.",
        "I would like",
        "to make an appointment with an OIS Advisor. How can I do that?",
        "OIS",
        "Advisors are available for phone and video appointments during our regular",
        "business hours, 8:30 a.m. to 5:00 p.m., Monday through Friday. Please contact",
        "OIS at (312) 996-3121 or ois@uic.edu to request a",
        "phone or video appointment. Include your name, UIN (if available), phone number",
        "and preferred meeting time and we will respond with details on how to connect.",
        "I need to submit an immigration document request to OIS.",
        "How can I do that?",
        "Current international students, scholars and",
        "employees can submit immigration document requests via email to ois@uic.edu.",
        "In your message, please include your full name, UIN and attach all relevant",
        "completed forms and supporting documents.",
        "I need to collect a document from OIS. How can I do that?",
        "An OIS Advisor will contact you via email",
        "when your request has been processed and your immigration document is ready for",
        "shipment. This email will include details on your shipping options for the",
        "document. Please note that international shipments to some countries are",
        "significantly delayed due to circumstances beyond the control of OIS. Please",
        "see the UPS Global Novel Coronavirus Update .pdf for a summary of in-country shipping conditions.",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "I would prefer to stay in the U.S. for now. What should I do?",
        "",
        "I plan to leave the U.S. and finish the semester online. What should I do?",
        "If you leave the U.S., but know that you cannot complete your studies online please consult with your academic advisor and OIS prior to complete the Leave of Absence process prior to departure. The late drop deadline for undergraduate students has been moved from March 20 to April 3.",
        "Will my F-1 SEVIS record and I-20 remain valid if I return home for the remainder of the spring semester and possibly for the summer as well?",
        "F-1 international students can temporarily study online full-time and remain active in SEVIS (i.e. maintain status). The Student and Exchange Visitor Program (SEVP) subsequently clarified that this is true whether or not the student remains in the U.S. or leaves the U.S. and takes the classes from elsewhere. However, SEVP also stated that this temporary provision is only in effect for the duration of the emergency and is subject to change.",
        "As an F-1 international student you must be prepared to return to in-person classes at the end of this period of emergency online instruction in response to the coronavirus/COVID-19. Currently, online instruction extends through the spring semester only. Additionally, if you are considering travel outside the U.S., you must accept that, within the current environment, there is no guarantee you will be able to return to the U.S. according to your plans.",
        "Will I still be able to apply for OPT if I leave the U.S.?",
        "You must be physically present in the U.S. in order to submit an application for optional practical training (OPT). Currently, if an F-1 student is absent from the U.S. for five months or more, they must apply for a new I-20 and F-1 visa in order to return and resume studies. Students return to the U.S. on a new I-20 and F-1 visa and then graduate in less than a year may not be eligible to apply for OPT.",
        "I’m undecided about staying or leaving. What should I consider?",
        "Additional considerations for those leaving the U.S. for online study or personal temporary travel include:",
        "",
        "As noted by the CDC website, travel to the U.S. from China, Iran and most of Europe is currently restricted. There is no indication as to when these restrictions will be lifted, and countries can be added to this list without prior warning.",
        "Visa services at many U.S. embassies and consulates abroad have been significantly impacted by coronavirus/COVID-19. Before departure, check the U.S. Department of State website for the status of services at the U.S. Embassy or Consulate nearest you.",
        "Upon return to UIC, you may be subject to self-isolation recommendations regardless of symptoms. Please consult uic.edu/coronavirus for current campus guidance.",
        "Does CampusCare cover treatment for coronavirus/COVID-19?",
        "CampusCare covers treatment for coronavirus/COVID-19 in the same way it does all other illnesses. If you have CampusCare you can review the plan's summary of benefits on their website. Students who are feeling ill or suspect that they could have coronavirus/COVID-19 should first call their in network provider, Family Medicine at (312) 996-2901, to speak with a medical professional. Note that receiving care from an out of network hospital may not be covered at the same rate as in network providers. Students with additional questions about CampusCare coverage can contact CampusCare directly at cchealth@uic.edu.",
        "",
        "Can international students work their on-campus",
        "job remotely?",
        "Yes. Per the Student and Exchange Visitor Program (SEVP) COVID-19 FAQ if the current on-campus",
        "employment opportunity has transitioned to remote work or the employment can be",
        "done through remote means, students may continue to engage in on-campus",
        "employment remotely. Schools should be able to explain how the students are",
        "providing services associated with the employment while not at the location of",
        "the employer.",
        "Can international students financially impacted by",
        "coronavirus/COVID-19 get authorization to work off-campus in order to earn",
        "additional income?",
        "F-1 students who experience a significant and",
        "unexpected change to their academic funding source as a result of circumstances",
        "beyond their control (e.g. natural disaster, death in the family, global",
        "financial crisis) may be eligible to apply for Severe Economic Hardship",
        "off-campus employment authorization. While this benefit was in place before",
        "coronavirus/COVID-19 it is our understanding that students financially impacted",
        "by coronavirus/COVID-19 will be considered. However, this should not be",
        "considered as an immediate financial solution as applications must be approved",
        "by USCIS, a process which under normal circumstances takes months.",
        "Will USCIS issue Special Student Relief work authorizations",
        "in response to coronavirus/COVID-19?",
        "Special Student Relief (SSR) is the suspension of certain regulatory requirements for",
        "F-1 students from parts of the world experiencing emergent circumstances. In the",
        "past SSR has included expedited employment authorization documents for",
        "off-campus work. So far the U.S. government has not discussed SSR in response",
        "to the COVID-19 pandemic.",
        "",
        "",
        "",
        "",
        "",
        "How can a J-1 Exchange Visitor Scholar report an additional site of activity?",
        "J-1 Exchange Visitors requesting additional sites of activity or intending to conduct program activity at off-campus locations (that OIS is not already aware of) will still need advance approval from OIS. Scholars and departments may reach out to any OIS advisor directly prior to the additional activity taking place for next steps.",
        "How can a J-1 Exchange Visitor Scholar request a program extension or travel signature?",
        "OIS will accept scanned copies of the documents when requesting travel signatures and program extension until further notice. Departments and/or scholars should provide the original signed copies via campus mail to follow. Please note for travel signature requests, submission of the original DS-2019 is temporarily not required. We will reprint the document and arrange delivery by mail.",
        "",
        "",
        "",
        "Can international employees telecommute (work from home)?",
        "In most cases, yes, international employees may telecommute but we ask that departments provide OIS with the home address that will be used for work prior to the start. For H-1B and E-3 employees, it is critical that departments provide OIS with the home address being used for work prior to the start of telecommuting because a new DOL Labor Condition Application (LCA) may be required. Please contact OIS for guidance. No USCIS nor DOL action is required for TN and O-1 employees, however, this could change if telecommuting becomes a long-term need. Stay tuned. Individuals working at UIC on an OPT or STEM OPT authorization hosted by another school should reach out to that school for guidance on how to report changes in work location.",
        "Can an employer stop paying or “bench” an international employee due to a reduction in services needed?",
        "No, employers must continue to pay H-1B and E-3 employees their salary or wage as listed on the Labor Condition Application (LCA) even if the employee is in “non-productive status”, and employers must continue to pay TN and O-1 employees pursuant to the conditions of the petition previously approved by the Department of Homeland Security.",
        "What should the department do if an international employee wants to take an extended HR-approved unpaid leave in response to coronavirus/COVID-19?",
        "Please reach out to OIS for guidance. We will provide details on how to best manage the immigration record depending on length of the leave and whether or not the individual will remain in the U.S. or travel abroad. Contact OIS at (312) 996-3121 or ois@uic.edu.",
        "What should the department do if an international employee needs to make a material change to their position as a result of coronavirus/COVID-19?",
        "Materials changes to H-1B, E-3, O-1 and TN positions include full-time to part-time status, changes in title, and other material changes. These types of changes require OIS to file an amendment with USCIS. Additional monitoring of hours may be required. Please consult with an OIS Advisor to determine if a change to a position requires an amendment to be filed with the USCIS.",
        "What should a department do if an international resigns of their own accord as result of coronavirus/COVID-19?",
        "Please submit a Departure Verification Form (DVF) to OIS.",
        "",
        "",
        "How should departments advise international employees who are considering a trip abroad?",
        "First a foremost, international employees can always consult with OIS advisors regarding their decision to travel internationally during the coronavirus/COVID-19 pandemic. On Monday, March 9 OIS shared a message with the UIC international community in which we strongly discouraged all international students, scholars and employees from traveling outside the U.S. in the near future and that it is not possible to guarantee that individuals will be able to return to the U.S. according to their plans. Our guidance remains the same although we understand that the decision to travel at this point is extremely personal. Those considering international travel with the intention of returning to the U.S. should check their documents before departure and plan for any necessary updates. Visa services at U.S. Embassies and Consulates abroad have been significantly impacted and in many cases suspended due to coronavirus/COVID-19. The U.S. Department of State has a list COVID-19 specific country information. Travel restrictions continue to be announced limiting entry to countries across the globe. The U.S. Centers for Disease Control and Prevention (CDC) maintains a list of current restrictions on travel to the U.S. Those who are successful in returning to the U.S. may be subject to self-isolation/quarantine before returning to campus. Please follow campus guidance as posted on today.uic.edu/coronavirus.",
        "Has USCIS announced any suspensions to their processing services related to employment petitions?",
        "Yes, on March 20 U.S. Citizenship and Immigration Services (USCIS) announced the immediate and temporary suspension of Premium Processing service of all Form I-129 petitions due to Coronavirus Disease 2019 (COVID-19), including cap-exempt petitioners such as UIC. Specifically, effective immediately, USCIS will not accept any new requests for Premium Processing of I-129 nonimmigrant petitions, which includes but is not limited to the H-1B and O-1 categories. It is expected that any Premium Processing requests received and accepted prior to March 20, 2020 will continue to be processed. If you have case-specific questions regarding how this may impact a matter currently being processed with our office, please contact an OIS advisor. As always, we will immediately notify our colleagues in human resources roles once USCIS has provided any update regarding Premium Processing.",
        "",
        "",
        ""
    ],
    "out_links": [
        "https://www.ois.uic.edu/cms/One.aspx?amp=&pageId=1369306&portalId=1581",
        "https://www.ois.uic.edu/",
        "https://www.ois.uic.edu/home",
        "https://www.ois.uic.edu/aboutois",
        "https://www.ois.uic.edu/aboutois/executive_director_s_welcome",
        "https://www.ois.uic.edu/aboutois/our_population",
        "https://www.ois.uic.edu/aboutois/staff_directory",
        "https://www.ois.uic.edu/aboutois/hours_and_location",
        "https://www.ois.uic.edu/aboutois/emergency_information",
        "https://www.ois.uic.edu/aboutois/spotlight_on_scholars",
        "https://www.ois.uic.edu/students",
        "https://www.ois.uic.edu/students/prospective",
        "https://www.ois.uic.edu/students/prospective/general_information",
        "https://www.ois.uic.edu/students/prospective/graduate_admissions",
        "https://www.ois.uic.edu/students/prospective/undergraduate_admissions",
        "https://www.ois.uic.edu/students/prospective/obtaining_an_initial_i-20__d_s-2019",
        "https://www.ois.uic.edu/students/prospective/declaration_and_certification_of_finances___d_c_f_",
        "https://www.ois.uic.edu/students/prospective/estimated_expenses",
        "https://www.ois.uic.edu/students/prospective/dependents",
        "https://www.ois.uic.edu/students/admitted",
        "https://www.ois.uic.edu/students/admitted/transferring_to_u_i_c",
        "https://www.ois.uic.edu/students/admitted/travel___visas",
        "https://www.ois.uic.edu/students/admitted/pre-_arrival",
        "https://www.ois.uic.edu/students/admitted/housing",
        "https://www.ois.uic.edu/students/admitted/check-_in",
        "https://www.ois.uic.edu/students/admitted/international_student_orientation",
        "https://www.ois.uic.edu/students/current",
        "https://www.ois.uic.edu/students/current/forms",
        "https://www.ois.uic.edu/students/current/academics",
        "https://www.ois.uic.edu/students/current/f-1_student_employment",
        "https://www.ois.uic.edu/students/current/j-1_student_employment",
        "https://www.ois.uic.edu/students/current/travel",
        "https://www.ois.uic.edu/students/current/replacement",
        "https://www.ois.uic.edu/students/current/address",
        "https://www.ois.uic.edu/students/current/status",
        "https://www.ois.uic.edu/students/current/departure",
        "https://www.ois.uic.edu/students/current/extension",
        "https://www.ois.uic.edu/students/current/scholarships",
        "https://www.ois.uic.edu/students/current/peoria",
        "https://www.ois.uic.edu/students/current/rockford",
        "https://www.ois.uic.edu/students/incoming_exchange_students",
        "https://www.ois.uic.edu/students/fulbright_foreign_student_and_scholar___non_u__s__citizens_",
        "https://www.ois.uic.edu/faculty__staff__and_scholars",
        "https://www.ois.uic.edu/faculty__staff__and_scholars/travel___visas",
        "https://www.ois.uic.edu/faculty__staff__and_scholars/j",
        "https://www.ois.uic.edu/faculty__staff__and_scholars/j/categories",
        "https://www.ois.uic.edu/faculty__staff__and_scholars/j/prospective",
        "https://www.ois.uic.edu/faculty__staff__and_scholars/j/funding_requirements",
        "https://www.ois.uic.edu/faculty__staff__and_scholars/j/insurance",
        "https://www.ois.uic.edu/faculty__staff__and_scholars/j/status",
        "https://www.ois.uic.edu/faculty__staff__and_scholars/j/transfers",
        "https://www.ois.uic.edu/faculty__staff__and_scholars/j/dependents",
        "https://www.ois.uic.edu/faculty__staff__and_scholars/h",
        "https://www.ois.uic.edu/faculty__staff__and_scholars/h/pre-_arrival",
        "https://www.ois.uic.edu/faculty__staff__and_scholars/h/maintaining_status",
        "https://www.ois.uic.edu/faculty__staff__and_scholars/o",
        "https://www.ois.uic.edu/faculty__staff__and_scholars/tn",
        "https://www.ois.uic.edu/faculty__staff__and_scholars/e-3",
        "https://www.ois.uic.edu/faculty__staff__and_scholars/other",
        "https://www.ois.uic.edu/faculty__staff__and_scholars/pending",
        "https://www.ois.uic.edu/faculty__staff__and_scholars/forms",
        "https://www.ois.uic.edu/faculty__staff__and_scholars/fulbright_foreign_student_and_scholars",
        "https://www.ois.uic.edu/visitors",
        "https://www.ois.uic.edu/visitors/b-1__b-2",
        "https://www.ois.uic.edu/visitors/w_b__w_t",
        "https://www.ois.uic.edu/departments",
        "https://www.ois.uic.edu/departments/use_of_attorneys_policy",
        "https://www.ois.uic.edu/departments/guide_to_hiring",
        "https://www.ois.uic.edu/departments/guide_to_hiring/quick_guide_to_hiring",
        "https://www.ois.uic.edu/departments/guide_to_hiring/credential_evaluations",
        "https://www.ois.uic.edu/departments/guide_to_hiring/t_n",
        "https://www.ois.uic.edu/departments/permanent_residency",
        "https://www.ois.uic.edu/departments/o_b_f_s",
        "https://www.ois.uic.edu/departments/forms",
        "https://www.ois.uic.edu/programs",
        "https://www.ois.uic.edu/programs/tradewinds",
        "https://www.ois.uic.edu/programs/first_friends",
        "https://www.ois.uic.edu/programs/first_friends/first_friends_training_guide",
        "https://www.ois.uic.edu/programs/global_ambassadors",
        "https://www.ois.uic.edu/programs/employment_workshops_and_events",
        "https://www.ois.uic.edu/programs/international_education_week",
        "https://www.ois.uic.edu/programs/international_student_career_week",
        "https://www.ois.uic.edu/programs/thanksgiving_dinner",
        "https://www.ois.uic.edu/programs/pumpkin_farm_trip",
        "https://www.ois.uic.edu/programs/other_events",
        "https://www.ois.uic.edu/life_in_illinois",
        "https://www.ois.uic.edu/life_in_illinois/chicago",
        "https://www.ois.uic.edu/life_in_illinois/peoria",
        "https://www.ois.uic.edu/life_in_illinois/rockford",
        "https://www.ois.uic.edu/alumni",
        "https://www.ois.uic.edu/resources",
        "https://www.ois.uic.edu/resources/driver_s_license",
        "https://www.ois.uic.edu/resources/cell_phone",
        "https://www.ois.uic.edu/resources/social_security_number",
        "https://www.ois.uic.edu/resources/transportation",
        "https://www.ois.uic.edu/resources/money__banking",
        "https://www.ois.uic.edu/resources/housing",
        "https://www.ois.uic.edu/resources/health",
        "https://www.ois.uic.edu/resources/insurance",
        "https://www.ois.uic.edu/resources/important_links",
        "https://www.ois.uic.edu/news",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s_-_3_17_2020",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s___3_09_2020",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s___2_25_2020",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s___2_19_2020",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s___2_11_2020",
        "https://www.ois.uic.edu/news/ois_news_-_2_06_2020",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s_-_1_24_2020",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s_-_1_14_2020",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s___12_19_2019",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s___12_11_2019",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s___7_11_2019",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s___6_26_2019",
        "https://www.ois.uic.edu/news/o_i_s_news_-_5_24_2019",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s___3_1_2019",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s___2_19_2019",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s___12_13_2018",
        "https://www.ois.uic.edu/news/o_i_s_news_-_10_4_2018",
        "https://www.ois.uic.edu/news/o_i_s_news_-_10_1_2018",
        "https://www.ois.uic.edu/news/o_i_s_news_-_5_2_2018",
        "https://www.ois.uic.edu/news/o_i_s_news_-_5_1_2018",
        "https://www.ois.uic.edu/news/o_i_s_news_-_2_22_2018",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s_-_10_02_2017",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s_-_02_28_2017",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s_-_05_24_2017",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s_-_5_08_2020",
        "https://campuscare.uic.edu/benefits/",
        "https://www.ois.uic.edu/cms/One.aspx?pageId=1364777&portalId=1581",
        "https://today.uic.edu/coronavirus",
        "https://www.ois.uic.edu/home/",
        "https://www.ois.uic.edu/aboutois/",
        "https://www.ois.uic.edu/students/",
        "https://www.ois.uic.edu/faculty__staff__and_scholars/",
        "https://www.ois.uic.edu/visitors/",
        "https://www.ois.uic.edu/departments/",
        "https://www.ois.uic.edu/programs/",
        "https://www.ois.uic.edu/life_in_illinois/",
        "https://www.ois.uic.edu/alumni/",
        "https://www.ois.uic.edu/resources/",
        "https://www.ois.uic.edu/news/",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s_-_3_17_2020/",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s___3_09_2020/",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s___2_25_2020/",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s___2_19_2020/",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s___2_11_2020/",
        "https://www.ois.uic.edu/news/ois_news_-_2_06_2020/",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s_-_1_24_2020/",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s_-_1_14_2020/",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s___12_19_2019/",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s___12_11_2019/",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s___7_11_2019/",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s___6_26_2019/",
        "https://www.ois.uic.edu/news/o_i_s_news_-_5_24_2019/",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s___3_1_2019/",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s___2_19_2019/",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s___12_13_2018/",
        "https://www.ois.uic.edu/news/o_i_s_news_-_10_4_2018/",
        "https://www.ois.uic.edu/news/o_i_s_news_-_10_1_2018/",
        "https://www.ois.uic.edu/news/o_i_s_news_-_5_2_2018/",
        "https://www.ois.uic.edu/news/o_i_s_news_-_5_1_2018/",
        "https://www.ois.uic.edu/news/o_i_s_news_-_2_22_2018/",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s_-_10_02_2017/",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s_-_02_28_2017/",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s_-_05_24_2017/",
        "https://www.ois.uic.edu/news/coronavirus__c_o_v_i_d-19_updates_for_the_u_i_c_in/",
        "https://www.ois.uic.edu/news/o_i_s_n_e_w_s_-_5_08_2020/",
        "https://www.ois.uic.edu/announcements/support_the_office_of_international_services",
        "https://www.ois.uic.edu/cms/tel:3129963121"
    ]
}