{
    "url": "https://idcenter.uic.edu/cta-u-pass/history/",
    "title": "History | ID Center | University of Illinois at Chicago",
    "text": [
        "The U-PASS first came to UIC in the fall of 2001. The board of trustees approved the U-PASS Program and nonrefundable CTA transportation fee for undergraduate students after a recommendation from the campus based upon significant student input‚ including 2 referenda.",
        "The board of trustees further approved the addition of the graduate students from the Graduate College‚ College of Pharmacy‚ and School of Public Health beginning in fall 2002 after recommendations from the campus based on a student referendum held in April 2002.",
        "On August 5‚ 2004‚ the Regional Transit Authority Board approved an agreement for Pace buses to accept all CTA fare cards‚ including the U-PASS. Per the agreement‚ Pace would accept the CTA passes on its regular bus services only‚ not on subscription bus or vanpool services. This agreement had planned to run from September 2004 through December 2005‚ but ran through 2008. As of January 1st‚ 2009‚ PACE no longer accepted CTA Passes‚ including the U-PASS.",
        "The University Of Illinois Board Of Trustees approved a five year contract for the U-PASS at their July 13‚ 2005 meeting. As part of this new contract‚ there will be a referendum each April to approve the U-PASS for the following year. The U-PASS student referendum passed this April with strong support. Of the 4941 total votes cast‚ 86% percent voted in favor of the U-PASS‚ while only 14% percent voted against the U-PASS. The renewal of the U-PASS program and nonrefundable CTA transportation fee for undergraduate students and graduate students from the Graduate College‚ College of Pharmacy‚ School of Public Health‚ and Doctorate of Physical Therapy program‚ as well as the addition of College of Dentistry students and the M1 and M2 students from the College of Medicine beginning fall 2005. College of Medicine students voted 72% in favor of having the U-PASS available to all classes beginning summer 2007.",
        "The UIC CTA U-PASS is available to full-time undergraduate students and full-time graduate students from the Graduate College‚ College of Dentistry‚ College of Pharmacy‚ School of Public Health‚ Doctorate of Physical Therapy Program‚ and College of Medicine. Students from the Graduate College and School of Public Health must be registered for at least 9 credit hours in the fall and spring semesters and 5 or more credit hour during the summer to receive a U-PASS. All other students must be registered for at least 12 credit hours in the fall and spring semesters‚ and 6 credit hours for summer semesters to receive a U-PASS. These students will be assessed a nonrefundable CTA transportation fee per semester for this benefit. This fee entitles all eligible students to a nontransferable UIC CTA U-PASS valid for that semester.",
        "The U-PASS will be valid for CTA travel during the semester‚ as well as the five days before classes begin and the five days after finals end (based on the official academic calendar). This includes CTA buses and trains (PACE buses are excluded as of January 1st‚ 2009). The UIC CTA U-PASS is nontransferable and carries the student’s photo."
    ],
    "out_links": [
        "https://idcenter.uic.edu/",
        "http://uic.edu/",
        "https://idcenter.uic.edu/identification-cards/",
        "https://idcenter.uic.edu/identification-cards/fees/",
        "https://idcenter.uic.edu/identification-cards/visitor-cards/",
        "https://idcenter.uic.edu/identification-cards/departmental-name-badges/",
        "https://idcenter.uic.edu/dragon-dollar/",
        "https://idcenter.uic.edu/dragon-dollar/using-dragon-dollar/",
        "https://idcenter.uic.edu/dragon-dollar/purchase-locations-fees/",
        "https://idcenter.uic.edu/dragon-dollar/terms-conditions/",
        "http://dining.uic.edu/meal-plans/",
        "http://dragoncenter.uic.edu/",
        "https://idcenter.uic.edu/cta-u-pass/",
        "https://cas.uic.edu/upass_pickup/index2.php",
        "https://idcenter.uic.edu/cta-u-pass/troubleshoot-u-pass/",
        "https://idcenter.uic.edu/cta-u-pass/about-u-pass/",
        "https://idcenter.uic.edu/cta-u-pass/eligibility/",
        "https://idcenter.uic.edu/faq/u-pass-faqs/",
        "https://idcenter.uic.edu/faq/",
        "https://idcenter.uic.edu/faq/identification-cards-faq/",
        "https://idcenter.uic.edu/faq/dragon-dollar-meal-plans-faqs/",
        "http://connect.uic.edu/",
        "http://vcsa.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}