{
    "url": "https://idcenter.uic.edu/dragon-dollar/terms-conditions/",
    "title": "Terms & Conditions | ID Center | University of Illinois at Chicago",
    "text": [
        "UIC Meal Plans & Dragon Dollar$ Accounts  Disclosure of Terms and Conditions",
        "There is no fee to open an account.",
        "There is no initial minimum cost of the Dragon Dollar$ plan. Additions to a Dragon Dollar$ account can be made in any increment at the ID Center‚ $5 increments at any time at Service Centers or any increment online at dragoncenter.uic.edu. Deposits made on line are available immediately.",
        "Students living in a UIC residence hall that does not have private cooking facilities are required to have a traditional meal plan. A default level plan determined by Campus Housing will be assigned to students living in residence halls without private cooking facilities. Students living in UIC apartment style residence halls or off campus students can also purchase a Traditional Meal Plan. Purchases can be made in person at the ID Center. Traditional Meal Plans are non refundable and may only be paid for by charging the purchase to a USFS Student Account. See www.uic.edu/depts/dining/traditional.shtml for more details.",
        "By requesting funds be billed to your student account‚ you acknowledge financial responsibility for the additional charges to your student account. We reserve the right to refuse to provide services billed to a student account when that student account is past due at the time of the request UIC does not mail billing statements to enrolled students. You must check your E-Bill online for these additional charges. These charges are due when billed. Any billing may take up to one month to appear on your student account. Visit below for more information about billing and payment options. There is a $100 minimum and $1000 maximum for student account billing.",
        "A refund from your UIC Dragon Dollar$ account or Traditional Meal Plan is given only when separation from the university occurs. You must request a refund through the Meal Plan Office‚ and must accompany the request with proof of separation. Traditional Meal Plans are refundable based on a weekly prorating schedule. If you are a student‚ Dragon Dollar$ refunds are transferred to your student account to cover any outstanding balances. The remaining credit balance‚ if any‚ will be transferred via direct deposit to the account on file with the University of Illinois. Other patrons‚ including faculty and staff‚ may be refunded through University check.",
        "If your ID card is lost or stolen‚ you must notify the ID Center immediately to limit liability. A replacement ID card can be obtained in either of the ID Centers‚ Room 1790 SSB or Room 241 SCW during office hours. You will be charged a replacement fee. Once your ID card has been replaced‚ your old ID card will be deactivated. Once you have replaced a card or reported it missing‚ the old card cannot be reactivated.",
        "If an account with a positive balance or unused meals has sustained no activity for a period of 12 months or more‚ the account will be determined to be inactive until one of the following occurs:",
        "Dragon Dollar$ debit account balances are available at the registers of the UIC Dining Services and Convenience Store facilities. When you access an account‚ balances are displayed on paper or electronically. Balances are also available at dragoncenter.uic.edu. Dragon Dollar$ transaction history may also be obtained over the phone from the Meal Plan Office or at dragoncenter.uic.edu. For security reasons‚ account balance information is disclosed only to the account holder with proper identification.",
        "As an account holder‚ you are liable for all transactions made on your ID card‚ except for any unauthorized use after you report your card missing. Error Resolution Procedures and Account Holders´ Rights In case of errors or questions about your Dragon Dollar$ or Meal Plans account‚ e-mail idcenter@uic.edu or call the ID Center and",
        "You may be required to send your complaint or question in writing within 10 business days. Failure to respond may result in the complaint or question not being resolved.",
        "You will be notified of the results of our investigation within 5 business days after we hear from you. Any errors will be promptly corrected.",
        "MasterCard is a registered trademark of MasterCard International Incorporated. VISA is a registered trademark of Visa in the United States and other countries. Discover is a registered trademark of NOVUS Credit Services Inc. American Express is a registered trademark of American Express Company",
        "*Terms and Conditions may be subject to change"
    ],
    "out_links": [
        "https://idcenter.uic.edu/",
        "http://uic.edu/",
        "https://idcenter.uic.edu/identification-cards/",
        "https://idcenter.uic.edu/identification-cards/fees/",
        "https://idcenter.uic.edu/identification-cards/visitor-cards/",
        "https://idcenter.uic.edu/identification-cards/departmental-name-badges/",
        "https://idcenter.uic.edu/dragon-dollar/",
        "https://idcenter.uic.edu/dragon-dollar/using-dragon-dollar/",
        "https://idcenter.uic.edu/dragon-dollar/purchase-locations-fees/",
        "http://dining.uic.edu/meal-plans/",
        "http://dragoncenter.uic.edu/",
        "https://idcenter.uic.edu/cta-u-pass/",
        "https://cas.uic.edu/upass_pickup/index2.php",
        "https://idcenter.uic.edu/cta-u-pass/troubleshoot-u-pass/",
        "https://idcenter.uic.edu/cta-u-pass/about-u-pass/",
        "https://idcenter.uic.edu/cta-u-pass/eligibility/",
        "https://idcenter.uic.edu/cta-u-pass/history/",
        "https://idcenter.uic.edu/faq/u-pass-faqs/",
        "https://idcenter.uic.edu/faq/",
        "https://idcenter.uic.edu/faq/identification-cards-faq/",
        "https://idcenter.uic.edu/faq/dragon-dollar-meal-plans-faqs/",
        "http://connect.uic.edu/",
        "http://vcsa.uic.edu/",
        "http://maps.uic.edu/",
        "http://dining.uic.edu/traditional.shtml",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}