{
    "url": "https://grad.uic.edu/academic-support/graduation-information/",
    "title": "Graduation Information | Graduate College | University of Illinois at Chicago",
    "text": [
        "Information on this page is for master’s and doctoral degrees and IBHE certificates. For information on completion of campus certificates or Commencement Ceremonies please use the links below.",
        "To declare your intention to graduate for a certain term you must complete the online Intent to Graduate.  Students should go to MyUIC website and login.  In the “University Links” portet, click on “Student/Faculty/Staff Self Service Login – Main Menu.” Then click on the “Graduation” tab and you will see the link “Apply to Graduate” and then follow the instructions linked below.",
        "Note the following:",
        "Make sure that you complete the text box, if degree information needs to be changed.",
        "The Intent to Graduate must be submitted for the term you intend to graduate.  The online form is available from the time when registration for that term begins through the Friday of the third week of fall and spring semesters, or through the second week of the summer (eight-week) session.  If you complete an Intent to Graduate for one term and do not graduate that term, you must complete another Intent to Graduate for the new term in which you are attempting to graduate.",
        "If you are declaring for a master or doctoral degree, your college is “Graduate College,” except for:",
        "Once you submit the Intent to Graduate a confirmation will appear on the screen, which you may print.  You need to wait for that confirmation to appear before leaving the browser, as that is the only notice you receive of successful submission.  If you submit an Intent to Graduate successfully and you later try to submit another one for the same term, the system will not allow you to do so.",
        "If you are unsure whether or not you correctly submitted an Intent to Graduate, go to MyUIC Website and login.  Click on the “Student” tab, and choose the “Student Self Service” portlet. Then click on the “Graduation” tab and you will see the link “View Active Graduation Applications.” Click the link below to see example screen shots.",
        "If you have lost access to the MyUIC website because you have not been a registered student for over two semesters, use the link below and log into Student, Faculty & Staff Self-Service.  You will be able to complete the Intent to Graduate in Self-Service.  (Note:  If you have forgotten your password, there is a link to change with information on the login page.)",
        "Graduate Concentrations that have been officially approved and that have been certified by the student’s Director of Graduate Studies, or concentration office (interdepartmental only), as having been completed will appear on the diploma when the completed degree is posted.  If you have completed a concentration and the information is not present when processing your Intent to Graduate you must add the information in the text box before submitting the form (see above).  Click below for a list of approved concentrations by program.",
        "The Diploma is a recognition of completion of your degree, although the offical document attesting to completion of a degree is the transcript.  Diplomas are mailed to graduates approximately one month after the term of graduation.  Diplomas are mailed after Fall, Spring and Summer terms and are not distributed at the Fall and Spring term commencement ceremonies.",
        "Diplomas are sent to the Diploma Mailing address in the student database.  Students may change the mailing address as needed using the procedures detailed in the Intent to Graduate.  Alternatively, students may enter a Diploma Mailing Address in Student Self-Service up until one week after final exams end.  If the Diploma Mailing Address needs to be added or changed after that time, the student must contact the Office of Registration and Records (Records) in the Office of Admissions and Records.  Also, if the diploma is not received after three months, or there are questions about the diploma, the Office of Registration and Records (Records) should be consulted.",
        "For contact information and additional information about diplomas consult the Diploma section of the Office of Registration and Records website.",
        "Deadlines for filing the Intent to Graduate, submission of the Thesis/Dissertation to the Graduate College, and submission of Master Project Certificate of Approval forms are listed under the Academic Calendar.",
        "The University of Illinois at Chicago establishes an official date of conferral of degrees for every term (Fall, Spring and Summer).  Although degree requirements, including, for example, defense of thesis, may have been completed earlier in the term, the official date of graduation is what is printed on the student transcript.",
        "The date all requirements have been completed may be needed to qualify for a job, other appointment, or for Practical Training (international students).  However, the official graduation date is the date of degree conferral. Also, the official conferral date of a degree may or may not correspond with the date of your commencement ceremony.",
        "Official graduation dates and commencement information can be found at the links below.",
        "The University of Illinois at Chicago transcript (not the diploma) is the official proof of completion of a degree.  A degree is posted to the student transcript shortly after the end of the term in which the student submits an Intent to Graduate (see above), completes all requirements for the degree, and the student’s Graduate program and Graduate College certify completion.  Approved concentrations (see above) that are completed are also posted at the same time.",
        "For information about transcripts consult the Transcript section of the Office of Registration and Records website."
    ],
    "out_links": [
        "https://grad.uic.edu/",
        "http://uic.edu/",
        "https://grad.uic.edu/admissions/",
        "https://grad.uic.edu/admissions/degree-admission/",
        "https://grad.uic.edu/admissions/deadlines/",
        "https://grad.uic.edu/funding-awards/",
        "https://grad.uic.edu/funding-awards/graduate-funding-overview/",
        "https://grad.uic.edu/funding-awards/graduate-college-fellowships/",
        "https://grad.uic.edu/funding-awards/other-funding/",
        "https://grad.uic.edu/programs/",
        "https://grad.uic.edu/programs/graduate-college-courses/",
        "https://grad.uic.edu/programs/graduate-program-in-neuroscience/",
        "https://grad.uic.edu/diversity/",
        "https://grad.uic.edu/diversity/recruitment/",
        "https://grad.uic.edu/diversity/fellows-mentoring-support-initiative/",
        "https://grad.uic.edu/diversity/dfi-program/",
        "https://grad.uic.edu/funding-awards/graduate-college-fellowships/pif/",
        "https://grad.uic.edu/diversity/pbrc-prep/",
        "https://grad.uic.edu/diversity/srop-program/",
        "https://grad.uic.edu/academic-support/",
        "https://grad.uic.edu/academic-support/academic-dates-events/",
        "https://grad.uic.edu/academic-support/registration-information/",
        "https://grad.uic.edu/academic-support/thesis/",
        "https://grad.uic.edu/academic-support/exams-defense/",
        "https://grad.uic.edu/academic-support/graduate-college-policies/",
        "https://grad.uic.edu/academic-support/ta-enrichment/",
        "https://grad.uic.edu/academic-support/student-resources/graduate-student-forms/",
        "https://grad.uic.edu/academic-support/student-resources/",
        "https://grad.uic.edu/about/",
        "https://grad.uic.edu/about/graduate-college-directory/",
        "https://grad.uic.edu/about/faculty-listings/",
        "https://grad.uic.edu/about/gc-newsletters/",
        "https://grad.uic.edu/about/contact-us/",
        "https://grad.uic.edu/faculty-staff-resources/",
        "https://grad.uic.edu/alumni/",
        "https://grad.uic.edu/about/giving/",
        "http://maps.uic.edu/",
        "https://grad.uic.edu/academic-support/graduation-information/intent-to-complete-a-campus-certificate/",
        "http://commencement.uic.edu/",
        "https://my.uic.edu/",
        "https://registrar.uic.edu/student_records/",
        "https://registrar.uic.edu/uic_faculty_staff/calendars/degree_dates.html",
        "https://commencement.uic.edu/",
        "https://grad.uic.edu/profiles/aguirre-araceli/",
        "https://grad.uic.edu/profiles/kollenbroich-jim/",
        "https://grad.uic.edu/academic-support/thesis/etd/",
        "https://grad.uic.edu/academic-support/thesis/etd/etd-faq/",
        "https://grad.uic.edu/academic-support/thesis/etd/electronic-thesis-and-dissertation-format/",
        "https://grad.uic.edu/academic-support/thesis/etd/electronic-thesis-and-dissertation-submission-process/",
        "https://grad.uic.edu/academic-support/thesis/ithenticate-review-procedures/",
        "https://grad.uic.edu/academic-support/thesis/survey-of-earned-doctorates/",
        "https://grad.uic.edu/academic-support/exams-defense/exams-defense-forms/",
        "https://grad.uic.edu/academic-support/exams-defense/committee-membership-policy/",
        "http://catalog.uic.edu/ucat/academic-calendar/",
        "http://today.uic.edu/",
        "http://events.uic.edu/",
        "http://uic.edu/about/visit-directions",
        "http://clery.uic.edu/",
        "http://oae.uic.edu/UnlawfulDiscrimination/index.htm",
        "http://oae.uic.edu/sexual-misconduct/",
        "http://financialaid.uic.edu/consumer-information/department-education-complaint-process/",
        "https://outlook.uic.edu/",
        "https://accc.uic.edu/service/g-suite",
        "https://grad.uic.edu/wp-admin",
        "https://wellnesscenter.uic.edu/",
        "https://writingcenter.uic.edu/",
        "https://wellnesscenter.uic.edu/resources-and-services/pop-up-pantry/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}