{
    "url": "https://grad.uic.edu/academic-support/student-resources/graduate-student-forms/",
    "title": "Graduate Student Forms | Graduate College | University of Illinois at Chicago",
    "text": [
        "This page hosts links to various forms used (initiated) by graduate students. The office that controls the form is listed at the end of the entry if it is not the Graduate College. Some forms may be examples for viewing only and an original multi-copy form must be used.",
        "Students may also use the Graduate Programs Personnel list to locate their Support Staff contact for their relevant program.",
        "These forms are available to be completed online. Please make note of the list of scenarios for which the online forms may currently be used.",
        "Paper forms remain for other scenarios at this time.",
        "Application for Fellowship, Assistantship, Graduate College Tuition Waiver & Traineeship",
        "(No longer used for Graduate College funding competitions.)",
        "(Under construction…)",
        "Link to form (PDF) below.",
        "",
        "Students should register for courses by the registration deadline for each term.  In addition, students should verify their registration using Student Self-Service, and, if errors are detected, make corrections during the registration period.",
        "In the rare situation that an error is not discovered until after the term ends, students must complete two forms – The Petition for Retroactive Registration or Course Add (OAR form) and the Graduate College Registration Revision Form.  The former must be obtained from either the Registration Office in the Student Services Building (SSB) or the Graduate College.  The latter may be obtained from the student’s program or the Graduate College.",
        "Approval for any retroactive action must be obtained from the student’s Director of Graduate Studies (degree-seeking students only), the Office of International Services (if on a student visa), the Graduate College, and the Registrar of UIC.  Only if all approve the request does the change occur on the student’s transcript.",
        "Additionally, if any type of financial aid was received for the term in question (tuition waiver resulting from a fellowship, assistantship, or Graduate College tuition waiver, or if receiving a student loan, etc.) the Office of Financial Aid must complete their portion of the petition before it is submitted to the Graduate College.  When the Office of Financial Aid closes the fiscal year at the end of August it is virtually impossible to have any adjustments made for that year; therefore, for any retroactive course requests that result in tuition range changes that are recieved after that time, the student will be responsible for the difference in charges.",
        "Please note:",
        "Link to Master’s Project Report Form (PDF) below.",
        "Link to Thesis Manual (PDF) below.",
        "The links below to these forms are provided as samples only. Please obtain an official copy from either your department or the Graduate College.",
        "A graduate student may take courses on the credit/no credit option provided that: (1) The courses are not within the student’s immediate area of specialization, (2) such courses account for no more than one sixth of the total number of course hours taken at UIC and counted toward a degree, and (3) the student submits the Credit/No Credit Option Form to the Graduate College by the tenth day of the fall or spring terms (fifth day of the summer term), with an advisor’s signature. This option cannot be revoked after the close of the (tenth day of instruction – fall and spring terms)(fifth day of instruction – summer term). The student registers and pays for the course using the normal registration procedures. Note that some departments do not allow any credit/no credit hours to be used toward a degree, although courses not used toward a degree may be taken credit/no credit.",
        "Instructors are not informed that the option has been elected, but assign a letter grade in the usual manner. The Office of Admissions and Records retains a record of the letter grade, but it is not entered on the student transcript. A grade of CR is recorded on the transcript if a letter grade of A, B, or C is earned. A grade of NC is recorded on the transcript if a letter grade of D or F is assigned. I and DFR grades are replaced by CR or NC upon completion of the course(s). The grades of CR and NC are not used in the computation of the grade point average.",
        "The Graduate Student Petition (sometimes referred to as the general petition) is to be used by students for most requests of exceptions to policy and rules. Some examples include late course adds and drops (along with Graduate College Registration Revision Form; see Instructions for Graduate College Registration Revision Form below for when the Graduate Student Petition is necessary), extension of time to complete the degree, extension of probation, extension of time to complete and incomplete (I) grade. It should not be used for late registration (attempts to register after the registration period is over if you are not in any hours), transfer credit, leave of absence, and university withdrawal (drop all courses for a term), as these actions have individual forms.",
        "Students should provide clear and concise statements for what is being requested along with relevant rationale. The Graduate Student Petition requires advisor (or instructor, if appropriate) and Director of Graduate Studies signatures, and justification of their position. (Nondegree students do not need the Director of Graduate Studies signature – nondegree students should write “nondegree” on the lines in that section).",
        "Once a decision is made by the Graduate College a copy of the form will be mailed to the student at the address provided on the form.",
        "The Graduate College Registration Revision Form must be used for all course transactions for which the deadline has passed (i.e., no longer supported via the Web-based registration system), except if you are dropping all courses for the term (see below). A number of transactions also require a petition with the revision form. The different scenarios are described below. Please be aware that your transaction will not be processed by the Office of Registration and Records if you have a registration hold for any reason. Any course request after the sixth week (fifth in summer), or for a term that has already ended must be accompanied by a Graduate Student Petition. Approval is not guaranteed for any transaction. (Note: all transactions before the deadlines must be done online by the student.)",
        "There are various registration requirements for recipients of financial awards. It is your responsibility to ensure that the requested transaction does not jeopardize your award. The registration requirements for awards administered by the Graduate College are listed on the front of this form. Consult the Office of Financial Aid regarding registration requirements for loans.",
        "Registration After the Late Registration Period Has Ended",
        "If you missed the late registration period without registering for any courses and you need to be registered, you must obtain a Petition to Register After the Deadline from the Office of Registration and Records in SSB. Complete that petition along with the Graduate College Registration Revision Form, obtain signatures as needed, and bring both to the Graduate College for review. If approved, you will take the forms to the Office of Registration and Records in SSB for their final review. Approval is not guaranteed, and if approved, a late registration charge will be added to your bill.",
        "Adding a Course to Your Existing Schedule After the Close of Late Registration",
        "Adding a course to your existing schedule after the registration period has closed requires that a Graduate College Registration Revision Form be submitted to the Graduate College by the sixth week of fall or spring and the fifth week of summer. Approval is needed from the department offering the course, your director of graduate studies, and the Graduate College. The form must be submitted to the Graduate College immediately after your director of graduate studies approves the transaction. Course adds after the sixth week of fall or spring and the fifth week of summer must be accompanied by a Graduate Student Petition form.",
        "Corrections to Sections of the Same Course or to Hours for Variable-Credit Courses",
        "Corrections for entry errors require that a Graduate College Registration Revision Form with required signatures be submitted to the Graduate College immediately upon discovery of the error. After the sixth week of fall or spring and the fifth week of summer, a Graduate Student Petition form must accompany this form.",
        "Dropping Courses After the Deadline",
        "There are various deadlines for dropping courses, and each have different procedures. All drops after the second week of fall and spring and the first week of summer receive a W.",
        "Dropping all courses through the official tenth day (fifth day in summer) of the term",
        "You must must drop all but your last class using the online registration system. The system does not allow you to drop the last class, so select the “Withdraw from Term/Cancel Registration” link on the Registration menu to notify the Office of Registration and Records of your intent to withdraw from the last class. If this is done before the official first day of classes, you will receive a 100 percent refund. Consult the UIC Schedule of Classes for complete information and the refund percentage for once classes begin.",
        "Dropping all courses after the official tenth day (fifth day in summer) of the term and through the last business day before the designated final exam period",
        "Complete a University Withdrawal form and obtain signatures from your director of graduate studies (except nondegree students), International Services if on a visa, and the Graduate College. A pro-rata reduction of tuition may apply. Withdrawals will not be approved once the final exam period (the official week for final exams in fall and spring, or the last two days of summer session) has begun. Consult the UIC Schedule of Classes for complete information.",
        "Dropping a course while remaining in other courses",
        "Students may drop courses, with their advisor’s approval, online through the second week of fall or spring and the first week of summer. To drop a course in weeks three to six (two to five in summer) degree-seeking students, and nondegree students assigned to a program, must complete a Graduate College Registration Revision Form, obtain signature approval from the director of graduate studies of the student’s program (not the department of the course), and submit the form to the Office of Registration and Records in SSB immediately and no later than the end of the sixth week (fifth in summer). Unassigned nondegree students only need to complete the form (no approval required) and submit to the Office of Registration and Records as stated directly above. For any attempted drop after the sixth week of fall and spring and the fifth week of summer, students need to submit a completed Graduate College Registration Revision Form (unless dropping all courses—see above) and a Graduate Student Petition. Approval is not guaranteed.",
        "Link to sample Leave of Absence form and instructions below.",
        "Used to transfer courses from another institution, and courses taken at UIC while nondegree, in a different graduate program, or a college other than the Graduate College (including graduate courses taken while an undergraduate at UIC). Should not be used to recognize a previously earned master’s for doctoral students.",
        "Link to Examination Report Sample (PDF) below."
    ],
    "out_links": [
        "https://grad.uic.edu/",
        "http://uic.edu/",
        "https://grad.uic.edu/admissions/",
        "https://grad.uic.edu/admissions/degree-admission/",
        "https://grad.uic.edu/admissions/deadlines/",
        "https://grad.uic.edu/funding-awards/",
        "https://grad.uic.edu/funding-awards/graduate-funding-overview/",
        "https://grad.uic.edu/funding-awards/graduate-college-fellowships/",
        "https://grad.uic.edu/funding-awards/other-funding/",
        "https://grad.uic.edu/programs/",
        "https://grad.uic.edu/programs/graduate-college-courses/",
        "https://grad.uic.edu/programs/graduate-program-in-neuroscience/",
        "https://grad.uic.edu/diversity/",
        "https://grad.uic.edu/diversity/recruitment/",
        "https://grad.uic.edu/diversity/fellows-mentoring-support-initiative/",
        "https://grad.uic.edu/diversity/dfi-program/",
        "https://grad.uic.edu/funding-awards/graduate-college-fellowships/pif/",
        "https://grad.uic.edu/diversity/pbrc-prep/",
        "https://grad.uic.edu/diversity/srop-program/",
        "https://grad.uic.edu/academic-support/",
        "https://grad.uic.edu/academic-support/academic-dates-events/",
        "https://grad.uic.edu/academic-support/registration-information/",
        "https://grad.uic.edu/academic-support/thesis/",
        "https://grad.uic.edu/academic-support/exams-defense/",
        "https://grad.uic.edu/academic-support/graduate-college-policies/",
        "https://grad.uic.edu/academic-support/ta-enrichment/",
        "https://grad.uic.edu/academic-support/graduation-information/",
        "https://grad.uic.edu/academic-support/student-resources/",
        "https://grad.uic.edu/about/",
        "https://grad.uic.edu/about/graduate-college-directory/",
        "https://grad.uic.edu/about/faculty-listings/",
        "https://grad.uic.edu/about/gc-newsletters/",
        "https://grad.uic.edu/about/contact-us/",
        "https://grad.uic.edu/faculty-staff-resources/",
        "https://grad.uic.edu/alumni/",
        "https://grad.uic.edu/about/giving/",
        "http://maps.uic.edu/",
        "https://grad.uic.edu/academic-support/student-resources/graduate-programs-personnel/",
        "https://admissions.uic.edu/graduate-professional/apply",
        "https://admissions.uic.edu/graduate-professional/application-status",
        "https://www.ois.uic.edu/students/prospective/declaration_and_certification_of_finances___d_c_f_",
        "https://grad.uic.edu/funding-awards/graduate-college-fellowships/student-presenter-awards/",
        "https://grad.uic.edu/funding-awards/graduate-college-fellowships/student-presenter-awards/presenter-awards-application/",
        "https://gradstudentcouncil.uic.edu/",
        "https://grad.uic.edu/programs/chicago-metropolitan-exchange-program/",
        "https://grad.uic.edu/academic-support/thesis/etd/",
        "https://grad.uic.edu/academic-support/thesis/etd/etd-faq/",
        "https://grad.uic.edu/academic-support/thesis/etd/electronic-thesis-and-dissertation-format/",
        "https://grad.uic.edu/academic-support/thesis/etd/electronic-thesis-and-dissertation-submission-process/",
        "https://grad.uic.edu/academic-support/thesis/ithenticate-review-procedures/",
        "https://grad.uic.edu/academic-support/thesis/survey-of-earned-doctorates/",
        "https://grad.uic.edu/academic-support/exams-defense/exams-defense-forms/",
        "https://grad.uic.edu/academic-support/exams-defense/committee-membership-policy/",
        "http://catalog.uic.edu/ucat/academic-calendar/",
        "http://today.uic.edu/",
        "http://events.uic.edu/",
        "http://uic.edu/about/visit-directions",
        "http://clery.uic.edu/",
        "http://oae.uic.edu/UnlawfulDiscrimination/index.htm",
        "http://oae.uic.edu/sexual-misconduct/",
        "http://financialaid.uic.edu/consumer-information/department-education-complaint-process/",
        "https://my.uic.edu/",
        "https://outlook.uic.edu/",
        "https://accc.uic.edu/service/g-suite",
        "https://grad.uic.edu/wp-admin",
        "https://wellnesscenter.uic.edu/",
        "https://writingcenter.uic.edu/",
        "https://wellnesscenter.uic.edu/resources-and-services/pop-up-pantry/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}