{
    "url": "https://campuscare.uic.edu/about/",
    "title": "About | CampusCare",
    "text": [
        "Eligible students include all registered Undergraduate, Graduate, and Health Professional students taking at least one class that charges them with tuition and mandatory fees. Eligible fellows working under a T/32 or F/32 grant at UIC are also eligible for CampusCare (to verify if you are eligible please contact your program administrator). To verify if you are a member, students can view the CampusCare charge by going to their student account bill (E-Bill). If you are not charged with the CampusCare Fee you are not a member of CampusCare. “Online only” students and “Option B” students are NOT eligible for CampusCare. **Please note: Online only students will be charged the CampusCare fee for the Summer of 2020, due to the COVID-19 pandemic, therefore a waiver must be submitted with your current Health Insurance information to remove our fee.**",
        "CampusCare does not provide an extension of coverage or Cobra policy for Fall or Spring semesters. Students who are taking a leave of absence or graduating cannot continue coverage to the next semester in Fall or Spring. Please refer to the Summer Coverage page for more information regarding your CampusCare coverage options.",
        "Students with comparable health insurance coverage, for example through a legal guardian or an employer, can waive out of the program by submitting the online Waiver Form before the Enrollment Period Deadline Date.",
        "Please Note: CampusCare is your health benefits coverage program, we are NOT a clinic where you can obtain medical services. Please contact Family Medicine for all appointments, medical issues, or medical questions.",
        "Important features of the CampusCare program:",
        "CampusCare Coverage",
        "Students have an opportunity to waive out of the program, reinstate benefits, enroll/drop dependents by submitting the appropriate online forms before the Enrollment Period Deadline Date at the beginning of each semester.",
        "Please click on the following for further information:",
        "Eligible Dependents must be either the Member’s:",
        "Visit the Dependents Information page for further information",
        "**Please note that all international Marriage Certificates and Birth Certificates must be translated to English.**",
        "Visit the Waiver & Reinstatements Form page for further information",
        "Visit the Waiver & Reinstatements Form page for further information",
        "All students registering for the Summer term (4 or 8 week Summer Session), without an approved waiver on file, will be automatically enrolled into CampusCare and charged the Summer fee. These students should complete and submit a Summer Continuation Form in order to ensure coverage.",
        "Students that are NOT taking Summer classes or are graduating, and have CampusCare coverage for the Spring term of that academic year, are able to continue CampusCare coverage through the Summer by completing and submitting a Summer Continuation Form by the Enrollment Period Deadline Date.",
        "**Please note: Online only students will be charged the CampusCare fee for the Summer of 2020, due to the COVID-19 pandemic, therefore a waiver must be submitted with your current Health Insurance information to remove our fee.**",
        "Visit the Summer Continuation page for further information",
        "Students Who Are:",
        "Students who register late AND after the CampusCare Enrollment Period Deadline Date do NOT have an opportunity to waive coverage or add exisiting Dependents.",
        "The effective date of coverage is the date on which the late registration is entered and processed in the student records system by the Office of Records and Registration.",
        "Students studying abroad are required to purchase international health insurance coverage specifically designed to cover services provided outside the United States.",
        "CampusCare only covers health services provided in the United States. In addition to the required international health insurance coverage, students studying abroad must have domestic coverage in order to waive out of CampusCare. CampusCare coverage can be continued during semesters abroad to provide domestic health coverage in the event it is needed.",
        "Students participating in a recognized Study Abroad Program who have not previously waived CampusCare coverage will be automatically enrolled (along with any enrolled dependents) in CampusCare for their term abroad and assessed the Student Health Insurance Fee.",
        "Students who do not wish to have concurrent domestic health benefits coverage under CampusCare during their term abroad must submit a Waiver Form before the Enrollment Period Deadline Date.",
        "Students who previously waived out of CampusCare but wish to have concurrent domestic coverage under CampusCare during their term abroad should submit a Reinstatement Form before the Enrollment Period Deadline Date. Students may also enroll eligible dependents by submitting the Dependent Enrollment Form before the Enrollment Period Deadline Date.",
        "Questions regarding international health insurance coverage may be directed to the UIC Study Abroad Office at 312-413-7662.",
        "Covered CampusCare members have additional emergency medical assistance through the WorldNet Travel Assistance Program when studying abroad. To find out more about services provided under the WorldNet program call 800-290-7602 or visit http://uoi.mymemberinfo.com/insurance-benefits.aspx#3.",
        "Any employee under 50% employment, that does not have an approved waiver on file, will be charged with the CampusCare fee automatically. These employees must waive out as traditional students if they have their own health insurance.",
        "Visit the Waiver & Reinstatements Form page for further information",
        "",
        "© Copyright 2014-2020 The Board of Trustees of the University of Illinois"
    ],
    "out_links": [
        "https://campuscare.uic.edu/",
        "https://campuscare.uic.edu/benefits/",
        "https://campuscare.uic.edu/covid-19-information/",
        "https://campuscare.uic.edu/popular-links/",
        "https://campuscare.uic.edu/faqs/",
        "https://campuscare.uic.edu/policies/",
        "https://campuscare.uic.edu/claims/",
        "https://campuscare.uic.edu/physicians-screen/",
        "https://campuscare.uic.edu/contact-us/",
        "http://campuscare.publish.uic.edu/summer-coverage/",
        "https://mycampuscare.uic.edu/login/",
        "https://campuscare.uic.edu/dates-fees/",
        "https://campuscare.uic.edu/campuscare-health-center-physicians/",
        "http://campuscare.publish.uic.edu/?p=218",
        "http://campuscare.publish.uic.edu/?p=270",
        "https://campuscare.uic.edu/campuscare-as-secondary-insurance/",
        "https://campuscare.com.uic.edu/",
        "http://campuscare.publish.uic.edu/dates-fees/",
        "http://campuscare.publish.uic.edu/dependent-information/",
        "http://campuscare.publish.uic.edu/waivers-reinstatement-forms/",
        "http://www.uic.edu/uic/studentlife/studentservices/disability.shtml",
        "http://www.uic.edu/uic/studentlife/campus/emergency-information.shtml"
    ]
}