{
    "url": "https://wellnesscenter.uic.edu/resources-and-services/pop-up-pantry/",
    "title": "Pop-Up Pantry | Wellness Center | University of Illinois at Chicago",
    "text": [
        "Pop-Up Pantry - Feeding the Flames since 2014",
        "The mission of the Pop-Up Pantry is to combat food insecurity among students at the University of Illinois at Chicago (UIC). UIC students come from a plethora of backgrounds and our aim is to assist those who may be facing personal and/or financial hardship.  It is especially important that during these college years all students are healthy and able to focus by always having enough to eat. Research shows that proper nutrition is critical for cognitive function and memory. Food is a basic human right.",
        "During the summer of 2014, Carol Petersen, the Associate Director of the UIC Wellness Center and Brandon Gaskew the 2014-2015 Undergraduate Student Government (USG) Vice President, developed the Pop-Up Pantry to target the growing food insecurity on campus.  The initiative was successful from the beginning and aided a large number of students. Since the inception, the Wellness Center with the support of UIC faculty, staff, students, USG, Office of the Vice Chancellor for Student Affairs, and many other supporters have served over 3,252 bags of food to UIC students who are experiencing food insecurity.   As of May 2017, the Wellness Center is proud to announce our partnership with the Greater Chicago Food Depository (GCFD).  This partnership will allow us access to fresh fruits, vegetables, and dairy to better serve the nutritional needs of our students.",
        "**COVID-19 Update (03/20/2020): We are happy to announce that the UIC Pop-Up Pantry remains open to serve you throughout this critical moment in history. UIC administrators are working diligently on your behalf, and it is their concern that fuels the Pantry’s ability to continue to be here for you. UIC Pop-Up Pantry COVID-19 hours: Every Tuesday and Wednesday from 2:00 to 4:00 pm at Wellness Center (in effect until further notice) Please don’t forget to bring your I-card and multiple reusable bags as we do not offer any bags. For safety purposes, please wear a mask/ scarf and gloves (winter gloves if needed).",
        "When you are shopping the Pantry, please practice social distancing by standing 6ft away from shoppers and Wellness staff.",
        "—————————————————————————————————————————————————————————-",
        "During the regular fall and spring semesters, we are open every Wednesday and Thursday from 1:00 pm – 4:00 pm. *During the summer and holiday breaks, Pantry hours are subject to change*",
        "—————————————————————————————————————————————————————————-",
        "",
        "—————————————————————————————————————————————————————————-",
        "The Pantry is permanently housed in the Wellness Center.",
        "",
        "Dear UIC Student,",
        "Welcome to the community of UIC Pop-Up Pantry users.  This resource, exclusively for UIC students, is to help you manage life emergencies, financial challenges, and unexpected life circumstances. The Wellness Center runs the Pantry in order to help you, the student, move beyond the life challenge of food insecurity, have access to free and nutritious food, with the ultimate goal of helping you achieve academic success.",
        "This service of free food exists only due to voluntary donations given to the Pantry from people who care.  Without them, the Wellness Center would have no food to distribute to you through the Pantry.  This means that our supply of food is limited, that we offer only what we have been given, and that we work hard to make sure that this limited supply of food feeds as many students as possible.",
        "Please help us to feed/serve you and other students by reading ALL of the information listed below.",
        "Nine Important Facts to Know about the UIC Pop-Up Pantry:",
        "If you are experiencing Very Low Food Security, we encourage you to use the UIC Food Pantry. It was created for you!",
        "Steps to Becoming a Pantry User:",
        "Rules for Shopping the Pantry:",
        "** Please be mindful of other shoppers who are in need of food when shopping at the Pantry. **",
        "**Products are split between both days to ensure fairness**",
        "** We believe in sustainability, please bring your own shopping bag.",
        "** We are proud to offer fresh items such as milk and eggs, but be mindful of your commute time.  Shop and plan accordingly so items do not spoil.  Especially during the hot summer months.",
        "** Individuals are served first come, first served.  Please be mindful that due to limited supplies and quantities of some items, they may be gone before you arrive to shop.  Please be patient as we expand our selection and quantities to accommodate everyone.",
        "Without donations, the Pop-Up Pantry would not exist. Even with the support of fresh produce and dairy from the Greater Chicago Food Depository, donated canned and dry goods are still critical.  If you want to support the Pop-Up Pantry, we currently accept both food and monetary donations. No amount is too small. If you wish to make a monetary donation, please click below.",
        "Food donations are accepted throughout the year and can be dropped off at a designated bin throughout numerous buildings on campus or directly to the Wellness Center. We accept food donations as well as donations of toiletries and period products. (E.g.: shampoo, conditioner, body wash, soap, deodorant, period products, kleenex, toilet paper, etc.)",
        "Most needed items:",
        "The Pop-Up Pantry does NOT accept:",
        "Ways You Can Support the Pantry!",
        "Volunteer at the Greater Chicago Food Depository and ask if your “credit” can be directed to UIC’s Wellness Center Pop-Up Pantry! (You can volunteer yourself or go with a group!) Link: https://www.chicagosfoodbank.org/volunteer/",
        "If you are a part of an organization and are interested in hosting a food drive for the pantry, please send an email to wellnesscenter@uic.edu, and we will provide you with bins for your food drive.",
        "Pantry Elves: To be efficient, the pantry utilizes UIC staff to support the pantry in its food collection efforts. Pantry elves, composed of UIC faculty and staff, provide a vital service and are located throughout the east and west campus and have bins located in their area or building.  If you are interested in becoming a pantry elf, please email,  wellnesscenter@uic.edu"
    ],
    "out_links": [
        "https://wellnesscenter.uic.edu/",
        "http://uic.edu/",
        "https://wellnesscenter.uic.edu/about-us/",
        "https://wellnesscenter.uic.edu/about-us/need-help/",
        "https://wellnesscenter.uic.edu/about-us/faqs/",
        "https://wellnesscenter.uic.edu/about-us/contact/",
        "https://wellnesscenter.uic.edu/news-and-events/",
        "https://wellnesscenter.uic.edu/news-and-events/calendar/",
        "https://wellnesscenter.uic.edu/news-and-events/annual-events/",
        "https://wellnesscenter.uic.edu/news-and-events/past-events/",
        "https://wellnesscenter.uic.edu/resources-and-services/",
        "https://wellnesscenter.uic.edu/resources-and-services/individual-consultations/",
        "https://wellnesscenter.uic.edu/resources-and-services/homeless-assistance/",
        "https://wellnesscenter.uic.edu/resources-and-services/wellness-supplies/",
        "https://wellnesscenter.uic.edu/resources-and-services/stress-relief-place/",
        "https://wellnesscenter.uic.edu/resources-and-services/sexual-health/",
        "https://wellnesscenter.uic.edu/resources-and-services/literature-library/",
        "https://wellnesscenter.uic.edu/resources-and-services/alcohol-e-chug/",
        "https://wellnesscenter.uic.edu/resources-and-services/studying-2/",
        "https://wellnesscenter.uic.edu/resources-and-services/conflict-management/",
        "https://wellnesscenter.uic.edu/resources-and-services/sleep/",
        "https://wellnesscenter.uic.edu/workshops/",
        "https://wellnesscenter.uic.edu/workshops/workshops-offered/",
        "https://wellnesscenter.uic.edu/workshops/request-a-workshop/",
        "https://wellnesscenter.uic.edu/policies/",
        "https://wellnesscenter.uic.edu/policies/alcohol-and-other-drug/",
        "https://wellnesscenter.uic.edu/policies/smoke-free-campus-policy-fine-payment/",
        "https://wellnesscenter.uic.edu/policies/student-disciplinary-policy/",
        "https://wellnesscenter.uic.edu/policies/cannabis-policy/",
        "http://connect.uic.edu/",
        "http://studentaffairs.uic.edu/",
        "http://maps.uic.edu/",
        "https://wellnesscenter.uic.edu/resources-and-services/pop-up-pantry/donate/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}