{
    "url": "https://grad.uic.edu/about/giving/",
    "title": "Giving to the Graduate College | Graduate College | University of Illinois at Chicago",
    "text": [
        "Welcome to the online giving section of UIC’s Graduate College.",
        "UIC graduate students conduct cutting-edge research on ecologically sustainable farming techniques in southern Mexico, Ming dynasty porcelain kiln production in Fujian Province, China, and vascular neurogenic niche in stroke victims; they teach foundational courses in the humanities and laboratory sciences; and they help to run some of our academic units – to enumerate a few examples. In short, they are vital to the success of our university and of our society.",
        "The Graduate College currently offers approximately 250 scholarships, fellowships, and awards each year, including to the three students’ projects above. Your expertise, mentorship, career counseling, or financial investment would allow us to sustain and grow our initiatives, which attempt to reach all of UIC’s approximately 8,000 master’s and doctoral students.",
        "Additional funding is crucial for sustaining and expanding our initiatives. You can help!",
        "",
        "Then take the lead with a world-class graduate education that cultivates informed, empowered citizens of the world. Tenacious individuals who are compelled to be a part of something bigger, something remarkable. These will be the people of character and consequence. The ones who will apply courage, will, and invention to the betterment of humankind. These are the people the world has been waiting for.",
        "Together we will:",
        "The Graduate College is the engine for a growing number of activities. Areas of need include:",
        "$100  Student Presenter Award  —  This award helps to defray the cost of travel for a graduate student presenting her research or scholarly work at an academic conference.",
        "$500  Emergency Grants  —  Help a student who experiences an acute and unexpected short-term hardship.",
        "$750  Annual Graduate College Outstanding Thesis Award —  Given to the most outstanding master’s thesis or doctoral dissertation in each of the Graduate College’s four divisions.",
        "$1,000-$3,000  Graduate Research Awards —  Institutional monies and the W.C. and May Preble Deiss Fund for Biomedical Research currently fund these awards for graduate research in two competitions annually. See “Endowed Award” below.",
        "$5,000  Interdisciplinary Collaboration in the Arts and Humanities Award — Established with funds from the Continental Bank, this award funds a collaboration between a graduate student in the fine arts or humanities and an untenured faculty member in any graduate program.  Three awards were made in 2014; however, a new sponsor will be needed to continue this award after 2015. See “Endowed Award” below.",
        "$22,000  Graduate Student Fellowship — Institutional monies are used to fund three different fellowship programs:  two are primarily two-year recruitment fellowships for top students, especially underrepresented minorities; the third is a dissertation completion fellowship.",
        "$25,000-50,000  Endowed Award — Endow a travel or research award like the Barnhurst-Doherty Award for UIC graduate students working on LGBTQ issues.",
        "$50,000+  Professional Development Sponsorship  —  This amount could underwrite a professional development workshop series or a staff position.",
        "$150,000+  Endowed Fellowship  — Create a fellowship that enables graduate students to focus on their scholarship for a year instead of juggling research and a part-time job.",
        "$150,000+ Endowed Lecture Series — Invited lectures play an important role in the academic life of the campus, allowing students and faculty interact with distinguished leaders. Each endowed lecture series helps us cover the expenses of bringing renowned speakers to campus.",
        "$400,000  Summer Research Opportunities Program  — Fund our highly successful program for a year; it introduces domestic underrepresented sophomores and juniors to one-on-one academic research experiences with a faculty mentor.",
        "$5,000,000  Named Dean  —  The University uses Named Dean funds to support non-salary, one-time expenses for his or her department. Once a Dean’s position has been named, all successors are accorded the same title, which is included in the Board of Trustees approval process for faculty appointments.",
        "$7,000,000  Named College — To be approved by the Provost and the Chancellor, these funds provide unrestricted support for the college. The Board of Trustees must be notified and approve the gift before a gift agreement is signed.",
        "Making a gift is easy. Just select one of the options from the list below or designate your gift to specific Graduate College initiatives you have been supporting or wish to support.",
        "You can give with confidence knowing your gift transactions are safe, secure and very much appreciated.",
        "When you have completed this form, click the Continue Donation button and you will be directed to the University of Illinois Foundation secure Online Giving site for your personal information.",
        "Unrestricted fund to benefit graduate students and promote community amongst the graduate population at UIC.",
        "Supports graduate students and will provide awards, including competitive fellowships for exceptional graduate students.",
        "The purpose of the Graduate College’s Fellows Mentoring and Support Initiative is to expand outreach efforts to Diversifying Faculty in Higher Education in Illinois and Abraham Lincoln Fellowship recipients. The goal is to provide fellows with career and personal mentoring, advice, and referral support in order to promote successful completion of their graduate degree and to pursue their career objectives. Alumni working in academic, non-profit, industrial, and corporate settings are invited to engage in mentorship relationships. We seek alumni with PhDs in all disciplines who can provide additional feedback to doctoral candidates with respect to dissertation research, degree progress, training, and employment opportunities. A matched pair design will be used whereby an alumna/us is matched with a mentee in a related academic discipline or field. We ask for a one-year commitment. Mentorship can be virtual via video conference, telephone, email, etc. The Graduate College will offer initial training and will monitor progress towards academic and professional goals twice each year. Alumni are also invited to present on topics germane to their professions and mentoring. We hope you’ll join us in this effort.",
        "For more information, please contact Lunaire D. Ford, PhD, Assistant Dean, via email or telephone (312) 413-2556.",
        "What do you wish someone had told you when you were in graduate school? We would love for Graduate College alumni to come back and share their knowledge and experience with our current graduate students. There are a variety of opportunities for sharing expertise and guidance. We are seeking guest speakers and discussion leaders to lead brown bag talks and conversations, as well as individuals to take part in career panels whereby alumni share information about what it is like to work in their particular fields. Lastly, we are seeking workshop presenters. Are you excellent at networking or great at public speaking? Do you manage time well, multi-task and organize information, or possess other strong professional skills? Workshop presentations provide alumni with the opportunity to share their knowledge in a class format with students as part of single or multiple sessions. Any additional ideas or suggestions are greatly appreciated. We look forward to hearing from you!",
        "For more information, please contact Theresa Christenson-Caballero, Assistant Director of Graduate Student Outreach and Career Development, via email or telephone (312) 355-2137.",
        "The Graduate College is currently investigating how it can better serve as an intermediary for current graduate students wanting or needing internship experience. Alumni could help us to facilitate these connections through networking and alerting us to internship opportunities hosted by their employer.",
        "For more information, please contact Benn Williams, Assistant Director of Interdisciplinary Programs and Development, via email or telephone (312) 413-2389.",
        "Commemorative gifts are a thoughtful means of honoring or memorializing a family member or a beloved faculty/staff member. There are several ways to establish a memorial or tribute gift: make an outright gift; make a bequest in your will; and/or set up an endowment to fund a special program in perpetuity.",
        "For more information, please contact Benn Williams, Assistant Director of Interdisciplinary Programs and Development, via email or telephone (312) 413-2389.",
        "",
        "Leave a legacy! Of all the forms of private giving to higher education, endowments offer the most influential investment in the lives of future graduate students.",
        "In an endowment fund, the principal is invested in perpetuity with a portion of the investment’s earnings spent according to the donor’s wishes. The remainder of the earnings return to the endowment to provide a growing, long-term source of funding. Endowments may be either restricted or unrestricted.",
        "An endowment can be created through an outright gift, through a bequest in a will, or through a life income gift such as a charitable gift annuity or a charitable remainder trust. To minimize administrative costs, the minimum amount required to establish a permanent endowment account is $25,000. Lesser amounts are sometimes accepted.",
        "For more information, please contact Benn Williams, Assistant Director of Interdisciplinary Programs and Development, via email or telephone (312) 413-2389."
    ],
    "out_links": [
        "https://grad.uic.edu/",
        "http://uic.edu/",
        "https://grad.uic.edu/admissions/",
        "https://grad.uic.edu/admissions/degree-admission/",
        "https://grad.uic.edu/admissions/deadlines/",
        "https://grad.uic.edu/funding-awards/",
        "https://grad.uic.edu/funding-awards/graduate-funding-overview/",
        "https://grad.uic.edu/funding-awards/graduate-college-fellowships/",
        "https://grad.uic.edu/funding-awards/other-funding/",
        "https://grad.uic.edu/programs/",
        "https://grad.uic.edu/programs/graduate-college-courses/",
        "https://grad.uic.edu/programs/graduate-program-in-neuroscience/",
        "https://grad.uic.edu/diversity/",
        "https://grad.uic.edu/diversity/recruitment/",
        "https://grad.uic.edu/diversity/fellows-mentoring-support-initiative/",
        "https://grad.uic.edu/diversity/dfi-program/",
        "https://grad.uic.edu/funding-awards/graduate-college-fellowships/pif/",
        "https://grad.uic.edu/diversity/pbrc-prep/",
        "https://grad.uic.edu/diversity/srop-program/",
        "https://grad.uic.edu/academic-support/",
        "https://grad.uic.edu/academic-support/academic-dates-events/",
        "https://grad.uic.edu/academic-support/registration-information/",
        "https://grad.uic.edu/academic-support/thesis/",
        "https://grad.uic.edu/academic-support/exams-defense/",
        "https://grad.uic.edu/academic-support/graduate-college-policies/",
        "https://grad.uic.edu/academic-support/ta-enrichment/",
        "https://grad.uic.edu/academic-support/graduation-information/",
        "https://grad.uic.edu/academic-support/student-resources/graduate-student-forms/",
        "https://grad.uic.edu/academic-support/student-resources/",
        "https://grad.uic.edu/about/",
        "https://grad.uic.edu/about/graduate-college-directory/",
        "https://grad.uic.edu/about/faculty-listings/",
        "https://grad.uic.edu/about/gc-newsletters/",
        "https://grad.uic.edu/about/contact-us/",
        "https://grad.uic.edu/faculty-staff-resources/",
        "https://grad.uic.edu/alumni/",
        "http://maps.uic.edu/",
        "https://grad.uic.edu/?page_id=21873",
        "https://grad.uic.edu/funding-awards/the-image-of-research/",
        "https://grad.uic.edu/diversity/the-passage-scholars-program/",
        "https://ita.grad.uic.edu/",
        "http://catalog.uic.edu/ucat/academic-calendar/",
        "http://today.uic.edu/",
        "http://events.uic.edu/",
        "http://uic.edu/about/visit-directions",
        "http://clery.uic.edu/",
        "http://oae.uic.edu/UnlawfulDiscrimination/index.htm",
        "http://oae.uic.edu/sexual-misconduct/",
        "http://financialaid.uic.edu/consumer-information/department-education-complaint-process/",
        "https://my.uic.edu/",
        "https://outlook.uic.edu/",
        "https://accc.uic.edu/service/g-suite",
        "https://grad.uic.edu/wp-admin",
        "https://wellnesscenter.uic.edu/",
        "https://writingcenter.uic.edu/",
        "https://wellnesscenter.uic.edu/resources-and-services/pop-up-pantry/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}