{
    "url": "https://www.cs.uic.edu/~mmaggion/",
    "title": "Marco Maggioni’s Homepage",
    "text": [
        "I am also contributing to IBEIS (Image-Based Ecological Information System). This research project aims to build a large autonomous computational system that starts from image data and progresses all the way to answering ecological and conservation queries. Based on image analysis algorithms, IBEIS can identify individuals from species with distinctive striped, spotted, wrinkled or notched markings, such as elephants, giraffes and zebras. I am focusing on scaling IBEIS and its algorithms to the magnitude of image data available nowadays, with particular interest in using GPUs.",
        "Briefly about me",
        "My name is Marco Maggioni and I’m from Italy. I’m currently a Ph.D candidate in Computer Science at University of Illinois at Chicago. If you want to know more about me, you can take a look at my résumé and at my linkedin profile.",
        "",
        "Research groups",
        "",
        "Computational Population Biology Lab",
        "",
        "Image-Based Ecological Information System",
        "",
        "Argonne National Laboratory",
        "",
        "",
        "",
        "Contacts",
        "Email:",
        "mmaggi3@uic.edu",
        "Phone:",
        "312-996-8635",
        "Address:",
        "University of Illinois at Chicago",
        "Engineering Research Facility",
        "842 W. Taylor St., Room 3028",
        "Chicago, IL, 60607-7053",
        "",
        "Recent Conferences",
        "",
        "AsHES2014, CoAdELL:  Adaptivity and Compression for Improving Sparse Matrix-Vector Multiplication on GPUs, M. Maggioni and T. Y. Berger-Wolf, International Workshop on Accelerators and Hybrid Exascale Systems, 2014, Phoenix, May 20, to appear",
        "",
        "GTC2014, Adaptivity and Compression: a Recipe for Sparse Matrix-Vector Multiplication on GPUs, M. Maggioni and T. Y. Berger-Wolf, NVIDIA GPU Technology Conference, 2014, San Jose, March 24-27",
        "",
        "ICPP2013, AdELL: An Adaptive Warp-Balancing ELL Format for Efficient Sparse Matrix-Vector Multiplication on GPUs, M. Maggioni and T. Y. Berger-Wolf, International Conference on Parallel Processing, 2013, Lyon, France, October 1-4, pp. 11-20",
        "",
        "ICCS2013, An Architecture-Aware Technique for Optimizing Sparse Matrix-Vector Multiplication on GPUs, M. Maggioni and T. Y. Berger-Wolf, International Conference on Computational Science, 2013, Barcelona, Spain, June 5-7,pp. 329-338",
        "",
        "HiCOMB2013, GPU-based Steady-State Solution of the Chemical Master Equation, M. Maggioni, T. Y. Berger-Wolf and J. Liang, International Workshop on High Performance Computational Biology, 2013, Boston, May 20, pp. 579-588",
        "",
        "GTC2013, Unveiling Cellular Mechanisms using GPU-based Sparse Linear Algebra, M. Maggioni, T. Y. Berger-Wolf and J. Liang, NVIDIA GPU Technology Conference, 2013, San Jose, March 18-21",
        "Research",
        "In previous semesters I have held a position as Teaching Assistant in the department of Computer Science. I was assigned to different courses, including CS466 “Advanced Computer Architecture” (Spring ‘11), CS366 “Computer Architecture II” (Spring ‘11 - Fall ‘10), CS401 “Computer Algorithms” (Spring ‘10), CS202 “Data Structure and Discrete Math” (Fall ’09) and CS102 “Introduction to Programming” (Spring ’09).",
        "Teaching"
    ],
    "out_links": [
        "http://compbio.cs.uic.edu/~tanya/",
        "http://grad.uic.edu/deans-scholar-awards",
        "http://grad.uic.edu/fmc-technologies-educational-fund",
        "http://www.cs.uic.edu/",
        "http://compbio.cs.uic.edu/",
        "http://compbio.cs.uic.edu/IBEIS/"
    ]
}