{
    "url": "https://grad.uic.edu/academic-support/thesis/etd/etd-faq/",
    "title": "Electronic Thesis & Dissertation FAQ | Graduate College | University of Illinois at Chicago",
    "text": [
        "An ETD is an Electronic Thesis or Dissertation. Instead of the traditional submission process, in which a student submits paper copies to be bound, catalogued, and disseminated in hard copy through the University Library, ETDs allow for the creation, submission, and dissemination of graduate research in digital form. The components and structure of an ETD are essentially the same as a traditional paper thesis.",
        "UIC Indigo is the digital repository for research and scholarship produced at the University of Illinois at Chicago. UIC Indigo collects, disseminates, and provides persistent and reliable access to the research and scholarship of faculty, staff, and students at the University of Illinois at Chicago.",
        "All UIC theses and dissertations must adhere to the Graduate College thesis requirements.  For ETDs there are a few differences from the paper submission.  Follow the Electronic Thesis and Dissertation Format below for more information.",
        "Additional requirements for ETDs include:",
        "MS Word and Adobe Acrobat are two options for converting files to PDF. Installing Acrobat onto a computer allows the user to generate a PDF file by selecting “Adobe PDF” as the printer from within the program. Computers containing both MS Word and Acrobat Professional are available in computer labs on campus.",
        "Before beginning the PDF conversion process, however, you are strongly encouraged to embed the fonts you have used in your thesis into the file to be converted. Embedding fonts will help to ensure that the material in your thesis will display correctly when viewed or printed from the PDF file. To further ensure that material displays correctly in the PDF file, use of either a Type 1 or TrueType font is recommended. Times New Roman, Arial, and Calibri are among the numerous TrueType fonts that are available in popular word processing programs.",
        "PDF conversion services may also be found online. Some of these online services are free and others are not. We have also included links below to LaTeX conversion resources.",
        "Students are responsible for checking the PDF file of their thesis after the conversion process to verify that all material displays correctly.",
        "",
        "If any of your files are larger than 512MB in size, we recommend submitting them from a “wired” on-campus connection (e.g. any public computer lab on campus). It may also be possible to submit these files from off-campus if you are using a private, high-speed internet connection. However, it is not recommended to submit larger files from wireless internet available in coffee houses or bookstores, as these businesses sometimes limit the size of files you may transmit.",
        "If you have any difficulties in uploading your thesis files, please contact the Graduate College Thesis Office at thesis@uic.edu or (312) 996-3958.",
        "You should only submit your thesis for review by the Graduate College Thesis Office AFTER",
        "Documents submitted prior to departmental approval will be rejected.",
        "The Thesis Office will not review your submission until we have received notification of departmental approval. In most cases, format reviews will be performed within three or fewer business days of the latter of either (a) submission of the electronic document or (b) confirmation of departmental approval. If you submit close to the submission deadline for a semester, the approval process may take up to three weeks.  You will be notified by email of the outcome of the Graduate College’s review, including a list of required changes (if any) and instructions for completing the deposit of your thesis.  Review by the Graduate College may be more than three days at the thesis submission deadlines.",
        "No. Departmental format review is an independent process, and your department may require either a paper or electronic copy of your thesis for review.",
        "Deposit deadlines are listed on the Graduate College’s Academic Calendar. Thesis Office traffic increases prior to deadlines, so it may take the Graduate College several days to reply to an electronic submission.  Keep in mind that revisions may still be required before your thesis is finalized by the Graduate College.  Additional Forms/Payments/Receipt should be received by the Graduate College Thesis Office by the thesis deposit deadline of your intended graduation term.  Any format corrections to the ETD after you have submitted it must be completed by the date given to you by the Graduate College after the initial review of the submission.",
        "Your deposit will be confirmed in an email from the Graduate College Thesis Office after a correctly formatted thesis has been accepted and all required additional materials have been received.",
        "Effective with submissions for Fall 2011 and forward only electronic submissions will be accepted.",
        "Following acceptance, your document will be electronically available via UIC Indigo. Doctoral dissertations will also be listed in the ProQuest Dissertations & Theses (PQDT) database, the most comprehensive collection of dissertations and theses in the world.",
        "No. The library does not provide a print copy of your thesis to your department.  A printable PDF version of your thesis or dissertation will be available through the UIC Indigo web site.  However, your department may still require you to directly provide it with a print copy.",
        "Please contact the Graduate College Thesis Office at Thesis@uic.edu or 312-996-3958.",
        "The copyright to a thesis belongs to the student, according to the University’s General Rules. As a condition of being awarded the degree, however, the student grants the University the non-exclusive right “to retain, use and distribute a limited number of copies of the thesis, together with the right to require its publication for archival use.”",
        "Please contact the University’s Office of Technology Management.",
        "You may register your copyright directly through the United States Copyright Office.",
        "No. There are, however, certain benefits to registering your copyright. The U.S. Copyright Office provides a thorough explanation of these benefits.",
        "It could be possible for you to negotiate which rights you transfer to a publisher before you sign a publishing agreement. The Scholarly Publishing and Academic Resources Coalition (SPARC) has developed an author addendum that students may find useful in negotiating the rights that they transfer.",
        "The Graduate College does not advise students on what can or cannot be considered “fair use.” Students are urged to consult the U.S. Copyright Office’s explanation of “fair use.” Also, consult with your advisor and Director of Graduate Studies. Students may find the following resources helpful in making their own determination–and documenting that determination–of whether permission is required for the use of previously copyrighted material in a thesis:",
        "Did you create the material? If not, you will need to identify the owner of the work’s copyright and determine whether the work’s copyright protection has expired. You may find the following publication of the U.S. Copyright Office helpful:",
        "Yes. If your work has been published, you may have transferred the copyright to the publisher. Check your publishing agreement: if the publisher owns the copyright to your work, you will need to request permission to reprint it in your thesis and elsewhere.",
        "Yes, a detailed example of the content that should be included in the permission request letter is provided on page 4 of A Student’s Guide to Copyrights and Fair Use  (see “Copyright”) a publication of the Office of Technology Management.",
        "The Graduate College does not provide such assistance. Please note that it remains the student’s responsibility to determine what material requires copyright clearance.",
        "Yes, an abstract is required of all theses and dissertations. The abstract must be written in English and will be submitted in a text field in the electronic submission process. There is no word limit although it is strongly recommended to keep the length to approximately 350 words.",
        "See the Graduate College ETD format page.",
        "Upon final deposit, the thesis becomes part of the student’s academic record. No changes may be made to the thesis or dissertation after it has been approved by the Graduate College Thesis Office.",
        "Students graduate in the three times a year, at the end of terms: Spring (May), Summer (August), and Fall (December).",
        "Submission of an electronic thesis or dissertation (ETD) allows you a choice of the timing of the release of your thesis and the audience to whom your thesis is released.",
        "During the creation of your ETD submission profile, you will have the opportunity to select one of three options for the release of your work.   Note that these options apply to UIC Indigo only.",
        "Yes. Options for restricting the release of your ETD (Option 2—U of I only; Option 3—Closed access) are renewable in 2-year increments. It is the student’s responsibility to initiate a petition before the two year period is to end, including all justifications. Otherwise, the ETD automatically becomes open access on UIC Indigo at that time.",
        "After the date of degree conferral of the graduation period for which your ETD is submitted, you may contact the Graduate College Thesis Office to change or renew your ETD release option.",
        "The three release options described above will accommodate the need to postpone publication for most UIC graduate students. However, due to publication norms in some disciplines, the Graduate College understands that occasionally students may wish to request other arrangements.",
        "Petitioning an alternative release option for the ETD",
        "Offering availability to the University of Illinois community as well as limited availability through ILL is consistent with the distribution practices of paper theses and dissertations. Before ETD, paper theses and dissertations were bound and catalogued by the University Library. These manuscripts are available for loan through the Library and are also available to off-campus users via Interlibrary Loan.",
        "Submitting an ETD for deposit while a petition is under review",
        "After submitting the petition to the Graduate College:",
        "A student may request to have a thesis or dissertation withheld from public release while patentability is assessed by completing a Thesis Withholding Request Form and submitting it to the Office of Technology Management  (OTM) prior to deposit.",
        "OTM will review the student’s request and notify the Graduate College Thesis Office that a thesis is to be withheld. Withholding a thesis for a patent review does not affect graduation or thesis deposit; all students are required to complete their thesis deposit by the deposit deadline.",
        "After submitting the Thesis Withholding Request Form to the Office of Technology Management (OTM), you may create your ETD submission profile and select from one of the three release options offered. Your thesis will be withheld from release into the UIC Indigo repository until the release is approved by OTM. After the thesis is released into UIC Indigo, it will become available according to the release option you chose during the ETD submission process.",
        "All students depositing an ETD at the University of Illinois at Chicago are asked to read and agree to the UIC Indigo deposit agreement. Basically, your agreement to this non-exclusive license allows UIC Indigo to make your ETD available according to the release option you choose during ETD submission and to make backup copies of your ETD or to migrate it to future file formats as necessary for preservation purposes. Students retain the copyright to their own work.",
        "ProQuest provides several useful services for the University, including producing the microfilm copy of your dissertation."
    ],
    "out_links": [
        "https://grad.uic.edu/",
        "http://uic.edu/",
        "https://grad.uic.edu/admissions/",
        "https://grad.uic.edu/admissions/degree-admission/",
        "https://grad.uic.edu/admissions/deadlines/",
        "https://grad.uic.edu/funding-awards/",
        "https://grad.uic.edu/funding-awards/graduate-funding-overview/",
        "https://grad.uic.edu/funding-awards/graduate-college-fellowships/",
        "https://grad.uic.edu/funding-awards/other-funding/",
        "https://grad.uic.edu/programs/",
        "https://grad.uic.edu/programs/graduate-college-courses/",
        "https://grad.uic.edu/programs/graduate-program-in-neuroscience/",
        "https://grad.uic.edu/diversity/",
        "https://grad.uic.edu/diversity/recruitment/",
        "https://grad.uic.edu/diversity/fellows-mentoring-support-initiative/",
        "https://grad.uic.edu/diversity/dfi-program/",
        "https://grad.uic.edu/funding-awards/graduate-college-fellowships/pif/",
        "https://grad.uic.edu/diversity/pbrc-prep/",
        "https://grad.uic.edu/diversity/srop-program/",
        "https://grad.uic.edu/academic-support/",
        "https://grad.uic.edu/academic-support/academic-dates-events/",
        "https://grad.uic.edu/academic-support/registration-information/",
        "https://grad.uic.edu/academic-support/thesis/",
        "https://grad.uic.edu/academic-support/exams-defense/",
        "https://grad.uic.edu/academic-support/graduate-college-policies/",
        "https://grad.uic.edu/academic-support/ta-enrichment/",
        "https://grad.uic.edu/academic-support/graduation-information/",
        "https://grad.uic.edu/academic-support/student-resources/graduate-student-forms/",
        "https://grad.uic.edu/academic-support/student-resources/",
        "https://grad.uic.edu/about/",
        "https://grad.uic.edu/about/graduate-college-directory/",
        "https://grad.uic.edu/about/faculty-listings/",
        "https://grad.uic.edu/about/gc-newsletters/",
        "https://grad.uic.edu/about/contact-us/",
        "https://grad.uic.edu/faculty-staff-resources/",
        "https://grad.uic.edu/alumni/",
        "https://grad.uic.edu/about/giving/",
        "http://maps.uic.edu/",
        "https://grad.uic.edu/academic-support/thesis/etd/",
        "https://grad.uic.edu/academic-support/thesis/etd/electronic-thesis-and-dissertation-format/",
        "https://accc.uic.edu/service/c-stop",
        "http://indigo.lib.uic.edu/",
        "https://otm.uic.edu/",
        "https://otm.uic.edu/uic-community/ownership-guidelines/thesis-witholdings/",
        "https://grad.uic.edu/profiles/kollenbroich-jim/",
        "https://grad.uic.edu/academic-support/thesis/etd/electronic-thesis-and-dissertation-submission-process/",
        "https://grad.uic.edu/academic-support/thesis/ithenticate-review-procedures/",
        "https://grad.uic.edu/academic-support/thesis/survey-of-earned-doctorates/",
        "https://grad.uic.edu/academic-support/exams-defense/exams-defense-forms/",
        "https://grad.uic.edu/academic-support/exams-defense/committee-membership-policy/",
        "http://catalog.uic.edu/ucat/academic-calendar/",
        "http://today.uic.edu/",
        "http://events.uic.edu/",
        "http://uic.edu/about/visit-directions",
        "http://clery.uic.edu/",
        "http://oae.uic.edu/UnlawfulDiscrimination/index.htm",
        "http://oae.uic.edu/sexual-misconduct/",
        "http://financialaid.uic.edu/consumer-information/department-education-complaint-process/",
        "https://my.uic.edu/",
        "https://outlook.uic.edu/",
        "https://accc.uic.edu/service/g-suite",
        "https://grad.uic.edu/wp-admin",
        "https://wellnesscenter.uic.edu/",
        "https://writingcenter.uic.edu/",
        "https://wellnesscenter.uic.edu/resources-and-services/pop-up-pantry/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}