{
    "url": "https://www.evl.uic.edu/menuPage.php?id=5",
    "title": "evl | electronic visualization laboratory",
    "text": [
        "In the ’10s, EVL is building on its decades of experience to create new hardware and software technologies, notably the CAVE2™ hybrid-reality environment and the SAGE2™ scalable amplified group environment, and with the addition of new faculty, is expanding the breadth and depth of its expertise in scientific visualization, information visualization and visual analytics.",
        "From EVL’s early collaborations with artists to today’s global collaborations with computational scientists and application scientists in academia, government and industry, EVL has had many successes developing, nurturing and growing user communities. To fulfill its mission of enabling scientific discovery, EVL faculty, staff and students form interdisciplinary teams of computer scientists, application scientists and artists in order to create useful and usable visualization and virtual-reality tools and techniques connected to remote data stores and distant colleagues via high-speed networks.",
        "EVL maintains a distinguished publication record, with students, faculty and staff publishing in major journals and conferences worldwide.",
        "",
        "FUNDING",
        "National Science Foundation (NSF)",
        "ACI-1450871 IRNC:RXP: StarLight SDX (Brown, PI of subaward to UIC)",
        "CNS-1625941: MRI - Development of Continuum: A Virtualized Attentive Environment for Amplified Collaboration (Johnson, PI; Brown, Kenyon, Marai, Chattopadhyay, co-PIs)",
        "ACI-1441963: SAGE2 (Brown, PI of subaward to UIC)",
        "CNS-1456638: SENSEI (Brown, PI; Johnson, Kenyon, Berger-Wolf, co-PIs)",
        "IIS-1445751: EAGER: Collaborative Research: Articulate: Augmenting Data Visualization With Natural Language Interaction (DiEugenio, PI; Johnson, co-PI)",
        "CBET-1854815: High-performance computing and data-driven modeling of aircraft contrails",
        "National Institutes of Health (NIH)",
        "NCI-R01CA214825: SMART-ACT: Spatial Methodologic Approaches for Risk Assessment and Therapeutic Adaptation in Cancer Treatment (Marai, PI)",
        "NCI-R01CA225190: QuBBD: Precision E –Radiomics for Dynamic Big Head & Neck Cancer Data (Marai, PI)",
        "",
        "R01LM012527: Incorporating Image-based Features into Biomedical Document Classification (Marai, PI of subaward to UIC)",
        "National Institute on Disability and Rehabilitation Research (NIDRR)",
        "H133E120010: Machines Assisting Recovery from Stroke and Spinal Cord Injury for Reintegration into Society (Kenyon, PI of subaward to UIC)",
        "UIC (Internal funding)",
        "UI Presidential Initiative to Celebrate the Impact of the Arts and the Humanities (Tsoupikova, PI)",
        "SAGE / SAGE2 / CAVE / CAVE2 are trademarks of the University of Illinois Board of Trustees.",
        "",
        "",
        "NCI-R01CA214825: SMART-ACT: Spatial Methodologic Approaches for Risk Assessment and Therapeutic Adaptation in Cancer Treatment (Marai, PI)",
        "NCI-R01CA225190: QuBBD: Precision E –Radiomics for Dynamic Big Head & Neck Cancer Data (Marai, PI)",
        "",
        "R01LM012527: Incorporating Image-based Features into Biomedical Document Classification (Marai, PI of subaward to UIC)",
        "National Institute on Disability and Rehabilitation Research (NIDRR)",
        "H133E120010: Machines Assisting Recovery from Stroke and Spinal Cord Injury for Reintegration into Society (Kenyon, PI of subaward to UIC)",
        "UIC (Internal funding)",
        "UI Presidential Initiative to Celebrate the Impact of the Arts and the Humanities (Tsoupikova, PI)",
        "SAGE / SAGE2 / CAVE / CAVE2 are trademarks of the University of Illinois Board of Trustees.",
        "",
        "",
        "R01LM012527: Incorporating Image-based Features into Biomedical Document Classification (Marai, PI of subaward to UIC)",
        "National Institute on Disability and Rehabilitation Research (NIDRR)",
        "H133E120010: Machines Assisting Recovery from Stroke and Spinal Cord Injury for Reintegration into Society (Kenyon, PI of subaward to UIC)",
        "UIC (Internal funding)",
        "UI Presidential Initiative to Celebrate the Impact of the Arts and the Humanities (Tsoupikova, PI)",
        "SAGE / SAGE2 / CAVE / CAVE2 are trademarks of the University of Illinois Board of Trustees."
    ],
    "out_links": [
        "https://www.evl.uic.edu/index.php",
        "https://www.evl.uic.edu/menuPage.php?id=4",
        "https://www.evl.uic.edu/list.php?id=2",
        "https://www.evl.uic.edu/menuPage.php?id=3",
        "https://www.evl.uic.edu/menuPage.php?id=2",
        "https://www.evl.uic.edu/list.php?id=3",
        "https://www.evl.uic.edu/list.php?id=4",
        "https://www.evl.uic.edu/list.php?id=5",
        "https://www.evl.uic.edu/list.php?id=1"
    ]
}