{
    "url": "https://cs.uic.edu/profiles/peter-nelson/",
    "title": "Nelson, Peter  | Department of Computer Science | University of Illinois at Chicago",
    "text": [
        "Dean",
        "",
        "Department of Computer Science",
        "838 SEO",
        "851 S. Morgan St, MC 159, Chicago, IL, 60607",
        "(312) 996-3259",
        "nelson@uic.edu",
        "Research Activities and Interests:",
        "My research at UIC in the Artificial Intelligence Laboratory has focused on developing efficient artificial intelligence (AI) search techniques. This research has two components: basic research into developing general, efficient heuristic search algorithms, and applied research and development using heuristic search and other AI methods to solve problems in the areas of transportation, manufacturing, bioinformatics and high-availability computer clusters.",
        "One of our most interesting results in this area has been the development of a new heuristic search algorithm named perimeter search. This admissible technique is referred to as perimeter search since it relies on a perimeter of nodes around the goal or destination node. During the search process, generated nodes are compared to the perimeter nodes. When a match is found, the search can terminate. Analytical and experimental results were published in the Artificial Intelligence Journal showing that perimeter search is more efficient than IDA* and A* in terms of time complexity and nodes expanded for two problem domains. Additional general search results have been in the area of search algorithms that learn; a method for reducing cycles for depth-first searches on graphs; and parallel bidirectional search algorithms.",
        "Our Intelligent Transportation Systems (ITS) research involves improving the utilization and efficiency of existing roadway transportation systems using information technology. From 1991-95, I conducted ITS research for the ADVANCE (Advanced Driver and Vehicle Advisory Navigation ConcEpt) project, supported by the Illinois Department of Transportation and the Federal Highway Administration (FHWA). ADVANCE equipped test vehicles in the northwestern suburbs of Chicago with on-board computers for dynamic route planning and navigation. The vehicles received real-time traffic information via RF communications from a traffic information center, allowing them to plan and update optimal routes using up-to-the-minute traffic information. The traffic information center received traffic information from the vehicles, acting as roving traffic probes, as well as from roadway loop detectors, reliable voice reports, and other sources. My laboratory’s responsibilities on the ADVANCE project were for software research and development for the traffic information center. I have also conducted several other ITS-related projects. In 1994-95 my Laboratory developed a regional Corridor Traffic Information Center for IDOT that included the first World Wide Web site to graphically display current traffic conditions, see www.gcmtravel.com/gcm/maps_chicago.jsp for details (The CALTRANS WWW traffic map was also developed around the same time.) Our traffic map web site has over 300,000,000 hits per year. Another project, funded by the National Research Council’s Transportation Research Board, has developed powerful new data fusion techniques utilizing artificial neural networks. Reliable data fusion is critically important for advanced traveler information systems, which must continually combine semantically distinct probe, loop detector, anecdotal, and historical data into meaningful current traffic information. Another project, initiated by the FHWA and the Illinois, Indiana, and Wisconsin Departments of Transportation, involves the research and development of a transportation information center for the vital Gary-Chicago-Milwaukee Priority Corridor, one of the four federally-designated ITS testbed corridors. This system distributes real-time transportation and incident information throughout the corridor to agencies and the traveling public. My laboratory has also been awarded contracts to assist the Illinois Tollway Authority with the development of a state-of-the-art traffic and incident management system, and a project with the Chicago Area Transportation Study (CATS) to development an intelligent web-based ridesharing system. Additional projects include work on an incident information system for the State of Wisconsin and transit projects funded by the Federal Transit Agency through the Great Cities Universities Consortium and the Regional Transportation Authority. Additionally I am currently serving as a co-PI on a $3.2 million NSF IGERT grant (Computer Science Professor Ouri Wolfson, P.I.) in the area of Computational Transportation Science involving four UIC colleges, for more information see cts.cs.uic.edu.",
        "Manufacturing optimization, modeling, and knowledge discovery research has been supported by Motorola for the last ten years. This work involves optimizing the assignment of components to the feeder slots of high-speed “chip shooters” (devices which place IC chips onto printed wire circuit boards) in a high-mix manufacturing environment. A variety of AI methods (e.g., genetic algorithms, tabu search, neural networks, and rule-based systems) have been utilized to consistently produce near-optimal results for high-speed placement over a wide class of machines. The methods and software we have developed are currently being used in Motorola factories around the world. This work has included balancing and optimizing a complete assembly line and generalizing our machine specific work into a flexible simulation and optimization toolkit. Extensions to this work include the development of the data mining software for design and manufacturing, and meta-knowledge extraction and management for SMT optimization.",
        "Bioinformatics research has been funded by the National Institutes of Health National Center for Human Genome Research to develop a DNA restriction mapping tool. This tool automates the process of inferring DNA restriction maps from DNA segmentation data. We have studied the utility of certain AI techniques in this domain, namely Pratt’s separation theory (to guarantee optimal use of the data), Dempster and Shafer’s theory of evidence (for reasoning with uncertain data), and heuristic search guided with neural networks to traverse the search space efficiently. Our restriction mapping tool has been downloaded by numerous molecular biology laboratories around the world from our homepage. More recent efforts have focused on using data mining for understanding the mechanisms of evolution and adaptation of organisms to the environment by identification of evolutionary variations of enzymes using advanced data-mining approaches. Protein classification is an important method for automated protein function prediction. In 2006 and 2007, I also served as one of the seven founding board members for the Chicago Biomedical Consortium Proteomics and Informatics Scientific Board, in response to a $25 million biomedical research gift from the Searle Funds given jointly to UIC, University of Chicago and Northwestern University.",
        "Work in the area of highly available computer clustering has been supported by Sun Microsystems and the National Science Foundation. High availability (HA) in a cluster is achieved through redundancy; all critical resources have designated redundant resources that can take over the service responsibilities of the original resource in case of a failure. Our work involves applying constraint logic programming (CLP), rule-based systems and heuristic search techniques to the configuration and failure handling in HA clusters.",
        "Multi-Dimensional Heuristics: A New AI Search Technique, University of Illinois at Chicago Campus Research Board, Principal Investigator: P.C. Nelson",
        "Illinois Department of Transportation (IDOT) and the Federal Highway Administration (FHWA) through Illinois Universities Transportation Research Consortium (IUTRC), Software Research and Development for Intelligent Vehicle Highway Systems I,, Principal Investigator: P.C. Nelson",
        "Sun Microsystems, Sun Scholarpak Software Grant, Principal Investigator: P.C. Nelson",
        "1990, Silver Circle Teaching Award Finalist, UIC",
        "1999, Research Award, UIC College of Engineering",
        "2003, National Award for Traveler Information Web Sites for our Gateway System GCMTravel.org., Federal Highway Administration",
        "Northwestern University Evanston, Illinois Ph.D. in Computer Science June 1988 M.S. in Computer Science August 1986",
        "North Park College Chicago, Illinois B.A. in Computer Science and Mathematics May 1984"
    ],
    "out_links": [
        "https://cs.uic.edu/",
        "http://uic.edu/",
        "https://cs.uic.edu/undergraduate/",
        "https://cs.uic.edu/undergraduate/admitted-students/",
        "http://engineering.uic.edu/undergraduate-admissions/",
        "https://cs.uic.edu/undergraduate/abet-accreditation/",
        "https://cs.uic.edu/undergraduate/cs-major/",
        "https://cs.uic.edu/undergraduate/cs-minor/",
        "https://cs.uic.edu/undergraduate/undergrad-courses/",
        "https://cs.uic.edu/undergraduate/internships-and-jobs/",
        "https://cs.uic.edu/undergraduate/student-organizations/",
        "https://cs.uic.edu/undergraduate/student-profiles/",
        "https://cs.uic.edu/undergraduate/student-resources/",
        "https://cs.uic.edu/undergraduate/women/",
        "https://cs.uic.edu/graduate/",
        "https://cs.uic.edu/graduate/admitted-students/",
        "https://cs.uic.edu/graduate/admissions/",
        "https://cs.uic.edu/graduate/graduate-courses/",
        "https://cs.uic.edu/graduate/ms-program/",
        "https://cs.uic.edu/graduate/phd/",
        "https://cs.uic.edu/graduate/cs-dissertations/",
        "https://cs.uic.edu/graduate/post-grad-outcomes/",
        "https://cs.uic.edu/graduate/student-profiles/",
        "https://cs.uic.edu/graduate/graduate-student-resources/",
        "https://cs.uic.edu/cs-research/",
        "https://cs.uic.edu/cs-research/research-areas-2/",
        "https://cs.uic.edu/cs-research/labs/",
        "https://cs.uic.edu/cs-research/lectures-seminars/",
        "https://cs.uic.edu/cs-research/reus/",
        "https://cs.uic.edu/faculty-staff/",
        "https://cs.uic.edu/faculty-staff/department-head/",
        "https://cs.uic.edu/faculty-staff/faculty/",
        "https://cs.uic.edu/faculty-staff/emeritus-faculty/",
        "https://cs.uic.edu/faculty-staff/adjunct-faculty/",
        "https://cs.uic.edu/faculty-staff/staff/",
        "https://cs.uic.edu/faculty-staff/faculty-resources/",
        "https://cs.uic.edu/faculty-staff/open-positions/",
        "https://cs.uic.edu/cs-news/",
        "https://cs.uic.edu/cs-news/all-news/",
        "https://cs.uic.edu/cs-news/press-mentions/",
        "https://cs.uic.edu/cs-events/",
        "https://cs.uic.edu/cs-events/calendar/",
        "https://cs.uic.edu/cs-events/student-opportunities/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "http://ai.uic.edu/",
        "https://ai.uic.edu/",
        "http://cts.cs.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}