{
    "url": "https://ai.uic.edu/?go=front",
    "title": "Artificial Intelligence Lab | University of Illinois at Chicago",
    "text": [
        "Since its inception in 1991 we have undertaken a variety of applied intelligent systems projects in the areas of transportation, molecular biology, and electronics manufacturing optimization.",
        "Our work differs from most other AI research groups around the world in that our primary goal does not revolve around the understanding of biological intelligence. Instead our focus is on the application of derived AI methodologies for solving real-world problems.",
        "With recent advances in artificial intelligence and computational power, we are now able to pose and solve much more computationally intensive questions. This recent shift in emphasis from purely theoretical work, to practical applications of these results has opened up a void which the UIC AI Lab has tried to fill. These days there is a demand for intelligent computational systems along with competent designers, both of which are products of the Lab. Results of our applied research projects exist not only in academic journals and technical reports but also as working systems which address national, industrial, business, and health care needs.",
        "Chicago is the third worst urban area in the country according to the Texas Institute of Transportation. A $5,853,740 contract to UIC researchers in the Artificial Intelligence (AI) Laboratory will help to address the problem. continue…",
        "",
        "Read our latest artificial intelligence publications to understand how our work is poised to solve real-world problems",
        "",
        ""
    ],
    "out_links": [
        "https://ai.uic.edu/",
        "http://uic.edu/",
        "https://ai.uic.edu/projects/",
        "https://ai.uic.edu/publication/",
        "https://ai.uic.edu/people/",
        "https://ai.uic.edu/people/faculty/",
        "https://ai.uic.edu/people/staff/",
        "https://ai.uic.edu/about/",
        "https://ai.uic.edu/about/about-us/",
        "http://engineering.uic.edu/",
        "http://cs.uic.edu/",
        "http://maps.uic.edu/",
        "http://engineering.uic.edu/2017/03/08/ai-lab-receives-5-85m-from-idot-to-help-reduce-traffic/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}