{
    "url": "https://commencement.uic.edu/",
    "title": "Commencement | University of Illinois at Chicago",
    "text": [
        "VIRTUAL CEREMONIES WILL GO LIVE HERE AT 9:00AM ON MAY 16.",
        "While the May commencement ceremonies have been postponed, we remain eager to celebrate this momentous occasion with our graduates. On May 16, UIC will host virtual ceremonies for individual colleges via MarchingOrder.com. The online platform allows graduates to view speeches from administrators and keynotes and to be individually recognized for their accomplishment.",
        "Please know that these virtual events are in no way intended to replace the in-person ceremonies to which we were all looking forward. At the same time, we recognize that it may not be possible for all of our graduates to attend the rescheduled ceremonies. UIC is proud of all of our graduates and their accomplishments, and we invite all spring 2020 graduates to celebrate with us online in May, in person this summer, or both.",
        "Graduates, please watch for an e-mail inviting you to create your personalized slide through MarchingOrder. If you would like your slide to include a reading of your name, you will need to respond no later than April 23. You can still register for a personalized silent slide until May 3. We are unable to take any registrations after May 3. Slides will be used for the virtual ceremonies as well as the rescheduled in-person ceremonies.",
        "Graduates from the College of Medicine will not be participating.  A separate virtual ceremony is scheduled for May 8 for those graduates, and communications will be coming directly from the college.",
        "We will provide information regarding the in-person ceremonies as it becomes available.",
        "All orders for caps and gowns have been canceled as of Friday, March 20. Refunds are in process. We appreciate your patience and apologize for the delay.",
        "For those wishing to participate in the rescheduled ceremonies, caps and gowns will be available for purchase from the UIC Bookstore in May.",
        "",
        "GradImages™ is the official photographer for UIC commencement ceremonies. Please note that it will take at least 10 business days to have commencement photos posted online for purchase. Your photos will be available to view and order by visiting www.gradimages.com.",
        "Official UIC photographers will also be on hand to document the festivities. These images can be found on the UIC photo database to view/order.",
        "Since photographs will be available, family members and guests are encouraged to remain in their seats, relax and enjoy the ceremony."
    ],
    "out_links": [
        "http://uic.edu/",
        "https://commencement.uic.edu/about/",
        "https://commencement.uic.edu/about/history/",
        "https://commencement.uic.edu/about/contact-us/",
        "https://commencement.uic.edu/preparation/",
        "https://commencement.uic.edu/preparation/caps-gown/",
        "http://catalog.uic.edu/ucat/",
        "https://commencement.uic.edu/preparation/graduation-announcements/",
        "https://commencement.uic.edu/schedule/",
        "https://commencement.uic.edu/schedule/spring-commencement-ceremonies/",
        "https://commencement.uic.edu/schedule/fall-commencement-ceremonies/",
        "https://commencement.uic.edu/schedule/forever-flames/",
        "https://commencement.uic.edu/schedule/spring-2020-grad-fest/",
        "https://commencement.uic.edu/webcast/",
        "https://commencement.uic.edu/webcast-archive/",
        "https://commencement.uic.edu/commencement-day/",
        "https://commencement.uic.edu/commencement-day/seating/",
        "https://commencement.uic.edu/commencement-day/venue-policies/",
        "https://commencement.uic.edu/commencement-day/directions-parking/",
        "https://commencement.uic.edu/commencement-day/photography/",
        "https://commencement.uic.edu/faqs/",
        "http://uic.edu/alumni",
        "http://connect.uic.edu/",
        "http://sa.uic.edu/",
        "http://maps.uic.edu/",
        "https://commencement.uic.edu/welcome-to-the-uic-alumni-association/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}