{
    "url": "https://grad.uic.edu/academic-support/thesis/etd/thesis-dissertation-publishing-options-access-and-related-information/",
    "title": "Thesis/Dissertation Publishing Options/Access and Related Information | Graduate College | University of Illinois at Chicago",
    "text": [
        "Instead of the traditional submission process, in which a student submits paper copies to be bound, catalogued, and disseminated in hard copy through the University Library, ETDs allow for the creation, submission, and dissemination of graduate research in digital form. The components and structure of an ETD are essentially the same as a traditional paper thesis.",
        "UIC Indigo is the digital repository for research and scholarship produced at the University of Illinois at Chicago. UIC Indigo collects, disseminates, and provides persistent and reliable access to the research and scholarship of faculty, staff, and students at the University of Illinois at Chicago.  Further information about UIC Indigo and Indigo in general.",
        "The copyright to a thesis belongs to the student, according to the University’s General Rules.As a condition of being awarded the degree, however, the student grants the University the non-exclusive right “to retain, use and distribute a limited number of copies of the thesis, together with the right to require its publication for archival use.”",
        "It is the student’s option to register the copyright.  Although the majority of students do not register the copyright (the author retains certain rights even though not officially registered), there are, however, certain benefits to registering your copyright. The U.S. Copyright Office provides a thorough explanation of these benefits.  These should be reviewed to determine what would best serve your individual stituation.",
        "You may register your copyright directly through the United States Copyright Office.",
        "If you plan to submit an article for publication (in a journal, for example) It may be possible for you to negotiate to retain your copyright or which rights you transfer to a publisher before you sign a publishing agreement. The Scholarly Publishing and Academic Resources Coalition (SPARC) has developed an author addendum(PDF) that students may find useful in negotiating the rights that they transfer.",
        "Fair Use",
        "The Graduate College does not advise students on what can or cannot be considered “fair use.” Students are urged to consult the U.S. Copyright Office’s explanation of “fair use.” Also, consult with your advisor and Director of Graduate Studies.  The following resources may be helpful in making a determination–and documenting that determination–of whether permission is required for the use of previously copyrighted material in a thesis:",
        "If you did not create the material you are using you need to determine if it is protected by someone else’s copyright.  You need to identify the owner of the work’s copyright and determine whether the work’s copyright protection has expired. You may find the following publication of the U.S. Copyright Office helpful: “How to Investigate the Copyright Status of a Work.” (PDF)",
        "Also, it is possible that you can no longer own the copyright to your own work.  If your work has been published, you may have transferred the copyright to the publisher. Check your publishing agreement: if the publisher owns the copyright to your work, you will need to request permission to reprint it in your thesis and elsewhere. A detailed example of the content that should be included in the permission request letter is provided on page 4 of A Student’s Guide to Copyrights and Fair Use (look under the “Copyright”)a publication of the Office of Technology Management.",
        "The Graduate College does not provide assistance to obtain permission to reprint previously copyrighted material in your thesis.",
        "Please note that it remains the student’s responsibility to determine what material requires copyright clearance.",
        "If you have intellectual property in your thesis that is not covered by copyright (e.g., material that might be covered by patents, trademarks, etc.), please contact the University’s Office of Technology Management.",
        "Electronic Submission",
        "Submission of an electronic thesis or dissertation (ETD) allows you a choice of the timing of the release of your thesis and the audience to whom your thesis is released.",
        "During the creation of your ETD submission profile, you will have the opportunity to select one of three options for the release of your work.",
        "Students have an option to restrict the release of your ETD (Option 2—U of I only; Option 3—Closed access).  These options are usually only used if the thesis, or part of the thesis, is to published in a journal where it may be construed that open-access is already publication.  If a student choses Options 2 or 3 it will be for two years from the last day of the term of graduation.  The restriction is renewable for an additional two years via written request to the Graduate College Thesis Office.  It is the student’s responsibility to initiate a petition before the two year period is to end (and earlier than 3 months before the two year period is to end), with appropriate justification for the renewal.  Otherwise, the ETD automatically becomes open access on UIC Indigo at that time.  If the student misses the two year renewal the thesis will revert to open-access.",
        "Change or Renew Release Option for an ETD",
        "After the date of degree conferral of the graduation period for which your ETD is submitted, you may contact the Graduate College Thesis Office to change or renew your ETD release option.  Usually, this would only be to renew U of I or Closed access.  The default for Open Access does not need any further actions.",
        "U of I Only Indefinite Release",
        "The three release options described above will accommodate the need to postpone publication for most UIC graduate students. However, due to publication norms in some disciplines, the Graduate College understands that occasionally students may wish to request other arrangements.",
        "Petitioning an alternative release option for the ETD",
        "Offering availability to the University of Illinois community as well as limited availability through ILL is consistent with the distribution practices of paper theses and dissertations. Before ETD, paper theses and dissertations were bound and catalogued by the University Library. These manuscripts are available for loan through the Library and are also available to off-campus users via Interlibrary Loan.",
        "Submitting an ETD for deposit while a petition is under review",
        "After submitting the petition to the Graduate College:",
        "Release Withheld From Public (Patent Issue)",
        "A student may request to have a thesis or dissertation withheld from public release while patentability is assessed by completing a Thesis Withholding Request Form and submitting it to the Office of Technology Management  (OTM) prior to deposit.",
        "OTM will review the student’s request and notify the Graduate College Thesis Office that a thesis is to be withheld. Withholding a thesis for a patent review does not affect graduation or thesis deposit; all students are required to complete their thesis deposit by the deposit deadline.",
        "After submitting the Thesis Withholding Request Form to the Office of Technology Management (OTM), you may create your ETD submission profile and select from one of the three release options offered. Your thesis will be withheld from release into the UIC Indigo repository until the release is approved by OTM. After the thesis is released into UIC Indigo, it will become available according to the release option you chose during the ETD submission process.",
        "All students depositing an ETD at the University of Illinois at Chicago are asked to read and agree to the UIC Indigo deposit agreement. Basically, your agreement to this non-exclusive license allows UIC Indigo to make your ETD available according to the release option you choose during ETD submission and to make backup copies of your ETD or to migrate it to future file formats as necessary for preservation purposes. Students retain the copyright to their own work."
    ],
    "out_links": [
        "https://grad.uic.edu/",
        "http://uic.edu/",
        "https://grad.uic.edu/admissions/",
        "https://grad.uic.edu/admissions/degree-admission/",
        "https://grad.uic.edu/admissions/deadlines/",
        "https://grad.uic.edu/funding-awards/",
        "https://grad.uic.edu/funding-awards/graduate-funding-overview/",
        "https://grad.uic.edu/funding-awards/graduate-college-fellowships/",
        "https://grad.uic.edu/funding-awards/other-funding/",
        "https://grad.uic.edu/programs/",
        "https://grad.uic.edu/programs/graduate-college-courses/",
        "https://grad.uic.edu/programs/graduate-program-in-neuroscience/",
        "https://grad.uic.edu/diversity/",
        "https://grad.uic.edu/diversity/recruitment/",
        "https://grad.uic.edu/diversity/fellows-mentoring-support-initiative/",
        "https://grad.uic.edu/diversity/dfi-program/",
        "https://grad.uic.edu/funding-awards/graduate-college-fellowships/pif/",
        "https://grad.uic.edu/diversity/pbrc-prep/",
        "https://grad.uic.edu/diversity/srop-program/",
        "https://grad.uic.edu/academic-support/",
        "https://grad.uic.edu/academic-support/academic-dates-events/",
        "https://grad.uic.edu/academic-support/registration-information/",
        "https://grad.uic.edu/academic-support/thesis/",
        "https://grad.uic.edu/academic-support/exams-defense/",
        "https://grad.uic.edu/academic-support/graduate-college-policies/",
        "https://grad.uic.edu/academic-support/ta-enrichment/",
        "https://grad.uic.edu/academic-support/graduation-information/",
        "https://grad.uic.edu/academic-support/student-resources/graduate-student-forms/",
        "https://grad.uic.edu/academic-support/student-resources/",
        "https://grad.uic.edu/about/",
        "https://grad.uic.edu/about/graduate-college-directory/",
        "https://grad.uic.edu/about/faculty-listings/",
        "https://grad.uic.edu/about/gc-newsletters/",
        "https://grad.uic.edu/about/contact-us/",
        "https://grad.uic.edu/faculty-staff-resources/",
        "https://grad.uic.edu/alumni/",
        "https://grad.uic.edu/about/giving/",
        "http://maps.uic.edu/",
        "https://grad.uic.edu/academic-support/thesis/etd/",
        "https://grad.uic.edu/academic-support/thesis/etd/thesis-dissertation-publishing-options-access-and-related-information/electronic-thesisdissertation",
        "http://www.uic.edu/depts/lib/projects/indigo/about.html",
        "http://otm.uic.edu/uic_principlesofip",
        "http://otm.uic.edu/",
        "http://otm.uic.edu/uic_addResources",
        "http://otm.uic.edu/uic_patents",
        "https://grad.uic.edu/academic-support/thesis/etd/etd-faq/",
        "https://grad.uic.edu/academic-support/thesis/etd/electronic-thesis-and-dissertation-format/",
        "https://grad.uic.edu/academic-support/thesis/etd/electronic-thesis-and-dissertation-submission-process/",
        "https://grad.uic.edu/academic-support/thesis/ithenticate-review-procedures/",
        "https://grad.uic.edu/academic-support/thesis/survey-of-earned-doctorates/",
        "https://grad.uic.edu/academic-support/exams-defense/exams-defense-forms/",
        "https://grad.uic.edu/academic-support/exams-defense/committee-membership-policy/",
        "http://catalog.uic.edu/ucat/academic-calendar/",
        "http://today.uic.edu/",
        "http://events.uic.edu/",
        "http://uic.edu/about/visit-directions",
        "http://clery.uic.edu/",
        "http://oae.uic.edu/UnlawfulDiscrimination/index.htm",
        "http://oae.uic.edu/sexual-misconduct/",
        "http://financialaid.uic.edu/consumer-information/department-education-complaint-process/",
        "https://my.uic.edu/",
        "https://outlook.uic.edu/",
        "https://accc.uic.edu/service/g-suite",
        "https://grad.uic.edu/wp-admin",
        "https://wellnesscenter.uic.edu/",
        "https://writingcenter.uic.edu/",
        "https://wellnesscenter.uic.edu/resources-and-services/pop-up-pantry/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}