{
    "url": "https://ethos.lab.uic.edu/projects/",
    "title": "Projects | Ethos Laboratory | University of Illinois at Chicago",
    "text": [
        "Building an OS requires building a kernel. We are implementing a kernel in C on top of Xen. Ethos started from a small OS in Xen called Mini-OS which provided low-level facilties which we extended to make a full OS supporting processes, a network stack, filesystem, authentication, etc. Kernel hacking divides into architecture dependent code (eg., for interrupts, context switching, paging) and architecture independent code (eg., authorization, authentication, file systems, etc.)",
        "We’re working on building highly secure distributed services. The first service is SayI, an authentication service, which will be used in conjunction with MinimaLT.",
        "El. El is intended to combine the best part of shells with the best part of scripting languages. Also, the building of tools to use with the shell.",
        "Em. Em is Ethos’ graphic markup language, intended to make it very simple to build smartphone-type applications.",
        "Much of an OS is written in user space. There are many user-space components to build, including package management, tools (see El), and OS abstractions. We’re using Go and El to write these routines.",
        "An OS without applications is incomplete. We need to see what effect Ethos has on application code. The first application will probably be secure messaging.",
        "Ethos relies on NaCL, a high speed crypto library which provides all Ethos’ crypto primitives (PI: Daniel J. Bernstein).",
        "In 2007, we set out to build an operating system which would give rise to far more secure systems than are available today. The genesis for this work was a 2006 panel at Computer and Communications Security (CCS) on botnets. It became clear that our computing base has been broadly compromised by attackers. These attackers are professional, highly skilled, and in it for the money. The operate overseas, beyond the reach of their victim’s national law enforcement and are largely anonymous.",
        "In the war against these attackers we have clearly lost, each year we fall further behind. Its time to change the rules of the game.",
        "Ethos is our answer to this threat. Ethos means “gathering place” and the “characteristics or virtues of a people”. Our purpose is to build a system (“gathering place”) in which more highly robust applications result (“characteristics or virtues”). We hope to craft an environment which will lead to a whole ecosystem which is more secure. In this goal, we are inspired by UNIX–which is far more than just an operating system–it also deeply influences user space.",
        "Building an operating system is an enormous undertaking. It is estimated that even “free” operating systems such as Linux are amazingly costly, costing over one billion dollars. (Almost all this expense is in device drivers and multiple architectures.) Building sufficient applications is a far larger goal. This is one reason why new operating systems have been unsuccessful.",
        "In addition, new operating systems face the application trap: there are no users for a system because there are no applications; and no one will write applications because there are no users.",
        "The solution to both of these problems is Virtual Machines (VMs). Since VMs allow multiple OS to run on a computer, it is no longer necessary to choose one OS; multiple OSs can be used simultaneously. Hence, one significant application can justify running an OS. Second, the VM provides an abstract hardware architecture which is far simpler then the vast variety of computers extant. The drivers for the real hardware are provided by the VM. We are using Xen as our VM because we believe it is a good security architecture on which to build an OS."
    ],
    "out_links": [
        "https://ethos.lab.uic.edu/",
        "http://uic.edu/",
        "https://ethos.lab.uic.edu/people/",
        "https://ethos.lab.uic.edu/papers/",
        "https://ethos.lab.uic.edu/background/",
        "https://ethos.lab.uic.edu/background/getting-started/",
        "https://ethos.lab.uic.edu/background/paper-reading-seminar/",
        "https://ethos.lab.uic.edu/background/binary-install-into-virtualbox/",
        "https://ethos.lab.uic.edu/background/the-advanced-programming-seminar-series/",
        "https://www.cs.uic.edu/",
        "https://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "http://ethos-lab.red.uic.edu/profiles/bernstein-daniel-j/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}