{
    "url": "https://cs.uic.edu/profiles/michaelis-joseph/",
    "title": "Michaelis, Joseph E | Department of Computer Science | University of Illinois at Chicago",
    "text": [
        "Assistant Professor",
        "",
        "Department of Computer Science",
        "SSB 1570B",
        "1240 W Harrison St., Chicago, IL 60607",
        "(312) 413-1888",
        "jmich@uic.edu",
        "Joseph-Michaelis-CV.pdf",
        "My research sits at the nexus of learning sciences and human-computer interaction (HCI) disciplines.",
        "This research focuses on designing and assessing educational technologies by utilizing human-centered methods and interaction modeling in HCI, and on interest, motivation and social-cultural learning perspectives in the learning sciences. These technologies are designed for social connection-making with learners to support learning and interest through long-term engagement, in ways that seamlessly integrate into existing educational activities in classrooms, informal learning environments, and at home.",
        "My current research focuses on designing learning companion and classroom assistant robots to work with children at home and at school while learning in STEM disciplines. Companion robots “talk” to children while they read augmented books or participate in science activities by providing comments tailored to their interests and ability. The classroom assistant robots work with teachers and students to foster improved classroom orchestration and supports for collaborative learning. The goal of each child-robot interaction is to build social connections, provide collaboration and learning support, and to promote interest in reading and learning in STEM.",
        "Michaelis, J. E., Siebert-Evenstone, A., Shaffer, D. W. & Mutlu, B. (2020, April). Collaborative or Simply Uncaged? Understanding Human-Cobot Interactions in Automation. In CHI 2020, April 25-30, Honolulu, HI.",
        "Michaelis, J. E. & Mutlu, B. (2020, April) Social Aptitude from an Educational Robot Helps Promote Interest in Science Learning. Presented at the 2020 Annual Meeting of the American Educational Research Association, San Francisco, CA.",
        "Michaelis, J. E. & Nathan, M. J. (2020, April) A Case Study of Enculturation Practices that Support Emerging STEM Interest in an Out-of-School Program. Presented at the 2020 Annual Meeting of the American Educational Research Association, San Francisco, CA.",
        "Michaelis, J. E., & Mutlu, B. (2019, June). Supporting interest development in science learning with a social robot. ACM Interaction Design and Children Conference (IDC). Boise, Idaho.",
        "Michaelis, J. E., & Mutlu, B. (2018). Reading socially: Transforming the in-home reading experience with a learning-companion robot. Science Robotics, 3(21).",
        "Michaelis, J. E., & Mutlu, B. (2018). Social reading: Field study with an in-home learning companion robot. In J. Kay & R. Luckin (Eds.), Rethinking Learning in the Digital Age: Making the Learning Sciences Count, 13th International Conference of the Learning Sciences (ICLS) 2018, Volume 1. (pp. 1675-76). London, UK: International Society of the Learning Sciences.",
        "Acuna, S., Michaelis, J. E., Roth, J, & Towles, J. (2018, June). Intervention designed to increase interest in engineering for low-interest, K-12 girls did so for boys and girls. Paper presented at 2018 ASEE Annual Conference & Exposition, Salt Lake City, Utah.",
        "Michaelis, J. E., Wu, S. P. W., Rau. M. A., Nathan, M. J. (2018, April). Testing the four-phase interest development survey for Chemistry. Paper presented at the 2018 Annual Meeting of the American Educational Research Association, New York, NY.",
        "Michaelis, J. E. (2017). The role of interest and motivation in science investigation and engineering design instruction. Paper commissioned for the National Academies of Sciences, Engineering, and Medicine committee on Science Investigations and Engineering Design for Grades 6-12.",
        "Michaelis, J. E., & Mutlu, B. (2017, May). Someone to read with: Design of and experiences with an in-home learning companion robot for reading. In CHI 2017, May 06-11, Denver.",
        "Michaelis, J. E., & Nathan, M. J. (2016, June). Observing and measuring interest development among high school students in an out-of-school robotics competition. Paper presented at 2016 ASEE Annual Conference & Exposition, New Orleans, LA.",
        "Michaelis, J. E., & Nathan, M. J. (2015, June). The Four-Phase Interest Development in Engineering Survey. Paper presented at 2018 ASEE Annual Conference & Exposition, Educational Research Methods (ERM) Division. Seattle, WA.",
        "Rau, M. A., Michaelis, J. E., & Fay, N. (2015). Connection making between multiple graphical representations: A multi-methods approach for domain-specific grounding of an intelligent tutoring system for chemistry. Computers & Education, 82(0), 460-485.",
        "Ph.D. in Learning Sciences, with PhD minor in Computer Science, University of Wisconsin-Madison, 2019",
        "M.S. in Science Education Leadership, Illinois Institute of Technology, 2012"
    ],
    "out_links": [
        "https://cs.uic.edu/",
        "http://uic.edu/",
        "https://cs.uic.edu/undergraduate/",
        "https://cs.uic.edu/undergraduate/admitted-students/",
        "http://engineering.uic.edu/undergraduate-admissions/",
        "https://cs.uic.edu/undergraduate/abet-accreditation/",
        "https://cs.uic.edu/undergraduate/cs-major/",
        "https://cs.uic.edu/undergraduate/cs-minor/",
        "https://cs.uic.edu/undergraduate/undergrad-courses/",
        "https://cs.uic.edu/undergraduate/internships-and-jobs/",
        "https://cs.uic.edu/undergraduate/student-organizations/",
        "https://cs.uic.edu/undergraduate/student-profiles/",
        "https://cs.uic.edu/undergraduate/student-resources/",
        "https://cs.uic.edu/undergraduate/women/",
        "https://cs.uic.edu/graduate/",
        "https://cs.uic.edu/graduate/admitted-students/",
        "https://cs.uic.edu/graduate/admissions/",
        "https://cs.uic.edu/graduate/graduate-courses/",
        "https://cs.uic.edu/graduate/ms-program/",
        "https://cs.uic.edu/graduate/phd/",
        "https://cs.uic.edu/graduate/cs-dissertations/",
        "https://cs.uic.edu/graduate/post-grad-outcomes/",
        "https://cs.uic.edu/graduate/student-profiles/",
        "https://cs.uic.edu/graduate/graduate-student-resources/",
        "https://cs.uic.edu/cs-research/",
        "https://cs.uic.edu/cs-research/research-areas-2/",
        "https://cs.uic.edu/cs-research/labs/",
        "https://cs.uic.edu/cs-research/lectures-seminars/",
        "https://cs.uic.edu/cs-research/reus/",
        "https://cs.uic.edu/faculty-staff/",
        "https://cs.uic.edu/faculty-staff/department-head/",
        "https://cs.uic.edu/faculty-staff/faculty/",
        "https://cs.uic.edu/faculty-staff/emeritus-faculty/",
        "https://cs.uic.edu/faculty-staff/adjunct-faculty/",
        "https://cs.uic.edu/faculty-staff/staff/",
        "https://cs.uic.edu/faculty-staff/faculty-resources/",
        "https://cs.uic.edu/faculty-staff/open-positions/",
        "https://cs.uic.edu/cs-news/",
        "https://cs.uic.edu/cs-news/all-news/",
        "https://cs.uic.edu/cs-news/press-mentions/",
        "https://cs.uic.edu/cs-events/",
        "https://cs.uic.edu/cs-events/calendar/",
        "https://cs.uic.edu/cs-events/student-opportunities/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://jmich.people.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}