{
    "url": "https://sisl.lab.uic.edu/publications/",
    "title": "Publications | Systems & Internet Security Lab | University of Illinois at Chicago",
    "text": [
        "",
        "A Alhuzali, R Gjomemo, B Eshete, VN Venkatakrishnan – … {USENIX} Security Symposium ({USENIX} Security 18), 2018 [PDF]",
        "Birhanu Eshete and V.N. Venkatakrishnan",
        "In 47th IEEE/IFIP International Conference on Dependable Systems and Networks (DSN), Denver, CO, 2017.[PDF]",
        "Md Nahid Hossain, Sadegh M. Milajerdi, Junao Wang, Birhanu Eshete, Rigel Gjomemo, R. Sekar, Scott Stoller, V.N. Venkatakrishnan",
        "In 26th USENIX Security Symposium (SEC), Vancouver, BC, Canada, 2017.[PDF]",
        "Maliheh Monshizadeh, Prasad Naldurg, V.N. Venkatakrishnan",
        "In 6th ACM Conference on Data and Applications Security ( CODASPY), New Orleans, LA, 2016.",
        "Abeer Alhuzali, Birhanu Eshete, Rigel Gjomemo, V.N. Venkatakrishnan",
        "In 23rd ACM Conference on Computer and Communications Security (ACM CCS), Vienna, Austria , 2016.[PDF]",
        "Rigel Gjomemo, Phu H. Phung, Ted Ballou, Kedar Namjoshi, V.N. Venkatakrishnan and Lenore Zuck",
        "In IEEE Conference on Quality, Reliability and Security (QRS), Vienna, Austria, 2016.",
        "Birhanu Eshete, Abeer Alhuzali, Maliheh Monshizadeh, Phillip Porras, V. N. Venkatakrishnan, Vinod Yegneswaran",
        "In Network and Distributed System Security Symposium (NDSS), San Diego, CA, 2015.[PDF]",
        "Rigel Gjomemo, Kedar Namjoshi, Phu H. Phung, V.N. Venkatakrishnan, Lenore Zuck",
        "In Verification, Model Checking and and Abstract Interpretation (VMCAI), Mumbai, India, 2015.",
        "Boyuan He, Vaibhav Rastogi, Yinzhi Cao, Yan Chen, V.N. Venkatakrishnan, Runqing Yang, and Zhenrui Zhang",
        "In IEEE Symposium on Security and Privacy (SP), San Jose, CA, 2015.",
        "Daniele Gallingani, Rigel Gjomemo, V. N. Venkatakrishnan, Stefano Zanero",
        "In ACM Conference on Data and Application Security and Privacy (CODASPY), San Antonio, TX, 2015.",
        "Maliheh Monshizadeh, Prasad Naldurg, V. N. Venkatakrishnan",
        "In ACM Conference on Computer and Communications Security (CCS), Scottsdale, AZ, 2014.",
        "Birhanu Eshete, V.N. Venkatakrishnan",
        "In ACM Conference on Data and Application Security and Privacy ( CODASPY), San Antonio, TX, 2014. [PDF]",
        "Kalpana Gondi, A. Prasad Sistla, V.N. Venkatakrishnan",
        "In 19th Nordic Conference on Secure IT Systems (NordSec), Tromso, Norway, 2014. [PDF]",
        "Phu H. Phung, Maliheh Monshizadeh, Meera Sridhar and Kevin Hamlen, V.N. Venkatakrishnan",
        "In IEEE Transactions on Dependable and Secure Computing (TDSC), , 2014.",
        "Pratik Narang, Chittaranjan Hota, V. N. Venkatakrishnan",
        "In EURASIP Journal of Information Security (EURASIP), , 2014.",
        "John C. Pendergrass, Karen Heart, C. Ranganathan, V. N. Venkatakrishnan",
        "In International Journal of Healthcare Information Systems and Informatics ( IJHISI), , 2014.",
        "Kalpana Gondi, A. Prasad Sistla, V. N. Venkatakrishnan",
        "In ACM Conference on Data and Application Security and Privacy (CODASPY), San Antonio, TX, 2014.",
        "Rigel Gjomemo, Hafiz Malik, Nilesh Sumb, V. N. Venkatakrishnan, Rashid Ansari",
        "In Financial Cryptography and Data Security (FC), Barbados, 2014.",
        "Prithvi Bisht, Timothy L. Hinrichs, Nazari Skrupsky, V. N. Venkatakrishnan",
        "In Journal of Computer Security (JSS), , 2014.",
        "Pratik Narang, Subhajit Ray, Chittaranjan Hota, Venkat Venkatakrishnan",
        "In International Workshop on Cyber Crime (IWCC), San Jose, CA, 2014.",
        "Federica Fornaciari, C. Ranganathan, V.N. Venkatakrishnan",
        "In Eighth International Conference on Digital Society (ICDS), Barcelona, Spain, 2014.",
        "John C. Pendergrass, Karen Heart, C. Ranganathan, V.N. Venkatakrishnan",
        "In International Conference on Health Information Technology Advancement (HIM), Kalamazoo,MI, 2013.",
        "Mike Ter Louw, Phu H. Phung, Rohini Krishnamurti, V.N. Venkatkrishnan",
        "In 18th Nordic Conference on Secure IT Systems (NordSec), Illulisat, Greenlan, 2013.",
        "Nazari Skrupsky, Maliheh Monshizadeh, Prithvi Bisht, Timothy Hinrichs, V.N. Venkatakrishnan, Lenore Zuck",
        "In ASE Science Journal (Vol. 1, Issue 3, pp. 121-136), , 2012.",
        "Nazari Skrupsky, Maliheh Monshizadeh, Prithvi Bisht, Timothy Hinrichs, V.N. Venkatakrishnan, Lenore Zuck",
        "In Nazari Skrupsky, Maliheh Monshizadeh, Prithvi Bisht, Timothy Hinrichs, and Lenore Zuck (WebApps), Boston, MA, 2012.",
        "Kalpana Gondi, Prithvi Bisht, Praveen Venkatachari, A. Prasad Sistla, V.N. Venkatakrishnan",
        "In 2nd ACM Conference on Data and Application Security and Privacy (CODASPY), San Antonio, TX, 2012.",
        "Prithvi Bisht, Tim Hinrichs, Nazario Skrupsky, V.N. Venkatakrishnan",
        "In 18th ACM Conference on Computer and Communications Security (CCS), Chicago, IL, 2011.[PDF]",
        "Prithvi Bisht, P. Madhusudan, V.N. Venkatakrishnan",
        "In ACM Transactions on Information and Systems Security ( TISSEC), Volume 13, Issue 2, 2010.",
        "Michelle Zhou, Prithvi Bisht, V.N. Venkatakrishnan",
        "In 6th International Conference on Information Systems Security ( ICISS), Gandhinagar, India, 2010.",
        "Prithvi Bisht, Mike Ter Louw, Michelle Zhou,Kalpana Gondi and Karthik Thotta Ganesh, V.N. Venkatakrishnan",
        "In 6th International Conference on Information Systems Security (ICISS), Gandhinagar, India, 2010.",
        "Prithvi Bisht, Timothy Hinrichs, Nazario Skrupsky, Radoslaw Bobrowicz, V.N. Venkatakrishnan",
        "In ACM Conference on Computer and Communications Security (CCS), Chicago, IL, 2010.[PDF]",
        "Mike Ter Louw, Karthik Thotta Ganesh, V.N. Venkatakrishnan",
        "In USENIX Security Symposium (SEC), Washington D.C, 2010.[PDF]",
        "Prithvi Bisht, A. Prasad Sistla, V.N. Venkatakrishnan",
        "In Financial Cryptography and Data Security (FC), Tenerife, Spain, 2010.[PDF]",
        "Zhenkai Liang, Weiqin Sun, R. Sekar, V.N. Venkatakrishnan",
        "In ACM Transactions on Information and Systems Security (TISSEC), Volume 12, Issue 3, 2009.",
        "Mike Ter Louw, V.N. Venkatakrishnan",
        "In IEEE Symposium on Security and Privacy (S&P), Oakland, CA, 2009.[PDF]",
        "Mike Ter Louw, Jin Soon Lim, V.N. Venkatakrishnan",
        "In Journal in Computer Virology (JCV), Volume 4, Number 3, 2008.",
        "Roberto Capizzi, Antonio Longo, A. Prasad Sistla, V.N. Venkatakrishnan",
        "In 24th ACSA Computer Applications Security Conference (ACSAC), Anaheim, CA, 2008. [PDF]",
        "Prithvi Bisht, V.N. Venkatakrishnan",
        "In Conference on Detection of Intrusions & Malware, and Vulnerability Assessment (DIMVA), Paris, France, 2008.",
        "Weiqing Sun, R. Sekar, Zhenkai Liang, V.N. Venkatakrishnan",
        "In Fifth GI International Conference on Detection of Intrusions & Malware, and Vulnerability Assessment (DIMVA), Paris, France, 2008.",
        "Mike Ter Louw, Prithvi Bisht, V.N. Venkatakrishnan",
        "In Workshop on Web 2.0 Security and Privacy (W2SP), Oakland, CA, 2008.",
        "A. Prasad Sistla, Michelle Zhou, Hilary Branske, V.N. Venkatakrishnan",
        "In 3rd ACM Symposium on Information, Computer and Communications Security (ASIACCS), Tokyo, Japan, 2008. [PDF]",
        "South Bandhakavi, Prithvi Bisht, P. Madhusudan, V.N. Venkatakrishnan",
        "In 14th ACM Conference on Computer and Communications Security (CSS), Alexandria, VA, 2007.[PDF]",
        "Mike Ter Louw, Jin Soon Lim, V.N. Venkatakrishnan",
        "In Fourth GI International Conference on Detection of Intrusions & Malware, and Vulnerability Assessment (DIMVA), Luzerne, Switzerland, 2007.[PDF]",
        "Michael Leonhard, V.N. Venkatakrishnan",
        "In IEEE Conference on Information Technology (EIT), Chicago, IL, 2007.",
        "T. Khatiwala, R. Swaminathan, V.N. Venkatakrishnan",
        "In 22nd Annual ACSA Computer Applications Security Conference (ACSAC), Miami, FL, 2006.[PDF]",
        "V.N. Venkatakrishnan, W. Xu, D.C. DuVarney, R. Sekar",
        "In 8th International Conference on Information and Communications Security (ICICS), Raleigh, NC, 2006.[PDF]"
    ],
    "out_links": [
        "https://sisl.lab.uic.edu/",
        "http://uic.edu/",
        "https://sisl.lab.uic.edu/projects/",
        "https://sisl.lab.uic.edu/projects/maldives/",
        "https://sisl.lab.uic.edu/projects/marple/",
        "https://sisl.lab.uic.edu/projects/esp-igert-2/",
        "https://sisl.lab.uic.edu/projects/csfv/",
        "https://sisl.lab.uic.edu/people/",
        "https://sisl.lab.uic.edu/news/",
        "https://sisl.lab.uic.edu/contact/",
        "https://www.cs.uic.edu/",
        "https://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}