{
    "url": "https://sisl.lab.uic.edu/news-stories/paper-accepted-at-ieee-security-privacy-2019-oakland-2019/",
    "title": "Paper Accepted at IEEE Security & Privacy 2019 | Systems & Internet Security Lab | University of Illinois at Chicago",
    "text": [
        "SISL paper “HOLMES: Real-time APT Detection through Correlation of Suspicious Information Flows” has been accepted at the IEEE Security & Privacy Conference in San Francisco, CA May 20-22 2019.",
        "CITATION",
        "S. Momeni Milajerdi, R. Gjomemo, B. Eshete, R. Sekar and V. Venkatakrishnan, “HOLMES: Real-Time APT Detection through Correlation of Suspicious Information Flows,” 2019, 2019 IEEE Symposium on Security and Privacy (SP), San Fransisco, CA, US, pp. 430-445.",
        "ABSTRACT",
        "In this paper, we present HOLMES, a system that implements a new approach to the detection of Advanced and Persistent Threats (APTs). HOLMES is inspired by several case studies of real-world APTs that highlight some common goals of APT actors. In a nutshell, HOLMES aims to produce a detection signal that indicates the presence of a coordinated set of activities that are part of an APT campaign. One of the main challenges addressed by our approach involves developing a suite of techniques that make the detection signal robust and reliable. At a high-level, the techniques we develop effectively leverage the correlation between suspicious information flows that arise during an attacker campaign. In addition to its detection capability, HOLMES is also able to generate a high-level graph that summarizes the attacker’s actions in real-time. This graph can be used by an analyst for an effective cyber response. An evaluation of our approach against some real-world APTs indicates that HOLMES can detect APT campaigns with high precision and low false alarm rate. The compact high-level graphs produced by HOLMES effectively summarizes an ongoing attack campaign and can assist real-time cyber-response operations.",
        "DETAILS & FULL PAPER",
        "",
        ""
    ],
    "out_links": [
        "https://sisl.lab.uic.edu/",
        "http://uic.edu/",
        "https://sisl.lab.uic.edu/projects/",
        "https://sisl.lab.uic.edu/projects/maldives/",
        "https://sisl.lab.uic.edu/projects/marple/",
        "https://sisl.lab.uic.edu/projects/esp-igert-2/",
        "https://sisl.lab.uic.edu/projects/csfv/",
        "https://sisl.lab.uic.edu/people/",
        "https://sisl.lab.uic.edu/publications/",
        "https://sisl.lab.uic.edu/news/",
        "https://sisl.lab.uic.edu/contact/",
        "https://www.cs.uic.edu/",
        "https://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}