{
    "url": "https://wellnesscenter.uic.edu/workshops/workshops-offered/",
    "title": "Workshops Offered | Wellness Center | University of Illinois at Chicago",
    "text": [
        "Workshops Offered",
        "Savvy Street Safety",
        "Learn the verbal tricks and cons of \"Stranger Danger.\" Find out who Stranger Danger is and why they want you. Learn how to recognize and avoid opportunistic crimes. This workshop teaches you how to stay safe in the Big City. Using demonstrations and easy safety strategies, you’ll discover how to maximize your personal safety and how to be ready if you are approached by \"Stranger Danger.\"",
        "Conquering Conflict",
        "Conflict, a natural part of life, can occur at any time and in any professional or personal relationship.  Successfully managing a conflict starts with understanding how you react in these tense situations.  Workshop participants will identify their “hot buttons, be introduced to the Five Styles of Conflict Resolution, learn how to stay in control during a conflict, and gain communication tools and insight to successfully navigate conflict.",
        "Let's Talk About Love",
        "Being in love is great whether it is with a friend or an intimate partner.  Being in love is also one of the most complex relationships that we will ever experience in our life.  Do you know when you are in a healthy or unhealthy relationship? What does that feel like?  What should your partner be doing or not doing?  Get the answer to these and other critical love questions.  This workshop looks at the love areas of boundaries, trust, healthy behavior, communication, and sex. Walk-in wondering and walk out knowing.",
        "Who Wants to be a Sexpert?",
        "Here's your chance to match your Sextelligence against your club members, suitemates, and classmates! Based on the game \"Jeopardy,\" this workshop lets you pick categories such as \"What is this?\" or \"How do I get rid of this?\" You will have fun learning about safe sex practices, STI symptoms, how STI's are spread and more!",
        "Stretching out your Stress",
        "The train delays the morning of your exam, computer problems the night before a big paper is due, the roommates who expect you to clean up after them. We all deal with stress every day. In this unique workshop, the focus is more on doing and less on lecture. You get to use relaxation techniques such as: deep breathing, imagery, stretching, and meditation. \"Relaxed\" and \"calm\" are the words used by students to describe how they feel after this workshop.",
        "Study Smart, Study Less",
        "Do you feel like you study hard but get to the test and realize you didn’t study enough? This class explores learning styles that will help you pinpoint which way is the best way for you to study. Once you know, you will be able to study smart, study less! Who really wants to be trapped inside studying for hours? Instead, learn how to maximize your studying and enjoy more of your personal life!",
        "Keg of Knowledge",
        "Don’t just drink out of the keg, impress your friends with your keg of knowledge! This hands-on workshop is purposefully designed with information that will equip you with the knowledge of safe drinking practices. Participants will get to play the fast-paced game of “slamming shots” (and no, its not with alcohol).  Learn how to drink with all of the fun and none of the hazards!",
        "Killer Chemicals",
        "Most of us know the hazards of items such as gas, bleach, and other powerful cleaning products but do you know about all of the “killer chemicals” in your everyday life that you use and think are perfectly safe? Did you know that make-up has chemicals? Did you know that the same aluminum that you use to wrap up your food is in most deodorants?",
        "Think Pink",
        "It's important for everyone to understand the risk factors associated with breast cancer but even more important to know the steps that you can take to improve your breast health. This workshop will give you a basic understanding of how nutrition, exercise, and stress management play a significant role in supporting breast health. Participants will learn the proper technique of a self-breast examination and get to feel actual \"lumps\" in breast models."
    ],
    "out_links": [
        "https://wellnesscenter.uic.edu/",
        "http://uic.edu/",
        "https://wellnesscenter.uic.edu/about-us/",
        "https://wellnesscenter.uic.edu/about-us/need-help/",
        "https://wellnesscenter.uic.edu/about-us/faqs/",
        "https://wellnesscenter.uic.edu/about-us/contact/",
        "https://wellnesscenter.uic.edu/news-and-events/",
        "https://wellnesscenter.uic.edu/news-and-events/calendar/",
        "https://wellnesscenter.uic.edu/news-and-events/annual-events/",
        "https://wellnesscenter.uic.edu/news-and-events/past-events/",
        "https://wellnesscenter.uic.edu/resources-and-services/",
        "https://wellnesscenter.uic.edu/resources-and-services/pop-up-pantry/",
        "https://wellnesscenter.uic.edu/resources-and-services/individual-consultations/",
        "https://wellnesscenter.uic.edu/resources-and-services/homeless-assistance/",
        "https://wellnesscenter.uic.edu/resources-and-services/wellness-supplies/",
        "https://wellnesscenter.uic.edu/resources-and-services/stress-relief-place/",
        "https://wellnesscenter.uic.edu/resources-and-services/sexual-health/",
        "https://wellnesscenter.uic.edu/resources-and-services/literature-library/",
        "https://wellnesscenter.uic.edu/resources-and-services/alcohol-e-chug/",
        "https://wellnesscenter.uic.edu/resources-and-services/studying-2/",
        "https://wellnesscenter.uic.edu/resources-and-services/conflict-management/",
        "https://wellnesscenter.uic.edu/resources-and-services/sleep/",
        "https://wellnesscenter.uic.edu/workshops/",
        "https://wellnesscenter.uic.edu/workshops/request-a-workshop/",
        "https://wellnesscenter.uic.edu/policies/",
        "https://wellnesscenter.uic.edu/policies/alcohol-and-other-drug/",
        "https://wellnesscenter.uic.edu/policies/smoke-free-campus-policy-fine-payment/",
        "https://wellnesscenter.uic.edu/policies/student-disciplinary-policy/",
        "https://wellnesscenter.uic.edu/policies/cannabis-policy/",
        "http://connect.uic.edu/",
        "http://studentaffairs.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}