{
    "url": "https://wellnesscenter.uic.edu/news-stories/healthy-campus-covid-19-prevention-tips/",
    "title": "Healthy Campus COVID-19 Prevention Tips | Wellness Center | University of Illinois at Chicago",
    "text": [
        "As you know, the Corona Virus (COVID-19) has made its way to the US.",
        "Now is the time to start thinking about what small but practical and active steps you can do to lower your risk of infection as much as is possible.  The World Health Organization (WHO) really stresses the importance of keeping your hand clean and not touching your face.",
        "Wash your hand for 15 to 20 seconds when you arrive to campus after traveling on a bus or train; when you are moving between classes, prior to eating; and prior to using public computers.  This is a time limit set by WHO in order to ensure that a thorough wash has occurred.",
        "Prior to using a public computer, wipe down the following areas with a hand sanitizer or alcohol wipe.  According to The Guardian, the following electronic equipment has, on average, thousands of microbes.  Although the length of time that COVID-19 lives on a surface are not yet known, WHO recommends wiping down public surfaces.",
        "If you are coughing or sneezing, be protective of those around you and cover your mouth with a tissue or with a flexed elbow. WHO suggests that used tissue be disposed of in bins that have a lid.",
        "This protocol is especially important if you are in and small enclosed space like an office or classroom.  If possible, step away from others, when coughing, at least 3 feet (1 meter) more if possible.  This is the airborne travel distance of the virus after a cough, as measured by WHO.",
        "Your protocol should be not to touch your face, eyes, nose, or mouth unless your hands were just cleaned.  Unclean hands can introduce contagions into your system through these “open” channels.",
        "Carry hand sanitizer with you to clean hands when not near a restroom and to use when wiping down public computers.  As you may know, there is now a shortage on hand sanitizer.  While companies are working to meet the increased demand, you can activate the option of making your own hand sanitizer.  It is really easy and requires two ingredients.",
        "",
        "Hand Sanitizer Recipe:",
        "",
        "Wishing you Well,",
        "Your friends at the Wellness Center",
        "For your convenience, we have put together information to:",
        "In addition, at the end of this email, we shared a direct link to the World Health Organization, so that you have direct access to WHO’s expertise, advice, and updates. On their web site, you will also find prevention information, Situation Reports, and videos all focused on Corona Virus education.",
        "Now that you have this information, please share it with others who may be concerned about the spread of this virus.",
        "",
        "",
        "What is Corona Virus and what are the symptoms? By James Gallagher (Health and Science correspondent)",
        "See Link: https://www.bbc.com/news/health-51048366 for the full article",
        "It seems to start with a fever, followed by a dry cough.",
        "After a week, it leads to shortness of breath and some patients require hospital treatment. Notably, the infection rarely seems to cause a runny nose or sneezing.",
        "The incubation period – between infection and showing any symptoms – lasts up to 14 days, according to the World Health Organization (WHO).",
        "How deadly is the coronavirus?",
        "Based on data from 44,000 patients with this coronavirus, the WHO says:",
        "The proportion dying from the disease, which has been named COVID-19, appears low (between 1% and 2%) – but the figures are unreliable.",
        "To put this into context, about one billion people catch influenza (the flu) every year, with between 290,000 and 650,000 deaths. The severity of flu changes every year.",
        "How can I protect myself?",
        "Who is WHO?",
        "Their mission: “WHO works worldwide to promote health, keep the world safe, and serve the vulnerable. Our goal is to ensure that a billion more people have universal health coverage, to protect a billion more people from health emergencies, and provide a further billion people with better health and well-being.”",
        "https://www.who.int/emergencies/diseases/novel-coronavirus-2019",
        "Got 4 minutes? Here’s a video from WHO describing the Corona Virus (COVID-19)",
        "https://youtu.be/mOV1aBVYKGA"
    ],
    "out_links": [
        "https://wellnesscenter.uic.edu/",
        "http://uic.edu/",
        "https://wellnesscenter.uic.edu/about-us/",
        "https://wellnesscenter.uic.edu/about-us/need-help/",
        "https://wellnesscenter.uic.edu/about-us/faqs/",
        "https://wellnesscenter.uic.edu/about-us/contact/",
        "https://wellnesscenter.uic.edu/news-and-events/",
        "https://wellnesscenter.uic.edu/news-and-events/calendar/",
        "https://wellnesscenter.uic.edu/news-and-events/annual-events/",
        "https://wellnesscenter.uic.edu/news-and-events/past-events/",
        "https://wellnesscenter.uic.edu/resources-and-services/",
        "https://wellnesscenter.uic.edu/resources-and-services/pop-up-pantry/",
        "https://wellnesscenter.uic.edu/resources-and-services/individual-consultations/",
        "https://wellnesscenter.uic.edu/resources-and-services/homeless-assistance/",
        "https://wellnesscenter.uic.edu/resources-and-services/wellness-supplies/",
        "https://wellnesscenter.uic.edu/resources-and-services/stress-relief-place/",
        "https://wellnesscenter.uic.edu/resources-and-services/sexual-health/",
        "https://wellnesscenter.uic.edu/resources-and-services/literature-library/",
        "https://wellnesscenter.uic.edu/resources-and-services/alcohol-e-chug/",
        "https://wellnesscenter.uic.edu/resources-and-services/studying-2/",
        "https://wellnesscenter.uic.edu/resources-and-services/conflict-management/",
        "https://wellnesscenter.uic.edu/resources-and-services/sleep/",
        "https://wellnesscenter.uic.edu/workshops/",
        "https://wellnesscenter.uic.edu/workshops/workshops-offered/",
        "https://wellnesscenter.uic.edu/workshops/request-a-workshop/",
        "https://wellnesscenter.uic.edu/policies/",
        "https://wellnesscenter.uic.edu/policies/alcohol-and-other-drug/",
        "https://wellnesscenter.uic.edu/policies/smoke-free-campus-policy-fine-payment/",
        "https://wellnesscenter.uic.edu/policies/student-disciplinary-policy/",
        "https://wellnesscenter.uic.edu/policies/cannabis-policy/",
        "http://connect.uic.edu/",
        "http://studentaffairs.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}