{
    "url": "https://engineering.uic.edu/news-stories/cs-assistant-professor-elena-zheleva-works-to-infuse-causal-inference-into-machine-learning-algorithm-design/",
    "title": "CS Assistant Professor Elena Zheleva works to infuse causal inference into machine-learning algorithm design | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Even if we don’t realize it, machine-learning algorithms affect many of our everyday decisions: they can make recommendations on what to buy, what news to read, or whom to date. These algorithms do what they do by examining our previous choices and the choices of people who are similar to us. What they do not typically consider is the downstream impact of these recommendations: how we feel or how our perspectives change as a result.",
        "It’s a missing piece that concerns Elena Zheleva, assistant professor of computer science. She hopes to resolve the problem by infusing “causal inference” into how algorithms are designed.",
        "Zheleva offered an example of a Twitter post containing fringe political content. “An algorithm doesn’t consider how this tweet that is recommended to you will impact your life,” she said. “Would it enhance your life in some way, or would it contribute to radicalizing you?”",
        "Gaining insight into causality—how different recommendations or interventions can help or harm us—is what Zheleva hopes to infuse into machine-learning algorithms, helping to reshape how they work.",
        "“Machine-learning algorithms are used to impact many decisions in our life. That’s something [that] recommendation algorithms control, and we should be aware of the impact,” Zheleva said—especially whether the effect is negative or positive.",
        "There is little research on how algorithms can maximize positive impact based on data collected in online settings, especially in rapidly changing environments. Zheleva has received grants to investigate solutions to this problem: one from the Defense Advanced Research Projects Agency (DARPA) and another from Anthem.",
        "The DARPA grant, which is in collaboration with the University of Southern California, isn’t solely about how algorithms affect the way people feel or what they perceive, but rather how algorithms can influence how people perform. She is studying human performance in several venues: online games, language-learning applications, and Stack Exchange, a network of question-and-answer websites where users vote on the questions and answers posted by others, leading the most highly endorsed posts to rise in reputation.",
        "Zheleva’s algorithms will detect and analyze changes in a user’s performance and use that analysis to suggest tailored ways to improve attention and motivation. Her algorithm accounts for factors such as a user’s experience with a platform, the length of the user’s current session, and decisions that users make within sessions or games.",
        "“We are looking different game characteristics that could affect team success,” Zheleva said.",
        "For instance, if a user’s character gains or loses power in an online game, that may make some players become more fiercely competitive but cause others to lose interest and disengage. An algorithm that can keep a user engaged by recognizing and accommodating that person’s strengths and weaknesses could lead to a more successful outcome—depending on how you look at it, for the user, the platform, or both.",
        "Zheleva’s other research project, funded by Anthem, is a collaboration with Houshang Darabi, an associate professor in UIC’s mechanical and industrial engineering department. In this study, Zheleva is analyzing large-scale longitudinal patient data to figure out which personalized interventions can optimize health outcomes.",
        "For instance, if a person quits or cuts down on smoking, that can lead to a significant decrease in medical costs. Individuals’ attributes, such as their genetics, environment, and pre-existing conditions, can amplify or diminish the causal effects of their smoking. Zheleva’s work will use causal inference methods to predict what the outcome would have been if a person who received treatment had received a different medical intervention instead.",
        "To learn more about Zheleva’s work, visit her website.",
        ""
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://www.cs.uic.edu/~elena/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}