{
    "url": "https://engineering.uic.edu/news-stories/che-department-does-its-part-to-fight-covid-19/",
    "title": "ChE department does its part to fight COVID-19 | College of Engineering | University of Illinois at Chicago",
    "text": [
        "The scientific community across the world races to provide vaccines, treatments, and protections from the novel coronavirus known as COVID-19, including chemical engineers at UIC.",
        "Professor and Head Vikas Berry said the field of chemical engineering can provide expertise in how to protect medical workers from viruses, improve drug delivery, and explain the chemistry behind how soap can help stop the spread.",
        "“Apart from social distancing, other important mechanisms to flatten the curve of the epidemiological spread of COVID-19 are keeping our hands clean, using PPE, and ultimately developing vaccines,” Berry said. “In this regard, chemical engineering can provide solutions by producing hand-sanitizers, soaps that disintegrate the virus, masks and vaccine delivery systems.”",
        "Assistant Professor Sangil Kim and his Molecular Transports in Nanopores Lab are working to develop a vira, filtration mask that will provide strong protection along with high breathability and comfort. His group has been working on designing new nanoengineered membrane materials, some of which can be used for biomedical engineering, including different nanoporous filter materials for protective fabrics, respirators, and rapid separation of biological particles from clinical samples.",
        "The viral-filtration masks feature a nanofibrous filter, which can filter nanopores as opposed to the micropores that a conventional micro-sized mask filter. This is important, Kim said, because most virus sizes are in range of few nanometers to hundred nanometers.",
        "Another issue with the way conventional N95 masks capture nanosized virus particles, Kim said, is they work based on the electrostatic interaction between viral particles and filter materials. He added that if the mask is washed, it loses this electrostatic ability.",
        "“Our nanofibrous filter can provide full protection against the COVID-19 and resolve the shortage of N95 masks because it is durable and washable,” Kim said.",
        "His team is also working with Associate Professor Gang Cheng to develop a multifunctional respirator filter that has high breathability and can also capture and kill viral particles. The filter would also have self-cleaning capabilities. The researchers said this combination of features is something that current respirators and medical masks filters, such as the N95, cannot provide.",
        "Associate Professor Ying Liu is collaborating with virologists to help expedite SARS-cov2 antiviral drug screening by incorporating nano-vesicles into a high throughput screening process. Liu and her team are also working with virologists to develop low-density aerosol particles for deep lung delivery of antiviral drug compounds.",
        "Another project being developed in the department is a collaboration between Kim and Cheng to create a membrane-incorporated, viral-particles-separation device. This device could be used to separate virus particles or serum from 15 mL whole blood in 10 minutes without the need for a centrifuge or electricity.",
        "“In particular, the highly efficient antifouling membranes can prevent fouling of sticky blood cells on membrane surface and provide high serum or virus transport rates, which can help rapid viral diagnosis and vaccine development,” Kim said."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}