{
    "url": "https://engineering.uic.edu/news-stories/chemical-engineering-team-develops-novel-membrane-material-for-water-purification-energy-harvesting/",
    "title": "Chemical engineering team develops novel membrane material for water purification, energy harvesting | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Scientists have been working for years since the discovery of 2D layered nanomaterials to develop extremely thin systems that can be used to help remove containments from water, while still allowing clean liquid to flow through. A team of researchers from the Chemical Engineering Department are the first to create a negatively charged surface on a membrane for this purpose.",
        "Assistant Professor Sangil Kim, PhD students Aaditya Pendse, Irene Meng-Hsuan Lin, and their team reported their findings in a study titled “Charged Layered Boron Nitride-Nanoflake Membranes for Efficient Ion Separation and Water Purification” in the academic journal Small. The innovative research was selected to appear on the front cover of the journal.",
        "The team created the 2D lamellar membrane using hexagonal boron nitride. Many industries need materials that can reject or repel certain containments or chemicals in liquids, but also need those materials to be permeable enough for the liquid to pass through them, like a high-tech version of a food colander. In laboratory experiments described in the paper, the team found this new membrane system provided a very high-success rate of repelling ions in water from multivalent salt ions as well as for small-sized anionic dyes.",
        "“In the case of hexagonal boron nitride, it’s a charged based system,” Kim said. “It effectively excludes ions by combining the size exclusion and the electrostatic repulsion mechanisms, so when ions approach it, they are repelled. It is a more effective system than most 2D graphene-based membranes.”",
        "Kim added the membrane could be used to remove alkaline from wastewater from factories in many different industries or as part of energy harvesting systems from various sources like when salt water and fresh water mix together.",
        "Lin, who compiled the ion analyses for the research paper, said the research team was really grateful to have their paper appear on the cover of the journal.",
        "“It is very exciting to demonstrate the high-separation performance of our membrane after working for three years and to have it on the cover of Small,” Pendse said. “It is great to know that what we do has some impact, and people have seen there are real-life applications and we could have an impact on society.”",
        "Moving forward, Pendse said the team is working on decreasing the thickness of the membrane to further improve separation performance. Kim noted the thinner the material the more permeable it should be, which would allow a higher rate of water to flow through it faster.",
        "“We need to decrease the thickness of our membrane to improve our flow rate, while maintaining the same rejection rate,” Pendse said.",
        "The research has been supported by the Advanced Manufacturing program of the National Science Foundation. In addition to Pendse, Lin, and Kim, students Angelina Rackovic, Rousan Debbarma, Soroush Almassi, and faculty members Associate Professor Brian Chaplin and Professor Vikas Berry were coauthors of the article. Other non-UIC co-authors included Semih Cetindag, and Professor Jerry Shan at Rutgers University."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}