{
    "url": "https://engineering.uic.edu/news-stories/ece-phd-student-ouday-hanosh-goes-back-to-summer-camp/",
    "title": "ECE PhD student Ouday Hanosh goes back to summer camp | College of Engineering | University of Illinois at Chicago",
    "text": [
        "The life of a PhD student is always busy with research, exams, and the all-consuming dissertation. For Ouday Hanosh, an electrical and computer engineering PhD student, it included six weeks of summer camp.",
        "This summer, the UIC College of Engineering hosted two camp options for future engineers: the weeklong Engineering Experience Summer Camp for elementary, middle, and high school students and the Women in Engineering Summer Program (WIESP) geared toward high school students.",
        "Hanosh served as the supervisor for three of the four weeks of the WIESP camp and also led the ECE portion of the Engineering Experience Summer Camp.",
        "“Ouday’s passion for engineering shows through all the hard work he places into his curriculum for these programs,” said Sabrina Jones, an undergraduate who led one of the weeks of WIESP. “He truly cares that the students understand what it is they are working on, so they can then carry that knowledge with them far into their futures and build on everything they learn.”",
        "At the camps, students built soda-can robots to put to a test of speed, basked in the glow of LED mood-lights they had programmed, and learned about traffic control with their very own microcontroller real-time, four-way traffic-light system.",
        "In feedback, students from both camps raved about the quality of the projects Hanosh devised for the students.",
        "Where did he get his inspiration? He said it begins at home. “I use microcontrollers and microprocessors at home. I have Arduino and Rasberry Pi controllers. I do stuff for fun,” Hanosh said. “I control all the lights using Arduino and infrared sensors.”",
        "Hanosh said he worked on a master’s degree project using a TMS C25 external microprocessor for a real-time image processing project. He used a feature-detecting device to classify data from multiple cameras, to quickly decipher a person’s identity. The computer processor alone was too slow to do this in real-time, so adding the external microprocessor allowed parallel processing. A memory arbiter would synchronize whether the computer or microprocessor, which is essentially an additional computer, would process each image.",
        "Current microprocessors, such as Rasberry Pi, are essentially a general-purpose computer, and far easier to work with than the microprocessors Hanosh used for his image-processing project. Arduinos, which are development boards with an embedded microcontroller, make assembling these projects also a bit easier.",
        "Still, Hanosh said the projects he had the campers work on were not watered-down projects; he wanted students to get an idea of the types of things they could work on as an electrical or computer engineer.",
        "“There is so much on the hardware side of engineering: the ability to build things, make something move, or run programming. It’s really cool, and I wanted them to see that,” Hanosh said.",
        "Hanosh isn’t new to the classroom. He taught at the University of Nawroz in Kurdistan from 2007 to 2012 in their Computer Science Department before arriving at UIC. In addition to this summer’s camps, he also worked as a teaching assistant for the chemical engineering camp at UIC several years ago, helping high schoolers with electrical and software related-tasks.",
        "This fall, Hanosh is working as a teaching assistant for ECE 417, Digital Signal Processing II, running the labs. Hanosh’s own research is largely on healthcare applications, including motion-based thermal sensing for sleep, which will aid in detecting epileptic seizures, and with sleep apnea.",
        "Hanosh holds a master’s degree in electrical engineering from University of Baghdad, Iraq, and a master’s of computer engineering from University of Portsmouth, England. He is especially proud of his certificate from Spinnaker School of English in Pourtsmouth, certifying him to teach English—one of the four languages Hanosh speaks fluently. The others Hanosh speaks are Arabic, Aramaic, and Kurdish.",
        "Hanosh passed his PhD preliminary exams this summer—in between the two camp sessions—and looks forward to completing his PhD next year. In his free time, Hanosh paints.",
        "“I really enjoy UIC, and love working with students of all ages. I learn a lot from them,” Hanosh said. “The camps were amazing this year. I already have ideas for next year’s projects.”",
        "One of the UIC Engineering Experience Summer Camp projects created by students, an 8×8 LED matrix module paired with an Arduino Uno, programmed to form a pattern–in this case, a heart."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}