{
    "url": "https://engineering.uic.edu/news-stories/mom-me-and-swe-brings-a-day-of-engineering-and-fun-to-area-middle-school-students/",
    "title": "“Mom, Me and SWE” brings a day of engineering and fun to area middle-school students | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Building skyscrapers, assembling LED-light flashlights, and crafting binary-code bracelets were all part of “Mom, Me and SWE,” a hands-on introduction to engineering for Chicago-area middle school students hosted by UIC’s Society of Women Engineers (SWE) on October 19.",
        "A contingent of SWE members shared their enthusiasm with 16 students and their parents at the event, held on campus in the Engineering Research Facility.",
        "Leyla Atasoy, who was there with her mother Didem Ozevin and her friend Elodie Weprin, was chatting excitedly before the event. Ozevin is a civil engineer and an associate professor in the civil and materials engineering department at UIC, and knew her daughter would enjoy the projects.",
        "“I’ve already done coding and tinkering, in a program I do afterschool. I also made a robot and learned to program it,” Atasoy said.",
        "Alana Corona, a seventh-grader from the Jefferson Park neighborhood, attended the event with her father Abraham. This was her third time at the event, which her mother learned about through Elsa Soto, the associate director of Women in Engineering Programs at UIC. Alana enjoys all the hands-on projects Mom, Me and SWE offers.",
        "For the first project, students learned from SWE members about the basics of skyscraper and bridge-building, and then engineered their own buildings, using tape, popsicle sticks, coffee stirrers, and bamboo skewers. The buildings had to stand on their own, and were measured. The winner was Laiba Navaid of Morton Grove, with a skyscraper measuring 5’10”.",
        "Stephanie Gomez-Luz, president of SWE and an aide in the Women in Engineering Programs office, says the popular event inspires not only the attendees, but the SWE mentors.",
        "“I really wish I had something like this when I was younger,” Gomez-Luz said. “When we host this event it’s like I’m seeing the younger version of me and I’m reminded why I got into engineering. It’s very motivating.”",
        "Gomez-Luz says each year the particular projects are changed, but three of the 10 engineering majors are featured through the projects. This time, civil engineering, electrical engineering, and computer science were featured.",
        "After the three building challenges, the group learned all about the science of making ice cream quickly through the use of nitrogen, and enjoyed the tasty results. The demonstration was hosted by FM Global, a commercial property insurance company. Three FM Global employees spoke about their engineering careers and their roles at FM Global, including one of their more recent hires, UIC engineering graduate and SWE member Lorena Pereira.",
        "“I fell in love with chemistry in high school, and got into engineering because I like to help solve problems,” Pereira said.",
        "As part of her current work, she joked that she “gets to set things on fire and see how they burn.”",
        "After the learning, the young students munched on pizza and salad.",
        "“I was so excited when I heard about this day,” said Lisa Shaw, whose daughter, Narobi, came in second in the skyscraper-building contest. “My daughter wants to be an engineer. She loves robots and went to the NASA camp this summer. This is great for her. I guess I always wanted to be an engineer, too.”",
        "SWE hosts “Mom, Me and SWE” events each semester, and welcomes female high school students to visit campus and attend classes with current UIC engineering students through its SWE Shadow Day program."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://swe.students.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}