{
    "url": "https://engineering.uic.edu/news-stories/chris-burke-receives-ray-k-linsley-award-for-surface-water-hydrology/",
    "title": "Chris Burke receives Ray K. Linsley Award for surface water hydrology | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Chris Burke, a professor of practice in civil and materials engineering (CME), received the prestigious 2019 Ray K. Linsley Award from the American Institute of Hydrology (AIH).",
        "The award is named after noted surface water hydrologist and author Ray K. Linsley, and it was established in 1986 to honor those “who have made outstanding contributions in surface water hydrology.” Surface water hydrology includes the study of above-ground water, such as stormwater, flood waters, rivers and reservoirs, and the impact that these waters have on the environments around them.",
        "The award recognizes Burke’s many contributions to the science and practice of surface water hydrology and the impact he has had on numerous communities by finding environmentally friendly solutions to water management problems.",
        "Burke is the president and owner of Christopher B. Burke Engineering, Ltd. (CBBEL), an Illinois-based consulting engineering and surveying firm specializing in civil, transportation/highway, municipal, traffic, construction, water resources, environmental, structural, and mechanical engineering.",
        "He has been engaged in numerous municipal and civil engineering projects, particularly site review and development, storm water management, sanitary sewers, flood control, transportation design, channel modification, and bridge replacement. He has authored numerous technical publications in water resources and has taught courses in engineering hydrology, hydraulics and hydrology, and hydraulic structures at UIC since 2002.",
        "“The award highlights Chris’ great impact on many communities through numerous engineering and practical water management projects that he has led,” said Abolfazl Mohammadian, CME department head. “Chris has taught courses in Engineering Hydrology, Hydraulics and Hydrology, and Hydraulic Structures. Because of his unique teaching approach in combining science and practical experience, Dr. Burke’s classes are among the most popular courses in the department.”",
        "“We are proud to honor Dr. Burke for his long-standing commitment to the engineering profession, not only in serving the needs of clients, but by going into classrooms and out in the community to further the reach of the field,” said John L. Nieber, president of the AIH.",
        "Burke founded CBBEL in 1986 and has grown the firm to more than 250 employees at eight locations throughout Illinois and Indiana. Over the course of its more than 30 years in business, CBBEL has worked with a host of public and private sector clients on high-profile projects from water resources and civil engineering to surveying and traffic engineering. He also is committed to fostering and mentoring the next generation of engineers.",
        "“I truly believe it’s important for those in the engineering profession to look beyond their desk and the task in front of them, to take a role in making the world a better place, to be a ‘citizen engineer’,” said Burke. “I’m humbled by this recognition and grateful to the CBBEL team, an outstanding group of professionals I am proud to work with.”"
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}