{
    "url": "https://engineering.uic.edu/news-stories/chemical-engineering-accelerates-through-summer/",
    "title": "Chemical engineering accelerates through summer | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Summer break for college students is often associated with part-time jobs, beaches, and travel, but a group of dedicated chemical engineering students was hard at work on campus continuing to learn and research.",
        "Among them were UIC’s Chem-E-Car team fellowship awardees Alejandro Gutierrez, Nadia Nikolova, and William Rawson. The three engineers have continued to work on the team’s Hot Rod car, whose performance in the regional competition qualified for entry to the nationals, which will take place in November at the AIChE annual meeting in Orlando, Florida.",
        "The annual event challenges students to create a car that can carry a weight up to 500 grams and travel a precise distance on a rectangular course within two minutes. Students must control how far the car travels by calculating the exact amount of reactants needed for chemical reactions to power it and to shut down the engine at the perfect moment to stop.",
        "Gutierrez said the team is making improvements suggested by faculty advisor Meenesh R. Singh and solving problems identified in the run-up to the regional competition.",
        "For example, the team fixed an axle issue that was causing the car to veer off to the side, developed a new stopping mechanism, improved the car’s batteries, and even installed a small fan on a mini-stir plate to make sure the chemicals are completely mixed.",
        "“It’s a really cool experience because it takes chemical, mechanical, and electrical engineering to create the car,” Nikolova said. “So, it’s not just one engineering field, but it’s combining all these fields together with this team.”",
        "Rawson added the team has been working together on all aspects of the car’s development to make a more cohesive vehicle. In the past, different team members had worked separately on different components of the car and then brought them together in the end.",
        "“The collaboration experience is huge for our careers down the road,” Rawson said. “The team is really fun, but we are also focused on gaining problem solving experience.”",
        "In addition to the Chem-E-Car fellows, a group of 10 chemical engineering students participated in the College of Engineering’s Guaranteed Paid Internship Program (GPIP). The program allows first-year and transfer students who meet eligibility requirements to serve as paid interns during their first summer break.",
        "Here is a roster of this year’s GPIP chemical engineering students and their work assignments:",
        "“The department offers several internships and fellowships for the students who have the chance to work with engineering teams, which helps them get real-life, practical experience enabling an all-around development of chemical engineers,” Berry said.",
        "Nieto, who spent the summer in the Molecular Transports in Nanopores Lab, strongly recommended that other students pursue the program. He worked with Kim on new battery technology, creating lithium aluminum titanium phosphate powder to help increase ion connectivity in the batteries for better output.",
        "“It’s complicated research, but it is very rewarding when you put in a lot of time into studying and then finally move into experiments,” Nieto said. “I think it was really helpful and I got to learn a lot about electric chemistry, which is my favorite subject now.”"
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://ecc.uic.edu/students/freshman-internship-program/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}