{
    "url": "https://engineering.uic.edu/news-stories/high-tech-gel-aids-delivery-of-drugs/",
    "title": "High-tech gel aids delivery of drugs | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Drugs that help prevent the formation of unwanted or harmful proteins are currently being developed to treat a number of diseases, including cancer. The drugs are based on small interfering RNA, or siRNA, which are pieces of nucleic acids that work by interfering with the production of proteins. But getting these drugs to the right target, such as to a tumor, remains challenging because siRNAs can degrade rapidly in the body — making systemic delivery inefficient. They also can have some difficulty entering cells where they do their work.",
        "Eben Alsberg, the Richard and Loan Hill Professor of Bioengineering and Orthopaedics at the University of Illinois at Chicago, and colleagues report on a hydrogel-based carrier that can deliver siRNAs directly to where they are needed. They report their findings in Science Advances.",
        "Other researchers have had some success in linking the siRNA molecules with other materials to form nanoparticles that help to prevent siRNA degradation and help the drugs enter cells. But systemically delivered nanoparticle-incorporated drugs tend to have low rates of reaching targeted cells, necessitating multiple doses to have the desired effect, which increases the risk of negative side effects.",
        "Biologically compatible hydrogels have been used to deliver biologics or drugs directly to specific areas in the body. A drug-infused hydrogel plug or sheet can be placed directly where the drug is needed — say in a joint or at a break in bone, or even injected.",
        "But one problem has been that drugs loaded into hydrogels often diffuse out rapidly to surrounding cells and tissues, providing an initial burst of drug and not much more. The release can be delayed by changing the porosity of the hydrogel, its degradation rate and by tinkering with the affinity of the drug for the hydrogel.",
        "Alsberg together with Matthew Levy, associate professor of biochemistry at Albert Einstein College of Medicine, and their colleagues developed a unique hydrogel strategy that allows for more control over the release of siRNAs over time. By chemically coupling the siRNA to the hydrogel via a linker that can degrade in the body, they can control the release of the drug. When the hydrogel is placed in a water-based environment, such as a biological organism, water breaks the linker between the siRNA and the hydrogel, releasing the drug. In this kind of system, release of the drug is prolonged compared with when the siRNA is only physically trapped within the hydrogel.",
        "“We may be able to use this technology in the future to, for example, prevent the production of certain proteins that are known to promote certain diseases, or to help transform stem cells into cells needed to repair damaged tissue such as bone or cartilage,” Alsberg said.",
        "Cong Truc Huynh of UIC; Minh Khanh Nguyen, Alex Gilewski, and Nicholas Kwon of Case Western University; and Samantha E. Wilner and Keith E. Maier of the Albert Einstein College of Medicine are co-authors on the paper.",
        "This research was supported by funding from the National Institute of Dental and Craniofacial Research (R56DE022376), the National Institute of Arthritis and Musculoskeletal and Skin Diseases (R01AR069564, R01AR066193) the National Cancer Institute (R21CA182330), the Department of Defense Congressionally Directed Medical Research Programs (OR110196) and a Stand Up to Cancer Innovative Research Grant."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}