{
    "url": "https://engineering.uic.edu/news-stories/professor-sybil-derrible-leads-workshop-on-post-disaster-cleanup/",
    "title": "Professor Sybil Derrible leads workshop on post disaster cleanup | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Tornados, earthquakes, wildfires, floods, hurricanes and all types of natural disasters wreak havoc on communities annually in the United States and around the world. In 2018 alone, eight hurricanes hit the Atlantic region and more than 8,000 fires ignited in California. The disasters devastate neighborhoods and lives, while leaving millions of tons of debris in their wake.",
        "Bringing life back to normal for the people affected is a priority after a disaster strikes. But what happens to the debris that needs to be cleaned up? Where does it go? What materials are among the debris?",
        "These are questions Sybil Derrible, an associate professor in CME at UIC, Nazli Yesiller of California Polytechnic State University, and Juyeong Choi of FAMU-FSU College of Engineering, posed to a group of participants when they hosted the “Workshop on Post-Disaster Materials and Environmental Management,” as part of the “Smart City Digital Twin Convergence Conference,” in May in Alexandria, Virginia.",
        "The workshop, which was made possible by grant from the National Science Foundation (NSF) Division of Chemical, Bioengineering, Environmental, and Transport Systems, brought experts from academia, industry, government, private and non-profit agencies together to identify the big problems and questions that need to be answered in an effort to ultimately find solutions.",
        "“Hazardous materials in soil, groundwater and air pose environmental and human health risks,” said Derrible. “Our objective was to bring together experts from across the United States to identify critical research questions with respect to the sustainable management and environmental impacts of the debris and waste generated by disasters, with a focus on debris reuse and recycling.”",
        "The workshop was made up of uniquely qualified cross-disciplinary organizers with complementary expertise, who were exposed to real-world disaster debris problems presented by industry and state and federal government agency participants, including a remote presentation by an industry expert in Japan.",
        "The participants worked hard to identify themes and research questions pertaining to post-disaster materials and environmental management. Four themes with overlapping research questions emerged from the discussion: pre- and post-disaster debris characterization and inventory; recycling/reuse planning and optimization; technology development (for improving recycling/reuse, handling, and monitoring of disaster materials); and business models and market development. Additionally, a broad network of experts was created through the workshop activities, and smaller collaborative groups developed organically through the interactions of the participants.",
        "Multiple groups of participants are already working on a variety of research initiatives directly related to the workshop topic, and publications are underway based on the activities at the workshop.",
        "A journal editorial was published by one of the workshop participants related to potential contributions of green technology research to disaster debris management highlighting the need for interdisciplinary solutions.",
        "The workshop organizers are developing multiple publications based on the workshop results including forum papers in the ASCE Journal of Management in Engineering and in Resources, Conservation and Recycling, and a review article for Nature-Climate Change.",
        "“Several workshop participants plan to include some of the lessons learned from the workshop in research and teaching materials,” said Derrible. “This will bring a future engineers into the conversation, and provides them with the tools to be contribute to future workshops and the growing network of partners.”",
        "Derrible is the director of the Complex and Sustainable Urban Networks (CSUN) laboratory at UIC. Learn more about his research, and find a final report of the conference at https://csun.uic.edu."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://csun.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}