{
    "url": "https://engineering.uic.edu/news-stories/balancing-delay-transmission-rate-and-reliability-in-data-transmission-three-uic-professors-receive-over-1m-nsf-grant-to-benchmark-tradeoffs/",
    "title": "Balancing delay, transmission rate, and reliability in data transmission—three UIC professors receive over $1M NSF grant to benchmark tradeoffs | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Three faculty members in University of Illinois at Chicago’s Electrical and Computer Engineering Department have received a four-year, $1.2 million grant from the National Science Foundation to determine the fundamental tradeoff between delay, transmission rate, and reliability for data transmission in wireless cellular networks. The grant has both an information theory and a communication theory component.",
        "How information is stored and transmitted across wireless networks, and how quickly the transmission of that information occurs, must be prioritized different technologies come online in ever-increasing numbers. If bandwidth is in short supply, who gets what is available, and with what consequences? A delay with a self-driving car can be catastrophic; a delay in downloading a cat video from YouTube may be frustrating, but it’s tolerable.",
        "Natasha Devroye, associate professor and director of undergraduate studies, Besma Smida, associate professor, and Daniela Tuninetti, professor and interim department head, are co-principal investigators on the project, “CIF: Medium: Delay, reliability, rate tradeoffs in broadcast channels.”",
        "They are members of the Networks Information Communications and Engineering Systems (NICEST) Laboratory, which focuses on information and data processing, networking, communication and storage over networks.",
        "As greater demands are placed on wireless networks, and an increasing number of delay- and reliability- sensitive technologies are coming online, continuing to favor high speed for all applications isn’t sustainable.",
        "“There is a shift in what we communicate, and what kind of requirements these new communication paradigms are going to impose,” Smida said.",
        "Latency is the amount of time it takes from making a request, or sending a packet of information to when you start seeing a result—when that information reaches you. Latency, or delay, is present any time information is sent, and is more problematic in wireless communications. Think about downloading a movie, and the annoying spinning wheel icon when download speed is slow. Latency is extremely critical in other applications, such as when a doctor is performing robotic tele-surgery.",
        "The amount of latency is affected by the physical distance the data needs to travel, the number of network devices that have to be crossed, and the performance of each of the devices in the network. There may also be network congestion, and packets of data can be lost or dropped, resulting in retransmission.",
        "While we all use wireless networks to transmit voice, data, SMS and videos, more technologies are coming online, and they have very different requirements. They include drones, self-driving cars, and real-time energy management.",
        "“If it’s video, it doesn’t matter if it’s real-time communication; a 100-millisecond or more delay is still okay. The real issue is if you want to run a machine or fly drones. That’s when you need very small latency, less than what a human ear can even detect,” Smida said, noting that a person can detect a delay as short as 10 milliseconds.",
        "Constraints will always exist in communications. Some have to do with the nature of the communication medium. Finding the best possible communication strategy, or determining the boundaries of that strategy in a given environment, is also part of what the group is examining.",
        "“It’s easier to communicate if nothing moves than when you’re mobile. The faster you go, the more challenging the communication becomes. But we can’t tell cars not to move,” Tuninetti said, giving an example of those boundaries. “So those are things we need to live with.”",
        "Establishing a framework to understand the fundamental tradeoffs for each type of technology—those that exist, and those that have yet to come online—is the goal.",
        "“You can’t have everything. If you want short latency, you give on something else,” Devroye said. “And what do you give on? Maybe reliability, your packet won’t get there by the deadline, or maybe speed. So, we are really trying to bound how fast you should be able to go given constraints on reliability or latency. It’s a tradeoff, and they are all intertwined.”",
        "The results will provide fundamental performance benchmarks and prototype algorithms for industries working toward these ambitious goals.",
        "“It’s going to drive choices for designing the communication networks of the future. It’s important to quantify what is the best possible performance in order to build the best technology,” Tuninetti said.",
        "The grant will fund three PhD students for four years."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://nicest.lab.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}