{
    "url": "https://engineering.uic.edu/news-stories/mie-professor-awarded-nsf-grant-to-research-the-physics-of-aircraft-contrails/",
    "title": "MIE professor awarded NSF grant to research the physics of aircraft contrails | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Look in the sky and you will probably see condensation trails (contrails) behind airplanes. Contrails are ice crystals generated by water exhaust from aircraft engines and they are the most uncertain aviation contributions to the Earth-radiation budget, which is the balance of energy entering, reflected, absorbed, and emitted by Earth.",
        "In an effort to learn more about the physics of contrails and their impact on the Earth, Roberto Paoli, a research assistant professor in mechanical and industrial engineering, is launching a project that aims to model the early-phase formation of contrails. Paoli received a new National Science Foundation (NSF) grant to study, research and model aircraft contrails. He is partnering with UIC Computer Science Associate Professor Liz Marai on the project titled “High-performance Computing and Data-driven Modeling of Aircraft Contrails,” which totals $446,410 and last three years.",
        "“Although the contrails initially appear to be linear, they can spread under favorable atmospheric conditions and form cirrus clouds that can persist for hours and eventually become almost indistinguishable from natural cirrus clouds,” said Paoli. “Modeling this complex multi-physics problem is challenging because the different physical processes interact at different time and spatial scales.”",
        "The researchers plan to focus on the challenge by using high-resolution numerical simulations that rely extensively on high-performance computing, which will be completed at Argonne National Laboratory where Paoli has an appointment, and advanced visualization techniques to help identify to capture and model contrail features.",
        "“The main focus of the modeling is on the early phase of contrails where the presence of large-scale motions generated by the aircraft wake vortices and the small-scale perturbations induced by the jet and wake turbulence interact,” he said. “The contrail parameterization results will support the integration of emissions into global atmospheric models. The sensitivity of contrail properties to the initial particle emissions may suggest potential mitigation strategies.”",
        "The objective is to perform the first fully three-dimensional spatial Large-Eddy Simulations (LES) – a mathematical model for turbulence used in computational fluid dynamics – of contrail formation that include the full aircraft geometry and to develop an accurate data-set of contrail evolution in the jet and vortex regime.",
        "“We want to identify the three-dimensional contrail features and fit parameters by journaling the simulation workflow using advanced visualization techniques,” said Paoli. “We’re going to reduce the large dimensionality of the generated data-set and provide a general and accurate model of contrail structure at the end of the jet regime using artificial neural networks based on high-fidelity data training.”",
        "Additionally, he plans to reconstruct contrail global properties over the full time evolution using statistically inspired methods into global models. The techniques will enable contrail parameterizations that are consistent with the physical assumptions and the conservation equations used in global atmospheric models.",
        "The outcome of this research will provide climate scientists with accurate data of the initial conditions that can be used to understand the impact of contrails at any given time from when they are emitted.",
        "Learn more about the professor at Paoli profile."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://mie.uic.edu/profiles/roberto-paoli/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}