{
    "url": "https://engineering.uic.edu/news-stories/clearing-up-the-dark-side-of-artificial-leaves/",
    "title": "Clearing up the ‘dark side’ of artificial leaves | College of Engineering | University of Illinois at Chicago",
    "text": [
        "While artificial leaves hold promise as a way to take carbon dioxide — a potent greenhouse gas — out of the atmosphere, there is a “dark side to artificial leaves that has gone overlooked for more than a decade,” according to Meenesh Singh, assistant professor of chemical engineering in the University of Illinois at Chicago College of Engineering.",
        "Artificial leaves work by converting carbon dioxide to fuel and water to oxygen using energy from the sun. The two processes take place separately and simultaneously on either side of a photovoltaic cell: the oxygen is produced on the “positive” side of the cell and fuel is produced on the “negative” side.",
        "Singh, who is the corresponding author of a new paper in ACS Applied Energy Materials, says that current artificial leaves are wildly inefficient. They wind up converting only 15% of the carbon dioxide they take in into fuel and release 85% of it, along with oxygen gas, back to the atmosphere.",
        "“The artificial leaves we have today aren’t really ready to fulfill their promise as carbon capture solutions because they don’t capture all that much carbon dioxide, and in fact, release the majority of the carbon dioxide gas they take in from the oxygen-evolving ‘positive’ side,” Singh said.",
        "The reason artificial leaves release so much carbon dioxide back to the atmosphere has to do with where the carbon dioxide goes in the photoelectrochemical cell.",
        "When carbon dioxide enters the cell, it travels through the cell’s electrolyte. In the electrolyte, the dissolved carbon dioxide turns into bicarbonate anions, which travel across the membrane to the “positive” side of the cell, where oxygen is produced. This side of the cell tends to be very acidic due to splitting of water into oxygen gas and protons. When the bicarbonate anions interact with the acidic electrolyte at the anodic side of the cell, carbon dioxide is produced and released with oxygen gas.",
        "Singh noted that a similar phenomenon of carbon dioxide release occurring in the artificial leaf can be seen in the kitchen when baking soda (bicarbonate solution) is mixed with vinegar (acidic solution) to release a fizz of carbon dioxide bubbles.",
        "To solve this problem, Singh, in collaboration with Caltech researchers Meng Lin, Lihao Han and Chengxiang Xiang, devised a system that uses a bipolar membrane that prevents the bicarbonate anions from reaching the “positive” side of the leaf while neutralizing the proton produced.",
        "The membrane placed in between the two sides of the photoelectrochemical cell keeps the carbon dioxide away from the acidic side of the leaf, preventing its escape back into the atmosphere. Artificial leaves using this specialized membrane turned 60% to 70% of the carbon dioxide they took in into fuel.",
        "“Our finding represents another step in making artificial leaves a reality by increasing utilization of carbon dioxide,” Singh said.",
        "Earlier this year, Singh and colleagues published a paper in ACS Sustainable Chemistry & Engineering, where they proposed a solution to another problem with artificial leaves: current models use pressurized carbon dioxide from tanks, not the atmosphere.",
        "He proposed another specialized membrane that would allow the leaves to capture carbon dioxide directly from the atmosphere. Singh explains that this idea, together with the findings reported in this current publication on using more of the carbon dioxide captures, should help make artificial leaf technology fully implementable."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}