{
    "url": "https://engineering.uic.edu/news-stories/che-moves-to-new-home-in-the-engineering-innovation-building/",
    "title": "ChE moves to new home in the Engineering Innovation Building | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Chemical engineering is coming home to UIC’s east campus.",
        "The department, one of the primary occupants of the new Engineering Innovation Building, is closing out its stay in a building east of the Dan Ryan Expressway. The department and the university will celebrate this homecoming with a ribbon-cutting event on July 22.",
        "The new 57,500-square-foot building at the corner of Morgan and Taylor Streets features vibration-damped nanotechnology-labs, biomedical research rooms, a highly attuned darkroom for complex fluid imaging, and molecular engineering research-labs. Vikas Berry, professor and department head of chemical engineering, said the EIB will expand the department’s research space by at least 40 percent.",
        "“The new building is going to have a transformative impact on our education activities as well as our research productivity,” Berry said. “This move will bring students right to the heart of the science and engineering part of campus at UIC.”",
        "The EIB has a classroom that allows students to learn about chemical engineering concepts while they observe related work taking place in the department’s adjacent unit-operations lab. These spaces will provide a great learning environment, especially for the chemical engineering laboratory coursework, said Alan Zdunek, the director of undergraduate studies and a clinical assistant professor. He said it will “allow the students and other visitors to see what is happening in the lab and help them understand what chemical engineering is about.”",
        "“The working environment will be better,” he added. “and I think that will make the students more passionate about trying to learn.”",
        "Gang Cheng, an associate professor and the director of graduate studies, said the EIB’s state-of-the-art facilities and central location will enhance graduate students’ research productivity. It also will help them to fully integrate with the main campus, he said.",
        "In addition to the positive effects the new building will have on students, Berry expects it to transform UIC chemical engineering research. Faculty will have the resources to expand their work in environmental engineering and sustainability, molecular and nanoscale technologies, energy research, biomedical systems, and complex fluids.",
        "“The new building is designed to accommodate research at molecular and nanoscale,” Berry explained. “It will allow us to do research with biomolecules and biological cells, develop new energy systems, and to study complex fluid phenomena.”",
        "Bringing the department in proximity to the rest of UIC stands to foster interdisciplinary collaboration, too. Berry described the campus a reservoir of great educators, strong research groups, and resources that now will be seamlessly connected to chemical engineering. “The department already has world-class talent,” he said. “and now it will have state-of-the-art facilities.”",
        "The EIB was designed by Dewberry architects and built by Berglund Construction and is expected to be LEED Gold certified later this year.",
        "You can learn more about the new building at https://engineering.uic.edu/about/facilities/eib/ and more about the chemical engineering department at https://che.uic.edu/."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://engineering.uic.edu/about/facilities/eib/",
        "https://che.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}