{
    "url": "https://engineering.uic.edu/news-stories/bioengineering-phd-student-wins-young-investigator-award-for-innovative-imaging-research-in-parkinsons-disease/",
    "title": "Bioengineering PhD student wins Young Investigator Award for innovative imaging research in Parkinson’s disease | College of Engineering | University of Illinois at Chicago",
    "text": [
        "UIC Bioengineering Department PhD student Zheng Zhong recently won an award for his innovative imaging work with Parkinson’s disease patients at the Center for Magnetic Resonance Research at UIC. Zhong and his colleagues revealed distinct changes to a particular area in the brain stem of patients with Parkinson’s, compared with healthy people who also participated in the study.",
        "The First Place Young Investigator Award was presented to Zhong by the Overseas Chinese Society for Magnetic Resonance in Medicine at the International Society for Magnetic Resonance in Medicine annual meeting in Montreal, Canada.",
        "“For this award, I would like to thank my boss [UIC Professor X. Joe Zhou], who is my mentor and has really taught me a lot and helped guide my research direction. I also want to thank all of my colleagues and collaborators,” Zhong said. “It is an honor to have this award. It’s not easy to win in this highly competitive field.”",
        "The work presented at the conference was also described in a paper titled “High-Spatial-Resolution Diffusion MRI in Parkinson’s Disease: Lateral Asynmmetry of the Substantia Nigra” that was published earlier this year in Radiology, – the flagship journal in the area of radiology and imaging sciences.",
        "Zhong and colleagues at Rush University Medical Center studied 27 patients with Parkinson’s and 27 people of the same age group. Together with his co-authors, Zhong developed a new technique that allows researchers to achieve sub-millimeter resolution in quantitative diffusion magnetic resonance imaging (MRI).",
        "Previous research on Parkinson’s has shown that patients with the disease experience neuron loss in the substantia nigra region of the brain stem. Zhong’s work using MRI demonstrated that this neuron loss can be asymmetric: Parkinson’s patients experienced loss on one side of the substantia nigra in contrast with the healthy study participants.",
        "“This region is very important in controlling movement,” Zhong said. “So, if the neurons are dying asymmetrically, it could be the reason why Parkinson’s disease patients typically start showing symptoms on one side first.”",
        "He added the work and imaging technique could be used to help diagnose Parkinson’s patients earlier and to provide doctors crucial information about the disease.",
        "“Although we have studied Parkinson’s for several decades, the root reason or cause is still unknown to us. We are still trying very hard to understand this disease,” Zhong said. “From our side, we are trying to use imaging modalities, especially MRI, to see if we can help diagnose Parkinson’s with imaging biomarkers and in this study, we developed a new model to give us some parameters to look at.”",
        "This study also was able to provide the first visual evidence that neuron loss is substantially different between the right and left sides of the brain stem in Parkinson’s patients, which is something that scientists have long speculated, according to Zhou. Zhong added this difference may be related to the dominant hand of the patient, but more research is still needed.",
        "Zhou said he was thrilled about Zhong’s award. “We always say, ‘we are the best’ [at UIC], and this is a very clear demonstration that our work has been recognized by the field and that has placed us in the top tier.”",
        "Zhong noted that the project is still ongoing and the team has collected more data from the participants. They are also planning on investigating the sub-categories within Parkinson’s to see if they can identify differences using their new technique.",
        "“I believe as our understanding of this disease goes deeper we will be able to better to control it,” Zhong said.",
        "Zhong’s work is a result of collaboration between his group at UIC and a research group at Rush University led at the time by Jennifer Goldman, a neurologist and leading expert in movement disorders who also is an adjunct professor in bioengineering at UIC. Goldman is currently the section chief for Parkinson’s Disease and Movement Disorders Rehabilitation at the Shirley Ryan Abilitylab. Clinical support was provided by Douglas Merkitch and Jiaxuan Zhang; model development and statistical analysis were performed by M. Muge Karaman, an assistant professor in bioengineering at UIC."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}