{
    "url": "https://engineering.uic.edu/news-stories/uic-abbvie-scientists-develop-a-novel-device-to-screen-advanced-crystalline-materials/",
    "title": "UIC, AbbVie scientists develop a novel device to screen advanced crystalline materials | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Researchers at the University of Illinois at Chicago and AbbVie Inc. have developed a novel device that will help scientists and pharmaceutical companies more effectively screen and test formation of drug substance — active pharmaceutical ingredient (API).",
        "Meenesh R. Singh, an assistant professor with UIC’s chemical engineering department, along with UIC graduate student Paria Coliaie and AbbVie scientists Manish S. Kelkar and Nandkishor K. Nere, developed a controlled microfluidic crystallization device to improve the screening process that pharmaceutical companies use to identify the most stable crystalline form of APIs and to scale up the crystallization of stable forms.",
        "The work, titled “Continuous-Flow, Well-Mixed, Microfluidic Crystallization Device for Screening of Polymorphs, Morphologies, and Crystallization Kinetics at Controlled Supersaturation,” was published in Royal Society of Chemistry’s peer-reviewed journal Lab on a Chip.",
        "Singh referred to a UK Office of Health Economics report indicating that it currently takes around 10 years and billions of dollars to bring a new drug to market after a molecule is identified to treat a disease. A significant portion of that decade is invested in process development, along with ongoing clinical trials, where scientists screen the different polymorphic forms of the APIs and develop robust processes to manufacture the stable form with the acceptable physical properties to turn that into pills or tablets.",
        "The industry currently uses microtiter plates and droplet-based microfluidic devices to screen these different forms, but Singh noted these devices run into problems due to depletion of supersaturation, which is a driver for crystallization. He explained that as the nucleation process occurs and the crystals grow in the microtiter plate, they use up the initial supply of the API causing supersaturation to deplete and bias the screening results. The incomplete understanding of the polymorphic landscape of API obtained from the microtiter plates poses a huge risk when companies move to scale up and technology transfer to manufacture APIs in larger vessels called crystallizers and subsequent process equipment such as filters and dryers.",
        "To combat this issue, the investigators created a continuous flow, well mixed, microfluidic device called cyclone mixer that consists of small valves with multiple inlets that work together to create a vortex in the device to ensure the solution is well mixed and keeps the supersaturation constant by continuing to supply the device with an API solution. The API crystals are captured in the cyclone mixer, and the device automatically shuts down after enough of the API has been created.",
        "“What we have done is develop a screening device that simulates conditions of an industrial crystallizer,” Coliaie said. “Most of the devices currently on the market see the supersaturation decrease with the time that may not provide a complete picture of crystal form landscape.”",
        "Kelkar notes that this device is easy to fabricate using a commercial 3D printer. “One 3D printed device costs just a few cents, which offers us a lot of flexibility to make changes in the design to screen salts, hydrates, and solvates of the crystalline APIs.”",
        "As described in their research paper, the investigators tested the device to screen anthranilic acid, whose derivates are anti-inflammatory drugs. The device can also be used to screen agrochemicals, semiconductors, catalysts, and other specialty chemicals for other industries in a more consistent and stable manner than is currently available.",
        "Singh added the new device can also help pharmaceutical companies to move from batch-based production to continuous manufacturing, which the FDA hopes to spur advancements in robust API manufacturing at lower costs. Nere noted the device itself is actually a mini prototype of a continuous manufacturing model and will allow companies to see exactly how their APIs will crystallize under those conditions.",
        "“The time and money required for an API process development and manufacture are immense. Robust manufacturing of quality APIs is essential for the timely delivery of drugs to patients,” Nere said.",
        "“We have developed a novel microfluidic device that can quickly and automatically screen various forms of APIs at controlled conditions, which will increase the efficiency of manufacturing process development,” Singh added.",
        "Read more about Singh’s lab here https://www.singh-lab.com/."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}