{
    "url": "https://engineering.uic.edu/news-stories/uic-bioengineering-researchers-receive-nsf-grant-to-support-elastography-noninvasive-diagnostic-research/",
    "title": "UIC bioengineering researchers receive NSF grant to support elastography noninvasive diagnostic research | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Richard and Loan Hill Bioengineering Department Head and Professor Thomas Royston and Assistant Professor Dieter Klatt received a three-year National Science Foundation grant titled “Transformation Elastography.” The $406,094 grant will help Royston and Klatt develop a novel strategy for analyzing mechanical wave motion in complex materials.",
        "Elastography is a noninvasive technique to measure wave motion that is induced by sound and vibration, which is then measured with optical; acoustic, such as ultrasound; or magnetic resonance imaging methods to map the mechanical properties of a material. Changes in mechanical properties, such as stiffness and viscosity, will alter how waves travel through the material. Such changes have been proven to correlate with various diseases of and injuries to multiple organs and regions within the body.",
        "However, to create an accurate map of the interior mechanical properties, one must know how to interpret the wave motion measurements, which is known as the reconstruction problem.",
        "Reconstruction is easier to do in isotropic materials that have the same mechanical properties regardless of the direction of polarization and direction of propagation of the wave, as compared to more complicated anisotropic materials with properties that vary with polarization and propagation directions, such as brain white matter laden with aligned fiber tracts or skeletal muscle with aligned fiber structure.",
        "Royston and his PhD student, Martina Guidetti, had previously shown in 2018 and 2019 they were able to use a novel approach of, essentially, distorting spatial dimensions, such that the anisotropic material appears isotropic in the reconstruction process. The challenge then is to identify what distortion makes this happen and then to use that distortion to determine the anisotropic properties. NSF support will help them extend this concept from simple two-dimensional reconstructions to more complex three-dimensional problems.",
        "“Extending elastography to anisotropic materials is essential to advance its application in geophysical exploration, and its application in medical diagnosis of diseases of the brain, skeletal muscle, heart, and other organs or tissue regions with organized fiber structure and for which changes in stiffness and viscosity have been proven to correlate with disease and injury,” the researchers wrote in the grant abstract.",
        "“I think inspiration for this novel approach came to me from a few sources. As an undergraduate in freshman physics so many years ago, I remembered learning about Einstein’s special theory of relativity, which essentially uses a space-time distortion to reconcile the fact that the speed of light is always the same no matter what reference frame you are in, how fast you are moving in any particular direction,” Royston said. “To me this was absolutely mind-boggling, highlighting Einstein’s ability to completely think outside of the box, or I guess change the dimensions of the box in this case. While working out the details of our approach, I also thought about my brother, a theoretical physicist who is an expert in string theory, who says with some authority that ‘it’s all about vibrations’. I’m sure I’ll look to my brother and Einstein, perhaps the general theory of relativity, for further inspiration as this work continues.”",
        "Learn more about Royston’s research at http://acoustics.mie.uic.edu/.",
        "Learn more about Klatt’s research at https://meml.lab.uic.edu/."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "http://acoustics.mie.uic.edu/",
        "https://meml.lab.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}