{
    "url": "https://engineering.uic.edu/news-stories/uic-host-to-army-industry-academia-event-focused-on-unmanned-aircraft/",
    "title": "UIC host to Army-industry-academia event focused on unmanned aircraft | College of Engineering | University of Illinois at Chicago",
    "text": [
        "The University of Illinois at Chicago (UIC) hosted the first Center for UAS Propulsion (CUP) Industry-Academia Connection Days in May, a workshop connecting academia, industry, and government agencies.",
        "The three-day workshop, supported by the UIC-ARL Collaborative and facilitated by UIC’s College of Engineering and researchers from the U.S. Army Combat Capabilities Development’s Army Research Laboratory (ARL), focused on unmanned aircraft system power and propulsion. It was the first workshop held in the ARL Central region.",
        "“The Army Research Lab is a premiere lab, working on fundamental research,” said Mitra Dutta, distinguished professor in the department of electrical and computer engineering at UIC. “This partnership allows them to bring in research as quickly as possible from academia and transition to industry.”",
        "The workshop also provided an opportunity to highlight the role of UIC as a major research institution. Ken Brezinsky, professor in the department of mechanical and industrial engineering, and director of the High Pressure Shock Tube Lab at UIC, welcomed the attention the CUP Industry-Academia Days brought to the university.",
        "“Visits to my laboratory, and that of Patrick Lynch, show how active we are in work related to the workshop, and how active we are in funded research activities involving students using advanced experimental facilities,” Brezinsky said. “In fact, student participation in the workshop was key to making it a success as well as providing the students with opportunities to meet other researchers and potential employers.”",
        "Most of the Army Research Labs are located on the East Coast, but these new collaborations with industry and academic partners allow the ARL to establish a physical presence across the U.S. A Southern hub is located in Texas, and an ARL West hub was established in California. The hope is that new, formative research in a variety of areas can be integrated into the Army.",
        "Dutta said UIC is involved in several areas of research with ARL: multifuel solutions, high power, high frequency electronics, machine learning, artificial intelligence, and cybersecurity.",
        "“Drones need jet fuel. Just imagine a battlefield situation,” Dutta said. “They have tanks, they have Humvees, they have drones, and for each vehicle you have to carry a different type of fuel. So, the Army is very interested in a multi-fuel solution.”",
        "Lynch, an assistant professor of mechanical and industrial engineering at UIC, will be working on a few of the ARL projects.",
        "“The multi-fuel capable hybrid propulsion program has joint faculty appointees, post-docs and graduate students at different universities and laboratories in the Midwest supporting this project,” Lynch said. “There is a lack of an industrial base in the United States for the propulsion for these UA systems, so the area is ripe for small business innovation as well.”",
        "At the workshop, participants learned about current technologies in use by the military and the technical challenges the Army faces in the areas of power and propulsion.",
        "The workshop had sessions led by experts from industry, academia, and the military, and included non-conventional engines, small gas turbine engines, power and thermal management for unmanned aerial systems (UAS), thermal management, and hybrid electric car and aircraft.",
        "Mike Kweon, ARL’s versatile tactical power and propulsion essential research program manager and the Army’s lead for the Center for UAS Propulsion, was very positive about the workshop.",
        "“The objective of this event was to develop strong partnerships among industry, academia and government to develop power and propulsion technologies for future UAS that will deliver more reach, lethality and protection for the multi-domain operations and for the future Soldiers,” Kweon said. “I am thrilled to watch the active interactions and to feel the energy among them during the entire event.”",
        "The workshop attracted nearly 150 participants from universities including UIC, University of Illinois, University of Wisconsin-Madison, Northwestern, University of North Texas, Texas A&M, MIT, Georgia Tech, and Purdue; government entities including ARL, Combat Capabilities Development Command, Aviation, Missile Center, Unmanned Aerial Systems, Argonne National Lab, Sandia National Lab, and Lawrence Livermore National Lab; and industry leaders including Electric Power System, Poly Plus, GE, Honeywell, Bell, DuPont, Honeywell, and Cummins."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}