{
    "url": "https://engineering.uic.edu/news-stories/cme-professor-students-seek-solutions-to-urban-flooding-issues/",
    "title": "CME professor, students seek solutions to urban flooding issues | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Spring showers bring more than flowers. In many parts of the Chicago region they bring flooded basements. To help alleviate this problem, CME Clinical Assistant Professor Joseph Schulenberg and a team of UIC students are working with a community group in Cicero and Berwyn, Illinois, to find a solution.",
        "Schulenberg was asked to help the grassroots organization Ixchel, which is named after a Mayan goddess, on a solution. They also are working with the American Geophysical Union (AGU) which serves as project manager to address the flooding.",
        "“I’ve met with AGU and an outside consultant, who worked with the Center for Neighborhood Technology, and they’ve done studies on urban flooding,” said Schulenberg.",
        "Apart from the physical flooding, there is an environmental justice component that is being investigated, too.",
        "“The communities are very aware of disparities and how they are treated versus other communities,” said Schulenberg. “They want to know ‘Are our basements flooding more than more affluent communities or communities of different color?’. This is a significant portion of the project. When we look at the impacts, we look at other communities to see how things are shaking out.”",
        "The team is reviewing a list of communities that were recently modeled by the Corps of Engineers and they are all potentially benefiting from the tunnel and reservoir plan (TARP), which are supposed to hold the storm water. Part of the impetus of these megaprojects was addressing basement flooding. Now, they are looking at how well they are doing, and, if they are not doing very well, what can be done to make them work better.",
        "One of the major challenges is making sure everyone understands the terminology. To ensure everyone is on the same page, Schulenberg is acting as a translator between the people who are doing the modeling and the community.",
        "“I can help translate technical reports and rules so the community can better understand them,” he said.",
        "In addition to helping the community, Schulenberg is using the problem as an example in the classroom.",
        "“The problem of sewer modeling or sewer design is something straight out of a textbook,” he said. “We could take a block and do the hand calculations just to see if they are sized appropriately. I always try to incorporate the things I do into classes.”",
        "He also enlisted the help of students who researched the project and developed potential solutions as part of their senior design expo project, which was simply called “Preventing Basement Flooding in Cicero/Berwyn.”",
        "“Essentially, they are trying to figure out the solutions to the flooding problems,” he said. “They are learning the language of the field, working with the community, and potentially do something that has a real-world benefit.”",
        "The team of Ryan Nerada, Hardy Adjunta, Chen Enpei, Zhao Liang, and Damian Opiola had the opportunity to work on a real-life project with actual clients.",
        "While the TARP is already in effect the flooding continues due to the aging sewer infrastructure. To alleviate the problem, the students proposed an overhead sewer system aided with check valves, as well as incorporating residential green infrastructure.",
        "According to their proposal, “overhead sewers have been proven to reduce and prevent sewer backup by raising the water head needed for sewage to enter the building. A check valve restricts the flow in a pipe to one direction.”",
        "Another objective would be to reduce the inflow of stormwater into the combined sewer system. The team is suggesting green solutions like rain gardens, vertical rain gardens, and retention areas for infiltration. The captured rainwater relieves the underground storm sewer system and infiltrates to the ground water table. These objectives are aimed to reduce the inflow to the sewers, and to prevent any possible backups.",
        "“It’s certainly a problem that I think that we can help solve to some degree,” said Schulenberg. “We may not have all the solutions, and the solutions may be a lot of money. But at least I can help with the communication, the diagnosis of the problem, and the actual solution.”",
        "Learn more about Professor Schulenberg at https://cme.uic.edu/profiles/joseph/."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://cme.uic.edu/profiles/joseph/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}