{
    "url": "https://engineering.uic.edu/news-stories/three-phd-candidates-standout-at-annual-poster-competition/",
    "title": "Three PhD candidates standout at annual poster competition | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Three PhD candidates in the civil engineering program impressed the judges to win the top spots during the annual Christopher Burke and Susan S. Burke Civil Engineering Poster Competition held in the Department of Civil and Materials Engineering (CME) at UIC in May.",
        "Mohammed Mujtaba Atif won first-place and was awarded $1,500 for his poster titled “Meshfree Modeling of Impact and Penetration into Soil.”",
        "Researching the penetration into the granular media represents a class of complex physical problems, and it has a significance in military defense and commercial applications, which includes subsurface investigation of soil and rock, particularly at inaccessible locations and extraterrestrial surfaces, planetary impact, installation of deep-sea anchors and foundations, nuclear waste disposal, mining, and aircraft landing studies.",
        "Atif is working under the direction of Assistant Professor Sheng Wei Chi in the Computational Mechanics laboratory at UIC and holds him in high regard.",
        "“He is the main pillar of my research structure; he was always there to help and discuss the issues related to the problems,” Atif said. “He initially made sure that I have developed all the knowledge required to breakthrough on the focused research area. He mentored me to think in a researching way, he taught me how to approach a solution even though if it is dark area. He has an astute mind, which ensures that I stay on the right path for solving the problem.”"rough when a family member is in the hospital,” Faiola said. “Research shows this is related to a lack of transparency and information. Families visit a patient when they can if they are local, but fear comes from a lack of information.”",
        "Faiola explained that the app is not engaged whatsoever with an electronic medical record; instead a patient’s family receives a code, which connects patients and family members. Qualitative data on about eight or 10 measures such as blood pressure, sleep, temperature, and medication, for example, are relayed: is the patient normal, above normal, or below normal? A chat function allows for texts to be sent back and forth between nurses and family members.",
        "“Minh Hoang’s great work at building the technology of two (interconnected) mobile apps and the back end in the cloud was amazing,” Faiola said. “Dani Bergey’s creative mobile interface design provided an outstanding user interface for ICU families and clinicians,” he added.",
        "Hoang, who first heard Faiola speak in a human augmentics class earlier this year, found out he was looking for help with the app and followed up with him.",
        "“The most challenging thing for me was how to make the app. We had two apps: one for the hospital side and one for the user, and we had to figure out how to make them talk to each other,” Hoang said.",
        "Hoang completed his undergraduate work in Japan and came to UIC because it was one of a handful of universities focused on human-computer interaction. Now, Hoang wants to continue with this work in the healthcare arena.",
        "He plans to stay on with Faiola’s team as the group tests the app first with nurses and then with patients. Hoang also said they may broaden the topic and look at additional technologies in the healthcare setting.",
        "“I’m very happy with the award and to be working on this project,” Hoang said.",
        "You can learn more about the app, FAMmCare, here."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}