{
    "url": "https://engineering.uic.edu/news-stories/graduate-student-wins-best-student-paper-award-at-international-conference/",
    "title": "Graduate student wins best student paper award at international conference | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Raksha Rai, a graduate research assistant in the Geotechnical and Geoenvironmental Engineering Laboratory at UIC, received the Best Paper Award for the paper “Methanotrophic Methane Oxidation in New Biochemical Landfill Cover Systems” during the Journal of Solid Waste Technology and Management’s 34th International Conference in Annapolis, Maryland.",
        "Unfortunately, Rai couldn’t attend the conference as she was diligently working in the lab and preparing for her thesis defense. CME Professor Krishna Reddy, who she is working under, accepted the award on her behalf.",
        "“Her work is quite interesting. She is working on developing an ambitious ‘zero emissions cover’ for landfills, which is a cover system that will not allow any emissions from landfills emitted into atmosphere,” said Reddy. “She’s converting methane into carbon dioxide and carbon dioxide into carbonate minerals. It sounds simple, but she has to engineer chemistry and biology simultaneously to achieve this. She is using advanced microbial characterization tools to identify and assess microbes and engineer the cover system on a fundamental basis.”",
        "“It was a total surprise and I was really honored when [Reddy] informed me as being selected as the Best Student Paper award amongst many other students from different countries,” she said as she lauded the professor.",
        "“Professor Reddy has been really supportive of my work from the very beginning of my research,” she said. “He provided all the resources I needed for the research, guided me, and was always available to give me input whenever I was stuck in middle of my research.”",
        "The conference is an annual event where researchers, educators, government officials, consultants, managers, community leaders, and others meet to present and discuss topics related to all aspects of solid waste technology and management.",
        "The Journal of Solid Waste Technology and Management is an international peer-reviewed journal covering landfill, recycling, waste-to-energy, waste reduction, policy and economics, composting, waste collection and transfer, municipal waste, industrial waste, residual waste, and other waste management and technology subjects. It is published quarterly by the Widener University School of Engineering, and supported by a distinguished international editorial board.",
        "Rai’s decision to research environmental engineering came from a personal perspective that hits close to home.",
        "“I saw a need for environmental engineer in my country where disposal of waste is a huge problem,” exclaimed Rai. “Even as an undergrad I have been working on reusing the waste material in civil engineering applications.”",
        "She has three years of experience in the steel industry where she gained first-hand knowledge about the challenges associated with the disposal of industrial waste. Her background and personal connection to environmental engineering made her the perfect candidate to perform research in Reddy’s lab.",
        "“I was really fortunate when I got a chance to work with Professor Reddy on his NSF project where he was using the application of waste material (Slag) from steel industries in landfill covers to mitigate GHG emissions,” she said. “I am also involved working with another research student in Professor Reddy’s lab on one of his remediation projects.”",
        "Rai is slated to defend her thesis in May, and her goal after graduation is to gain additional hands-on work experience and build her expertise in the field of geoenvironmental engineering.",
        "Reddy is the director of the Sustainable Engineering Research Laboratory and the Geotechnical & Geoenvironmental Engineering Laboratory at UIC. Learn more about his research at https://gagel.lab.uic.edu."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://gagel.lab.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}