{
    "url": "https://engineering.uic.edu/news-stories/uic-chemical-engineering-phd-candidate-receives-nsf-graduate-fellowship-to-study-2d-nanomaterial-gels-inks/",
    "title": "UIC chemical engineering PhD candidate receives NSF-Graduate Fellowship to study 2D nanomaterial gels, inks | College of Engineering | University of Illinois at Chicago",
    "text": [
        "University of Illinois at Chicago PhD candidate Deisy Cristina Carvalho Fernandes is breaking through different dimensions with her research on gels and inks made of two-dimensional (2D) nanomaterials. To further her work, Carvalho Fernandes recently flew across the Atlantic Ocean to start the second half of a research fellowship in France, where she is working with a unique three-dimensional (3D) printer.",
        "The three-month stint in France is the second part of her National Science Foundation’s Graduate Research Opportunities Worldwide (GROW) program, which included a first stint from September 2018 through December 2018, and the second started in March and will end in early June. Carvalho Fernandes is working with University of Bordeaux Professor Philippe Poulin in the Centre de Recherche Paul Pascal (CRPP) national laboratory at the university.",
        "Carvalho Fernandes is researching how to 3D print 2D graphene in the form of gels and inks. Her research could have a large impact on the graphene field because current manufacturing techniques require the graphene be mixed with a plastic, which can affect the properties of graphene.",
        "“The graphene gel research is focused on retaining the quality of the graphene in the gel,” Carvalho Fernandes said.",
        "“Deisy is a hard-working, focused PhD student, who is studying the electronic transport and optoelectronic properties of 3D-printed nanocomposites,” Associate Professor and Department Head Vikas Berry said. “She is being trained at the University of Bordeaux in France on the 3D printing of graphene gels through the NSF-GROW program. After making these gels in France, she will then test their properties here at UIC.”",
        "Amongst other awards, including a spot in the Passage Program and the Bridge to Doctorate Fellowship, Carvalho Fernandes won the NSF Graduate Research Fellowship ($138,000), an NSF program that recognizes and supports outstanding graduate students in STEM disciplines.",
        "Carvalho Fernandes, who grew up in Brazil, expects to graduate next summer. She completed her undergraduate work in UIC’s Chemical Engineering Department.",
        "“This is a great experience for a UIC student, where Deisy is bringing two groups that are an ocean apart together – towards an impactful collaboration that can revolutionize ‘on-demand 3D printed electronic devices,’” Berry said. “This experience will lead to learning at multiple levels: scientific, cultural, social, and international level, which is set to broaden her horizon.”",
        "Carvalho Fernandes added her research may allow scientists to combine different 2D nanomaterials together, which leads the materials to have different properties and uses.",
        "The GROW program has been crucial to her research because a technician in the CRPP lab created a 3D printer from scratch that is able to print gels.",
        "“One of their technicians actually rebuilt a whole 3D printer,” Carvalho Fernandes said. “He bought one and modified the whole thing. So instead of printing filaments he added a syringe. We can put the gel into the syringe and we print the gel from the syringe.”",
        "During the first three months of the program in 2018, Carvalho Fernandes was able to experiment with different combinations of materials and mixing techniques to create the gels. She noted the lab was buzzing the first time she was able to successfully print out a gel because the material maintained its shape and did not puddle like a gel would be expected to.",
        "““I got to print a cylinder and it stayed in the format of a cylinder then I could go and dry everything … This was a big deal and they were all excited,” Carvalho Fernandes said.",
        "She credited UIC and Berry for supporting her research and helping her find fellowship and grant opportunities.",
        "“I have to say Dr. Berry has played a huge role. He is always positive about the things I bring to him … I’d say ‘I found this what do you think?’ and he would say ‘Yes, go for it’ or ‘I found this opportunity what do you think?’ ‘Yes, go for it.’ He was really supportive.”",
        "For more information on the Chemical Department’s graduate opportunities please visit https://che.uic.edu/graduate-studies/.",
        "For more information on the NSF’s GROW program please visit https://www.nsf.gov/funding/pgm_summ.jsp?pims_id=504876."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}