{
    "url": "https://engineering.uic.edu/news-stories/cme-student-wins-il-ite-student-paper-award/",
    "title": "CME student wins IL-ITE student paper award | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Every year, many outstanding students compete to win the prestigious IL-ITE student paper award, but only one student can take home the honor. This year, Amir Bahador Parsa, a PhD student in the Department of Civil and Materials Engineering (CME), won the Best Paper Award with his paper “Real-time Accident Detection: Coping with Imbalanced Data.” He received a $1000 award during the ITE Illinois Section Annual Banquet at The Union League Club of Chicago on January 25. The Institute of Transportation Engineers (ITE) is an international professional society of more than 13,000 transportation engineers.",
        "“I am extremely honored to be receiving such an important award. Being awarded with the best paper award only one year after starting my PhD program means a lot for me and it motivates me to put my heart into my research more than I ever did and do my best to achieve my goals,” said Parsa. “I want to sincerely thank Professor and Department Head Kouros Mohammadian who has supervised me in my research as a dedicated mentor and makes me proud to be a part of his research team. I also appreciate Professor Sybil Derrible for encouraging me to work hard for this paper.”",
        "Parsa started his PhD program in fall of 2017 under the supervision of Mohammadian, and his research interests revolve around transportation planning and the application of data science in transportation. He is working on several research projects funded by the Illinois Department of Transportation and Argonne National Laboratory, which include real-time prediction of travel time for Chicago expressways, defining best practice operation of reversible lanes on the Kennedy Expressway, and investigating the impact of autonomous vehicles on traffic flow at the national level.",
        "“From the very beginning of his PhD program, Amir impressed me with his keen interest in learning and pursuing independent research,” said Mohammadian. “His skills and passion for the different aspects of transportation engineering made him an ideal fit for my research team. He is definitely an intelligent, motivated and hardworking student.”",
        "Parsa pointed to traffic safety as a critical issue. In his paper, he aimed to increase the safety of highways by developing machine learning techniques to detect accidents rapidly after they occur, which will lead to the swift dispatch of emergency services and inform drivers about detour options.",
        "“Transportation has a direct relationship with the quality of life, so one of the objectives in this field should be increasing life quality by not only facilitating the mobility, but also decreasing the adverse impact of transportation on people, health, and safety,” said Parsa. “Nowadays, we should benefit from the power of huge sources of data with which we are provided. In this research, I took advantages of several sources of data to detect accidents in real time which accordingly can save more lives who need help after occurrence of accidents.”"
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}