{
    "url": "https://engineering.uic.edu/news-stories/professor-xu-receives-researcher-and-scholar-of-the-year-award/",
    "title": "Professor Xu receives ‘Researcher and Scholar of the Year’ award | College of Engineering | University of Illinois at Chicago",
    "text": [
        "MIE Assistant Professor Jie Xu has been named a recipient of the 2018 UIC Researcher and Scholar of the Year award. He received the “Rising Star” award in the Natural Sciences and Engineering category. Xu is one of only five faculty members throughout the university to receive this honor.",
        "The Distinguished Researcher and Distinguished Scholar awards are given annually to UIC faculty who have demonstrated outstanding achievement in their respective fields of expertise. The Rising Star awards go to five additional UIC early career researchers who have demonstrated outstanding promise to become future leaders in their field. These awards recognize and celebrate the efforts and commitment of individuals who advance knowledge as well as inspire and promote continued excellence in research and scholarship at UIC.",
        "Xu joined MIE as a faculty member in 2014, and 2018 has been a banner year for him. The past year saw his research accomplishments featured in 13 journals, which brings his total published journal papers to 64. His research has flourished with the support of several grants, which include two NSF grants and a NASA grant through a prestigious NASA Early Career Faculty Award.",
        "“I work in the same field as Jie and I have been following Jie’s excellent work and productive career in the past 10 years ever since he was a PhD student at Columbia University. Everything I know of Prof. Xu suggests that he is a rising star in academia,” Professor Tony Jun Huang, of the Pratt School of Engineering at Duke University.",
        "“Professor Xu is an outstanding scientist with exceptional skills and extraordinary achievements in the research areas of microfluidics and lab on a chip technologies,” said Dr. Chenn Zhou, of Purdue University. “Due to his excellent track-record, I invited Professor Xu to give a seminar as part of the Purdue University Northwest’s Engineering Distinguished Speaker Series in September 2018. His talk was very engaging and was very well received by the students and faculty.”",
        "Earlier in 2018, Xu received the “UIC College of Engineering Faculty Research Award.” The award is based on excellence in research accomplishment, as measured by scholarly activities, PhD guidance, grants, and other research-focused activities.",
        "“He is currently supervising five PhD students and has also supervised three postdoc researchers and two visiting professors,” said Farzad Mashayek, MIE Department Head. “He has graduated 10 masters’ students and has supervised many undergraduate researchers, including two Chancellor’s Undergraduate Research Awardees. The level of student advising activity of Dr. Xu is remarkable for an assistant professor and is a testimony of Dr. Xu’s commitment to excellence in research.”",
        "As the founder and director of the Microfluidics Laboratory, he is focusing on micro interfacial sciences and revolutionary micro/nanofluidic systems to address pressing problems involving health, energy and environment. Xu and his team have developed novel acoustofluidics that can pump fluid, mix reagents, and sort cells at microscale as well as highly sensitive sensors that can detect diseases in human and hazards in the environment.",
        "“I want to focus on going deeper into research instead of going wider in next couple of years. I really want to make a bigger impact. I will use the NASA award as an opportunity to advance the field of acoustofluidics so the astronauts will have the ability to remotely control liquids to where they want and mix them with other agents at will at microscale,” he said. “I want to become the top researcher in this field. And hopefully my inventions can be used in space for exploration in near future.”",
        "Learn more about Xu’s research at The Microfluidics Laboratory."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "http://xu.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}