{
    "url": "https://engineering.uic.edu/news-stories/engineering-students-win-10k-prize-at-hackathon/",
    "title": "Engineering students win $10K prize at hackathon | College of Engineering | University of Illinois at Chicago",
    "text": [
        "A team of UIC engineering students from ECE and CS – along with a BioEngineering alumna – won the recent BuiltWorlds 2018 Hackathon, which included a $10,000 prize, at the Salt Flats’ West Loop innovation house. The two-day event kicked off on Friday evening as participants heard from both industry professionals and fellow hackers who described potential problems teams could tackle throughout the weekend.",
        "The UIC team, who went by the name “PoliThinkers,” was made up of ECE students Michele Calvi and Andrea Ciccardi; CS students Giovanni Agugini Bassi, Iacopo Olivo, Francesco Pinci, and BioEngineering alumna Chiara Gatti. The team are all part of UIC’s master’s degree contract programs between the College of Engineering and Politecnico di Torino and Politecnico di Milano. They competed against seven other teams of hackers and coders as they worked to create the best solution to some of the BuiltWorld’s problems.",
        "“The hackathon was about innovating the construction world and, speaking with people, we found out that security was one of the most important concerns,” said Ciccardi. “For this reason, we tried to think about a solution that applied our knowledges to that world and the idea of wearable connected devices came out from the brainstorming session.”",
        "The UIC team developed an interactive system to prevent accidents by warning the workers that are going to be in dangerous situations and remind them about safety procedures while utilizing a certain kind of machinery that implies a safety protocol to be respected. The system is able to read vitals from people to warn others when an accident occurs in order to speed up the emergency operations faster and eliminate unnecessary steps in the protocol.",
        "Even with a solid idea, the team still ran into additional two big obstacles during the event.",
        "“When we found out that our idea was similar to one already in the market. We wrote to one of the judges and she suggested to us to focus on what we had that was more than what already existed.” She and other people at the event helped us a lot since they were really interested in the idea,” said Ciccardi. “The second was to develop the real demo for the event. Our solution is a connected wearable device system, but, not having any bracelet with sensors to use, we managed to make everything with an android cellphone. The guys who developed the demo didn’t sleep much that night, but they did a great work to arrive on Sunday afternoon with a working demo to show some of the use cases of our device.”",
        "Apart from developing the idea, the team also had to present it to a panel of judges. This is an area where the UIC team set themselves apart from the competition. According to the judges, UIC’s presentation was much more thorough than some of the other teams. The team considered stakeholders, reviewed statistics from OSHA, and really applied the information to their presentation.",
        "“When we realized we won we were pretty incredulous,” said Ciccardi."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}