{
    "url": "https://engineering.uic.edu/news-stories/phd-student-helps-team-win-second-place-at-intelligent-water-systems-challenge/",
    "title": "PhD student helps team win second place at ‘Intelligent Water Systems Challenge’ | College of Engineering | University of Illinois at Chicago",
    "text": [
        "John Mulrow, a PhD candidate in the Department of Civil and Materials Engineering (CME), partnered with a team of scientists from the Metropolitan Water Reclamation District of Greater Chicago (MWRDGC), a professor from the University of Illinois at Urbana-Champaign, and professionals from Ensaras, Inc., to win second place at the inaugural “LIFT Intelligent Water Systems Challenge.”",
        "The national competition, hosted by the Leaders Innovation Forum for Technology (LIFT), a joint effort of the Water Environment Federation and the Water Research Foundation, challenged participants to develop new tools to improve local water and environmental quality through data analytics and artificial intelligence. It featured 19 teams of students, professionals and technology experts who used innovation and data to help solve difficult real-world issues facing water and wastewater utilities. Winners were announced following finalists’ presentations that were delivered at the Water Environment Federation’s Technical Exhibition and Conference in New Orleans. The team captured second place for its project “Developing Intelligent Advanced Warning Systems for Odors at Thornton-Composite-Reservoir.”",
        "The team developed solutions to odor issues, and created a predictive model to provide MWRDGC’s staff with advanced warning before odors emerge at the reservoir, which will allow corrective actions could be taken in advance.",
        "“My friend Dominic Brose, a soil scientist at the MWRDGC, asked me about joining a team focused on predicting odor events at their large reservoir on the south side. Dominic was familiar with CSUN’s work applying machine learning to civil engineering problems,” said Mulrow, who is working under the direction of CME Associate Professor Sybil Derrible in the Complex and Sustainable Urban Networks (CSUN) Lab. “I was lucky to recruit the assistance of Darshan Jain, Master’s Degree candidate in Civil Engineering, to help with data preparation and Quality Assurance/Quality Control (QAQC).”",
        "The data prep and QAQC processes turned out to be a major portion of the work as the team spent approximately four months reviewing hundreds of thousands of data points from at least 10 different data streams – weather, reservoir operations monitoring, and sensor data. They had to get each data type into a database format that was usable in machine learning testing. Additionally, they mined the data for time series and spatial trends in order to formulate hypotheses for data that would provide the strongest predictive power.",
        "“Once the data was compiled, we worked with Dr. Lav Varshney [of UIUC] and Ms. Nina Kshetry [of Ensaras] as they tested random forest algorithms on various subsets of data in search of an algorithm that would successfully predict odor events while avoiding false positive predictions,” said Mulrow. “Using this approach we were able to identify the data types and monitoring locations with the most predictive power, which will help MWRD improve their odor monitoring program going forward.”",
        "While the contest has ended, the teams’ research will continue to be used to remedy the real-world solution they were tasked with addressing.",
        "“We will be conducting follow-up this fall to train MWRD staff in implementation of the prediction algorithm using real-time data streams,” said Mulrow. “The algorithm that was developed can also be used to evaluate the efficacy of odor mitigation solutions at additional locations.”",
        "Learn more about the research at CSUN at csun.uic.edu. Learn more about CME’s Masters and PhD degrees at Graduate Studies."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "http://csun.uic.edu/",
        "http://www.csun.uic.edu/",
        "https://cme.uic.edu/graduate/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}