{
    "url": "https://engineering.uic.edu/news-stories/students-passion-for-engineering-leads-to-scholarship/",
    "title": "Student’s passion for engineering leads to scholarship | College of Engineering | University of Illinois at Chicago",
    "text": [
        "PhD candidate Jyoti K. Chetri has a strong work ethic and an even stronger desire to make the world a better place. It is this drive that helped the Department of Civil and Materials Engineering student win a Chicago Consular Corps (CCC) Scholarship for the academic year 2018-2019 from UIC’s Office of International Affairs (OIA).",
        "She is one of only a several successful applicants university-wide who were “favorably reviewed” and awarded the $1,000 scholarship. Eligibility for the scholarship is limited to students who have a minimum cumulative UIC GPA of 3.5 (on a 4-point scale).",
        "Chetri, of Nepal, is working under the direction of CME Professor Krishna R. Reddy in the Sustainable Engineering Research Lab and the Geotechnical and Geoenvironmental Engineering Lab where they are working on developing an innovative steel slag-biochar-soil cover for municipal solid waste landfills to mitigate fugitive landfill emissions. Landfills are the major sources of anthropogenic greenhouse gases, and developing steel slag, biochar amended soil cover will prove a turning point in the field of landfills and steel industry. It will not only hold in emissions from landfills but also solve one of the biggest problems of steel industry which is stockpiling of waste slag.",
        "“She has demonstrated exceptional research capabilities since the beginning of her research,” said Reddy. “She has shown admirable problem-solving skills. She is very hard-working and sincere towards her work, has in-depth knowledge on the subject matters and possess the ability to conduct research independently, and has excellent analytical skills. She is highly motivated and inclined towards learning new things, and takes the initiative to conduct in-depth literature reviews. In her short span of research at UIC, she has been able to write nearly 10 technical papers, which includes journal and conference papers. She takes criticisms positively and takes them as an opportunity to improve. She strives to flourish as an accomplished researcher.”",
        "Apart from her outstanding work in the classroom and the laboratory, she has a drive to help others. This is something that started a young age and motivates her as a student.",
        "“Growing up in the hinterlands of Nepal, all I saw was poor infrastructure, poor health facilities and many people dying at an early age,” said Chetri. “At a very young age where understanding engineering was beyond my capacity, I understood one simple fact that the main reason for many people dying at an early age was lack of health facilities and infrastructures. There were no proper roads and transportation facilities to carry sick people to the far away hospitals on time. I developed immense curiosity at an early age to find out more about the causes and solutions to such events. Gradually, I realized that engineering was the solution I was looking for to help the people of my village.”",
        "The Chicago Consular Corps (CCC) is comprised of all career and honorary consular officials appointed by their respective governments to serve in metropolitan Chicago, and who are duly recognized by the United States Department of State. Since its founding, the CCC has united representatives from countries around the world with more than 80 countries represented.",
        "According to the CCC, “awardees are students doing undergraduate, graduate and doctoral work. This is an important issue that is a core value to the CCC and to send the message to the foreign students, that we appreciate, admire and support their efforts and the sacrifice that it represents to them and their families to strive for a better education.”",
        "Learn more about professor’s Reddy’s and Chetri’s research at SERL & GAGEL. Find more information about CME’s graduate studies at http://cme.uic.edu/graduate-studies."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://cme.uic.edu/news-stories/professor-reddy-is-researching-zero-emissions-from-landfills/",
        "https://cme.uic.edu/graduate/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}