{
    "url": "https://engineering.uic.edu/news-stories/u-s-army-research-laboratory-taps-cme-student-for-fellowship/",
    "title": "U.S. Army Research Laboratory taps CME student for fellowship | College of Engineering | University of Illinois at Chicago",
    "text": [
        "John Klein, a PhD student studying Materials Engineering within the Civil and Materials Engineering Department at UIC, has been selected for a fellowship award in the U.S. Army Research Laboratory (USARL) Research Associateship Program.",
        "Earlier this year, two researchers from The Composites and Hybrid Materials Branch of the USARL visited UIC, and met with CME Associate Professor Eduard Karpov to discuss opportunities for collaboration. The researchers expressed specific interest in some of the research coming out of his lab. They also were looking for U.S. citizen PhD students in the field of materials engineering, and Klein – who grew up in Wilmette, IL – fit the candidate profile. After receiving positive feedback regarding his credentials, he applied to the fellowship, interviewed via teleconference, received an offer, and started the fellowship in September.",
        "“He is an excellent communicator and a clear writer who demonstrates a strong aptitude toward computer-based modeling. His background in mechanics and materials science along with his computer skills make him a great fit for a large variety of research projects,” said Karpov. “John is one of the most remarkable students I have ever advised. He is a talented researcher with huge potential to discover. He has demonstrated a great attention to detail, a focused and goal-oriented mindset, and he possesses an excellent ability to adapt to new environments and create new ideas.”",
        "As a fellow, Klein receives a monthly stipend of a more than $5,000 that will last 12 months. In addition to the generous monthly stipend, the award includes funding to allow him to travel to the USARL facility in Maryland and to a conference. Apart from learning from others, the traveling provides opportunities to network with researchers and meet personnel who can serve as resources in his efforts moving forward. The award is renewable for a second and third year.",
        "He continues to work under the direction of Karpov in the professor’s Advanced Materials Laboratory at UIC.",
        "“The specific research I am working on is within the scope of mechanical metamaterials,” said Klein. “A metamaterial has physical properties that are not seen in traditional materials. The behavior is outside of the realm of normal materials. These unusual properties could be related to how the material interacts with light, sound or forces.”",
        "“Applications of metamaterials seem like science fiction. For instance, optical metamaterials are able to cloak objects from light – think Harry Potter invisibility cloak. In acoustics, the same principle applies; you can hide objects from sound if you cloak it with an acoustic metamaterial. The sound or light passes through the object as if it is not even there,” he added.",
        "Additionally, one of the UIC researchers’ main objectives is to understand how they can control the way a surface load propagates through the interior when it is pushed.",
        "To address this question, they are developing a new class of mechanical metamaterials that manipulate the internal energy distribution and stress profile in response to surface loads.",
        "“In our materials, we demonstrate it is possible to deflect along a path and sometimes block at the surface certain types of loading patterns,” said Klein. “From a military standpoint, applications may include advanced armor systems, which would prevent certain loads from penetrating or structural systems, which when subject to certain load patterns are able to deflect them along a predefined path. The underlying objective of the Weapons & Materials Directorate within the USARL is to enhance the war power capabilities of the soldier, whether that be advanced protection or weapons systems. I like to think I am contributing to the former rather than the latter.”"
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}