{
    "url": "https://engineering.uic.edu/news-stories/cs-welcomes-13-new-faculty-members/",
    "title": "CS welcomes 13 new faculty members | College of Engineering | University of Illinois at Chicago",
    "text": [
        "A record 13 new full-time faculty members joined the computer science department this year, representing the College of Engineering’s commitment to matching an ever-growing population of computer science students with a team of talented, inspired teachers and researchers.",
        "As of this fall, more than 1,200 undergraduate, master’s, and PhD students are studying computer science at UIC, more than triple the number enrolled in the department just seven years ago. The department engaged in an intensive faculty recruiting effort not only keep pace with that growth—bringing the total number of computer science faculty to 48—but also to broaden and deepen the department’s research and teaching expertise.",
        "In these areas, the new faculty are poised to make noteworthy contributions.",
        "On the research side, Natalie Parde, an assistant professor who recently completed her PhD in computer science and engineering at the University of North Texas, brings a background in conversational interaction in artificial intelligence and has implemented a platform for human-robot book discussion groups. Assistant Professor Brent Stephens, coming off a postdoctoral research fellowship at the University of Wisconsin at Madison, works on improving the back-end services that drive the cloud-based applications that we use on a daily basis (think Gmail or Netflix). Associate Professor Ian Kash works in the cloud, too, but examines it from an economic perspective, as a market. Cornelia Caragea, an associate professor who most recently held the Lloyd T. Smith Creativity in Engineering Chair at Kansas State University, hopes to improve people’s ability to effectively and efficiently unearth meaningful discoveries from large amounts of digital data, and Xiaorui Sun, who just finished a postdoctoral term at Microsoft Research, designs new algorithms to solve computational problems even faster.",
        "Teaching is also core to the mission of the new computer science faculty. David Hayes will teach",
        "Mobile Web Application Development, illustrating recent changes in what web technologies are capable of and letting students build some technologies of their own. Mandy Burton specializes in the ethics of computer science and plans to develop a non-technical elective in the history of technology. Nasim Mobasheri will integrate group activities into Computer Algorithms I and hopes to encourage more women and students of underrepresented backgrounds to choose computer science. Evan McCarty, who joins UIC from the University of Washington, teaches Languages and Automata, noting that “the transition from when students just see computer science as programming to seeing it as a diverse academic field is very rewarding.”",
        "The group of 13 is thoughtful and insightful about their potential for impact. Assistant Professor Xingbo Wu, a PhD graduate of the University of Texas at Arlington who focuses on operating systems, storage, virtualization, and high-performance databases, hopes to contribute to UIC’s visibility in these fields. William Mansky, an assistant professor who has held postdoctoral research positions at the University of Pennsylvania and Princeton University, sees UIC’s computer science department as a rising center for “students who want to learn how to write code that really works.” Shanon Reckinger and Scott Reckinger share a dedication to inclusiveness and an excitement about learning. They hope to share their academic interests in computational representations of fluid dynamics while motivating the next generation of computer scientists.",
        "McCarty says that “UIC provides a great opportunity to have an impact on students’ lives,” and Stephens hopes “to inspire students and to help them achieve success in their research.” If you ask any of these 13 faculty members what they see as characterizing their coming years at UIC, common words include visibility, inclusivity, and excellence (and pizza). These are lofty yet attainable goals for these additions to UIC’s community of computer science scholars."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://cs.uic.edu/profiles/natalie-parde/",
        "https://cs.uic.edu/profiles/brent-stephens/",
        "https://cs.uic.edu/profiles/ian-kash/",
        "https://cs.uic.edu/profiles/cornelia-caragea/",
        "https://cs.uic.edu/profiles/xiaorui-sun/",
        "https://cs.uic.edu/profiles/david-hayes/",
        "https://cs.uic.edu/profiles/emanuelle-burton/",
        "https://cs.uic.edu/profiles/nasim-mobasheri/",
        "https://cs.uic.edu/profiles/evan-mccarty/",
        "https://cs.uic.edu/profiles/xingbo-wu/",
        "https://cs.uic.edu/profiles/william-mansky/",
        "https://cs.uic.edu/profiles/shanon-reckinger/",
        "https://cs.uic.edu/profiles/scott-reckinger/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}