{
    "url": "https://engineering.uic.edu/news-stories/phd-student-awarded-prestigious-eref-scholarship/",
    "title": "PhD student awarded prestigious EREF scholarship | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Only a handful of students are awarded scholarships by the Environmental Research and Education Foundation (EREF). This year, UIC’s Girish Kumar, a PhD student in the Department of Civil and Materials Engineering was named a recipient.",
        "This highly competitive and prestigious scholarship recognizes several doctoral students each year working at the forefront of the waste management and engineering field. The winners are selected from an international pool of applicants. Kumar was one of only eight students nationwide selected by the EREF to receive the scholarship in the amount of $14,400 for his research.",
        "“My research is focused on understanding the fundamental processes that occur within the waste when it is dumped in a landfill and mathematically interpret those processes to be able to predict the behavior of the entire landfill system. This will ultimately help in designing stable, effective and more importantly sustainable landfills” said Kumar.",
        "His research offers an alternative to the conventional landfills in the form of bioreactor landfills. In these landfills, the collected chemical liquid derived from waste degradation and other permitted liquids are recirculated into the landfills via recirculation systems to enhance the moisture conditions and accelerate waste degradation. The benefits including enhanced biogas production and early waste stabilization among others.",
        "Kumar is working with his academic advisor Professor Krishna R. Reddy, the director of the Sustainable Engineering Research Laboratory and the Geotechnical & Geoenvironmental Engineering Laboratory, on a NSF-funded project to develop a practical and reliable coupled thermo-hydro-bio-mechanical model that can enable safe design and operation of stable, effective and sustainable engineered landfills.",
        "“His understanding on the fundamental tenets of geotechnical engineering and geomechanics is commendable and he demonstrates excellent capacity on analytical work” said Reddy. “I have observed that he possesses great motivation and drive to live up to the standards expected of a doctoral student. He works as a graduate research assistant in our lab and makes it a point to be involved in other research projects as well.”",
        "Additionally, Girish assists his lab colleagues working on another NSF-funded project that involves mitigating landfill gas emissions using steel slag amended biocover systems. The project proposes an innovative, low-cost and practical biogeochemical cover system that utilizes biochar to oxidize landfill methane emissions into carbon dioxide and subsequently sequester carbon dioxide via mineral carbonation using steel slag, thus rendering zero emissions through landfill covers.",
        "As the President of the Sustainable Remediation Forum student chapter at UIC, Girish is constantly engaged beyond the walls of the laboratory by organizing expert lectures and seminars from academicians and industry professionals to keep himself aware of the technical know-how of different fields.",
        "More information about EREF scholarships can be found at https://erefdn.org/scholarship-program/. More information about the research can be found at the Sustainable Engineering Research Laboratory and the Geotechnical & Geoenvironmental Engineering Laboratory."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "http://serl.lab.uic.edu/",
        "http://gagel.lab.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}