{
    "url": "https://engineering.uic.edu/news-stories/cs-dept-welcomes-two-academic-advisors-to-the-student-affairs-team/",
    "title": "CS Dept. welcomes two academic advisors to the student affairs team | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Department of Computer Science hired two Academic Advisors, Bryant Hill and Josh Taylor, this past summer.   The positions are brand new to any department in the College of Engineering (COE) and were created to help address increasing enrollment, estimated at over 1,300 undergraduate students for this fall.",
        "Primary responsibility of required advising for undergraduate students in COE has rested solely with faculty advisors so far. However, with increasing advising loads and changing student body the Academic Advisors will help the department serve CS students better.",
        "As new Academic Advisors Bryant and Josh’s responsibility will be in guiding CS undergraduate students through curriculum, degree requirements, course selection and all matters related to helping students stay focused on their path to completion of the degree.  Faculty advisors will focus on advising students about variety of areas within Computer Science, career paths and the best technical electives to choose to achieve success in their chosen career path.  Computer Science department’s new incoming student body has been changing considerably for the past few years, they are coming in with varied backgrounds and experiences.",
        "Bryant spent several years advising students in career center at University of Missouri and also did video production to help promote services and events.  About his new role “I am an advocate for connecting students with the resources.  It will be an incredibly satisfying experience, when a lost student, upon my advice, starts taking advantage of all the resources the university has to offer and succeeds” said Bryant.  Bryant added “I really wish in my collegiate career I had a fraction of the resources that CS students have here at UIC, or a fraction of the dedicated faculty and staff. I am excited about working in a department that creates so many opportunities for students to excel”.",
        "Josh is starting a new career path after spending the past 8 years in the financial sector at PNC.  Josh was very careful in choosing his new career.",
        "When asked about changing his career around he said “I wanted to work in an environment that was energetic, promoted growth and would be personally fulfilling in helping others reach their aspirations.  I’m looking forward to seeing the students I advise soar academically in their studies.”  Josh has volunteered as a mentor at several non-profit organizations in Chicago for the past 11 years, which helped him make the final decision to change his career path.",
        "Josh and Bryant’s offices are in SEO located near the CS Student Affairs office (905 SEO).  Students last names A-L will be advised by Josh Taylor and M-Z by Bryant Hill.  They will be available for all CS students throughout the school year, with certain weeks reserved for advising.  They will have walk-in advising hours both in their offices and the CS Student Lounge.",
        "Undergraduate CS students are strongly encouraged to take advantage of the resources Bryant and Josh can provide, they are looking forward to working with all CS students."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}