{
    "url": "https://engineering.uic.edu/news-stories/first-ever-3d-printed-electrolyte-for-lithium-ion-batteries/",
    "title": "First-ever 3D-printed electrolyte for lithium-ion batteries | College of Engineering | University of Illinois at Chicago",
    "text": [
        "For the first time, researchers have successfully printed a complete, albeit experimental, lithium-ion battery including a solid-state electrolyte. While electrodes have been produced using 3D-printing technology before, researchers at the University of Illinois at Chicago College of Engineering have printed a stable, yet flexible, solid-state electrolyte using an elevated-temperature extrusion printing technique. They report their findings in the journal Advanced Materials.",
        "Lithium-ion batteries are commonly used in home and portable electronics, and in some motor vehicles. They function by the movement of lithium ions from the negative electrode through an electrolyte, which can be liquid or solid, to the positive electrode during discharge and then back during the charge phase.",
        "Mass producing these batteries is a laborious and expensive process. The electrodes and electrolyte, which are manufactured separately, need to be brought together and placed inside a casing. A controlled environment is needed to avoid contamination and lots of coatings and modifications are needed to complete the battery. With conventional production, battery sizes cannot be easily changed, nor can individual batteries be modified to fit specific devices because it would require that the machines used to produce the batteries be reset to new specifications.",
        "3D printing allows for the production and customization of batteries much more quickly and cheaply because all parts are printed together at once. In lithium-ion batteries where the electrodes have been 3D-printed, the conventionally produced electrolyte has always been added afterward in a separate step.",
        "In conventional solid-state electrolyte production, battery casings need to be prepared with various coatings and solvents used in the production of the electrolyte which then must be evaporated away in a post-production step. If an electrolyte is printed directly into a forming 3D-printed battery, evaporation would cause the electrolyte to shrink and pull away from the electrodes. This could cause the battery to short out. Coatings used to ensure the electrolyte makes good contact with the casings and electrodes are also extremely difficult to incorporate into a 3D-printed battery.",
        "To get around these problems, Reza Shahbazian-Yassar, associate professor, and Yayue Pan, assistant professor of mechanical and industrial engineering in the UIC College of Engineering, along with colleagues designed a unique 3D printer that works at an elevated temperature. It extrudes materials at around 120 degrees Celsius compared with traditional extrusion 3D printing, which takes place at room temperature. Their solid-state electrolyte ink is made up of a polymer base containing titanium oxide particles that allow it to be flexible, as well as functional. The unique electrolyte ink can be directly deposited into the battery as it is being printed.",
        "“The high temperature prevents post-production shrinkage,” said Meng Cheng, a graduate student in the UIC College of Engineering and lead author of the study. “Our technique dramatically improves the efficiency of the preparation of the electrolyte and its incorporation into the battery.”",
        "Shahbazian-Yassar’s experimental 3D-printed batteries had higher charge/discharge capacity and better performance than batteries where the electrolyte was fabricated using traditional methods. “The elevated-temperature direct writing and our specialized inks is the proof-of-concept that 3D-printed lithium-ion batteries are possible,” Reza said.",
        "Yizhou Jiang, Yifei Yuan, Ramasubramonian Deivanayagam, Tara Foroozan, Zhennan Huang, Boao Song, Ramin Rojaee, Tolou Shokuhfar and Yayue Pan of the University of Illinois at Chicago, Wentao Yao of Michigan Technological University and Jun Lu of Argonne National Laboratory are co-authors on the paper.",
        "This work was supported in part by grant DMR-1620901 from the National Science Foundation and Argonne National Laboratory subcontract No. 4J-30361."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}