{
    "url": "https://engineering.uic.edu/news-stories/researchers-put-a-new-spin-on-cooling-electronic-hotspots/",
    "title": "Researchers put a new spin on cooling electronic hotspots | College of Engineering | University of Illinois at Chicago",
    "text": [
        "The longevity of electronic devices is tested in many ways as they endure the rigors of daily usage. Even when they are treated with the utmost care, they still have a major challenge to overcome – the removal of heat.",
        "To alleviate this problem, ECE Assistant Professor Junxia “Lucy” Shi and her team of researchers in the Advanced Semiconductor Materials and Devices Laboratory at UIC are focusing on using a novel method for cooling hotspots in electronics and capturing the wasted heat to use to power the devices. The new technique additionally has the potential to expand the longevity of electronic components.",
        "The results of their research were recently published in the prestigious journals Scientific Reports and Physical Review Materials.",
        "Electronic devices are getting miniaturized, and produce a lot of heat when they carry currents. If the heat is not extracted out of the device, it will reduce the operating lifetime. Present cooling techniques are only efficient when the heat is close to the surface. Within a chip there are places called “hotspots,” which are areas of localized high temperatures.",
        "“These are to be avoided, otherwise they create failures.” said Shi. “Our targeted applications are heat sensors, energy converters, etc. We want to be able to gauge that heat generated in devices if desired, or better yet, extract that heat and convert to electricity.”",
        "“What we are trying to do here is use the intrinsic property of material in tandem with the modern techniques of thermal solid state cooling to drive more heat out of the device,” said Postdoctoral Researcher Parijat Sengupta, who is working under the direction of Shi. “We are looking at the internal arrangement of electrons, how they carry out the motion within the crystal, and how the motion gives rise to a certain kind of magnetic field, which is not applied from the outside. It is like having an internal magnetic field and it creates an additional avenue to drive more heat out of the device.”",
        "The researchers theoretically quantified how much heat can be driven, and they discovered that a lot of heat is produced, and the energy can be harvested.",
        "“You drive current through a device – so you are applying voltage – and in turn you are receiving heat, which usually goes to waste. We are trying to use that heat in multiple ways,” said Shi.",
        "“The heat can be utilized by driving a thermal power generator, where the heat produces electricity again,” said Sengupta. “Also, we can use heat to drive ‘spin currents,’ which is the internal attribute of the electron.”",
        "“Driven by the motivation to do energy harvesting, we chose a material where extra impetus can be had from the material’s internal arrangement of atoms and electrons and see what are the optimal experimental setups we can look for that maximize the heat flow,” added Sengupta.",
        "The researchers are using thermal power generators from an application standpoint because of the heat that it can draw out and drive another generator. There are two effects called the Seebeck effect and the Peltier effect, which are at play in the research.",
        "“If I drive heat through this material that will create a temperature gradient and that gives rise to voltage that you can use for something else. That’s the primary goal in mind,” said Sengupta. “The second is the spin current. We introduced the spin of electrons into our work. That is what makes this research interesting.”",
        "Learn more about professor Shi and her research at Advanced Semiconductor Materials and Devices Laboratory.",
        "SEEBECK and PELTIER EFFECTS",
        "The Seebeck effect is a phenomenon in which a temperature difference between two dissimilar electrical conductors or semiconductors produces a voltage difference between the two substances.",
        "The Peltier effect is the phenomenon that a potential difference applied across a thermocouple causes a temperature difference between the junctions of the different materials in the thermocouple. This effect is the opposite of the Seebeck effect."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "http://shi.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}