{
    "url": "https://engineering.uic.edu/news-stories/500k-nsf-grant-to-help-uic-project-for-faster-computing/",
    "title": "$500K NSF grant to help UIC project for faster computing | College of Engineering | University of Illinois at Chicago",
    "text": [
        "A $500,000, three-year grant from the National Science Foundation will allow researchers in the University of Illinois at Chicago College of Engineering to refine a new method of data processing that promises up to 10 times faster speeds for software running on currently available hardware.",
        "The speed with which individual computer processors have grown faster and more efficient has slowed down in recent years due to physical limitations. To get around this apparent speed limit, hardware designers have resorted to designing computer chips that contain multiple independent processors, also known as cores. The resulting machine is known as a multi-core computer.",
        "This work-around is limited by the need to coordinate activities between processors, currently done using what’s called a lock.",
        "When a program uses multiple cores concurrently, there are times when a critical piece of information or data needs to be modified before the next step in computing can take place. To prevent multiple chips from accessing that shared resource simultaneously – which could lead to errors – the data is temporarily “locked,” meaning that only one core can handle and modify it at a time. But locking can be slow. The chip must first “acquire” the lock, or send signals to all the other chips that the data it needs to modify is off-limits; then it does what it needs to do with that data, before finally releasing the lock, making it available to other processors in the computer.",
        "“This method of locking shared data is known as synchronized access, which can be highly inefficient,” said Jakob Eriksson, associate professor of computer science in the UIC College of Engineering and principal investigator on the grant.",
        "Eriksson and his students will refine an alternative approach to handling shared data resources on multi-core computers.",
        "“Instead of synchronization or locking, we are looking at another way of computing called delegation,” Eriksson said.",
        "In delegation, a single core acts as a server whose sole job it is to deal with data that needs to be shared among processors. While delegation often comes with a higher initial cost in terms of time needed, ultimately, performance can be much faster than with locking on modern computers.",
        "“Consider the analogy of a family doing dishes,” Eriksson said. “The locking approach is inefficient: each family member opens the tap, squirts some soap, washes one dish, closes the tap, dries their hands and then waits for their turn to use the sink again. With the delegation approach, the family members hand their dishes to a single designated washer who uses a pre-filled sink of soapy water and quickly does the dishes for everybody. For a single shared resource – in this analogy that’s the sink – with many users contending for it, delegation is always more efficient.”",
        "In previous research, Eriksson’s group showed that an efficient delegation system can dramatically outperform locking-based methods on processes that need shared access to individual items of data. They found that delegation is 10 times faster than using a lock-based processing system.",
        "Under the new grant, Eriksson will continue to refine delegation-based processing by identifying and eliminating roadblocks to additional gains in processing speed, and by adapting delegation to work in a wider range of settings."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}