{
    "url": "https://engineering.uic.edu/news-stories/liquid-microscopy-technique-reveals-new-problem-with-lithium-oxygen-batteries/",
    "title": "Liquid microscopy technique reveals new problem with lithium-oxygen batteries | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Using an advanced, new microscopy technique that can visualize chemical reactions occurring in liquid environments, researchers have discovered a new reason lithium-oxygen batteries — which promise up to five times more energy than the lithium-ion batteries that power electric vehicles and cell phones — tend to slow down and die after just a few charge/discharge cycles. They report their findings in the journal Nano Energy.",
        "“What we were able to see for the first time is that lithium peroxide develops in the liquid electrolyte of lithium-oxygen batteries, and is a contributor to the slow down and ultimate death of these batteries,” said Reza Shahbazian-Yassar, associate professor of mechanical and industrial engineering in the University of Illinois at Chicago College of Engineering and lead author of the paper. “This is a newly discovered reason why these promising batteries have such a steep drop off in efficiency and yield after relatively few charge/discharge cycles.”",
        "Lithium-oxygen batteries have been tantalizing to battery researchers for years because of their potential high energy density. But they tend to slow down and stop working relatively quickly compared to other batteries. One of the reasons for this loss of power is that a byproduct of the chemical reactions that take place inside the battery – lithium peroxide — builds up on the electrodes of the battery. The coated electrodes can no longer function efficiently and chemical reactions that produce energy ultimately stop.",
        "But now, Shahbazian-Yassar and his colleagues, using a new transmission electron microscopy technique developed by UIC engineering graduate students Kun He and Yifei Yuan, have demonstrated at the nanometer level, that lithium peroxide also forms in the battery’s liquid electrolyte component, further slowing chemical reactions.",
        "“Knowing that lithium peroxide is building up in the electrolyte itself is a very important finding,” Shahbazian-Yassar said. “Now, we can start to come up with ideas and designs that either prevent this from happening or do something to maintain the proper functioning of the electrolyte so it doesn’t interfere with the battery’s operation, and we can use the new liquid microscopy technique to see if we are moving in the right direction.”",
        "So far, lithium-oxygen batteries have only existed as lab-based prototypes, with mass-produced lithium-oxygen batteries for public or commercial use still a long way off, Shahbazian-Yassar said. “There are many problems that need to be overcome with lithium-air batteries before they can get into mainstream use, but knowing exactly what the issues are is a big first step towards the commercialization of these extremely high energy density batteries.”",
        "Kun He, Yifei Yuan, Tara Foroozan and Boao Song of the UIC College of Engineering; and Xuanxuam Bi, Khalil Amine and Jun Lu of Argonne National Laboratory are co-authors on the paper.",
        "This research was funded in part by grant 1620901 from the Division of Materials Research at the National Science Foundation, and by subcontract 4J-30361 from Argonne National Laboratory."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}