{
    "url": "https://engineering.uic.edu/news-stories/60-chicago-area-teachers-attend-cs-ed-camp-at-uic/",
    "title": "60+ Chicago-area teachers attend CS Ed Camp at UIC | College of Engineering | University of Illinois at Chicago",
    "text": [
        "More than 60 Chicago-area CS teachers helped organize the inaugural CS Ed Camp, an event for teachers of the 440-member Chicago Computer Science Teachers Association (CSTA) funded by Google and sponsored in part by the UIC CS Department.",
        "The camp, a participant-driven conference created to support K-12 teachers in their computer science skills, filled up within six hours of its registration opening.",
        "“Watching the numbers grow confirmed in our minds that this event seems to be meeting a real need for teachers to be able to exchange ideas on their own terms,” said Prof. Dale Reed, a founding member of Chicago CSTA.",
        "The CSTA, which has grown to more than 25,000 professionals since it was founded in 2004 by the Association of Computing Machinery, helps empower, engage, and advocate for K-12 CS teachers worldwide.",
        "Chicago is at the forefront of the growing need for those teachers with its Computer Science for All (CS4All) initiative at Chicago Public Schools (CPS), a movement to bring computer science education to every student in the CPS system.", SPIE Proceedings on Sensing and Imaging, International Series and Monographs on Advanced EM Wave Theory Applications, and the International Institute of Physics.",
        "For his contributions toward linking international research centers of Oceania and East/Austral-Asia via the Americas with Eurasia and Europe, Boerner was honored with the distinguished IEEE-GRSS Outstanding Services Award and the IECE-SANE. He was awarded the Alexander von Humboldt U.S. Senior Scientist, the Japan Society for the Promotion of Science Senior U.S. Scientist, and the U.S. Navy Distinguished Senior Professor awards.",
        "“It was my honor to have gotten to know him well,” said Dr. Rashid Ansari, ECE Department Head. “We would often meet in my office where he shared his wisdom and many stories. He always impressed me with his boundless enthusiasm, optimism, and energy.”",
        "Boerner was born in 1937 in Finschhafen, Papua New Guinea. He earned a B.S. Liberal Arts and Sciences from Ansbach-Bayern in 1958 and a M.S. in Electrical Engineering (Dipl. Ing.) from Technical University, München, in 1963, both in Germany. He earned his Ph.D. in electrical engineering from the University of Pennsylvania, Philadelphia, in 1967.",
        "In 1978, he joined UIC’s Department of Electrical Engineering and Computer Science (EECS) as professor and director of its Communications, Sensing and Imaging and Navigation Laboratory, and rose to professor emeritus.",
        "“I am saddened to hear of our colleague Wolfgang’s passing. I have known Wolfgang for about 40 years; he was always enthusiastic regarding his research and UIC. On many occasions I had given lectures for him (including Honors College classes, he volunteered to lead) while he made scientific travels to different parts of the world. He was always gracious. What a loss to the Engineering College,” said ECE Professor Emeritus James Lin.",
        "“For many years, decades in fact, Wolfgang Boerner occupied the lab next to mine. He was a remarkable man, and I’m greatly saddened to hear of our loss. Wolfgang was always fighting the good fight, and was widely respected and active in his work on Sensing (e.g., Radar). I would always see him, even deep into his retirement either coming from or going on another international trip, often for environmental studies. He will be greatly missed,” said Computer Science (CS) Associate Professor Jon A. Solworth.",
        "Boerner’s research interests were in the areas of electromagnetic field theory and wave propagation (ELF to microwave, mm-waves, infrared, optical, ultraviolet, x-ray); direct/inverse scattering; radar target mapping and microwave imaging and remote sensing; lidar/radar target phenomenology; radar polarimetry and target polarization analyses; fourier optics and holography; acoustic and electro-magnetic wave propagation in anisotropic, inhomogeneous media, tomography and modern image processing; geoelectromagnetic profile inversion; and atmospheric optics non-linear problems in electromagnetic propagation; polarimetry in nature.",
        "“Since he came to UIC in 1978, Wolfgang and I became and have been very good friends. It was fun to hear about his travels all over the world, which he enjoyed to do very much. His concerns about the migration paths of birds was especially interesting to hear about. He was a strong advocate of using the land north of Chicago, formally Fort Sheridan, as a bird sanctuary. It was awesome to hear about all the different kinds of surface and below surface phenomena that Wolfgang researched with his methods of remote radar sensing. Wolfgang and I grew old together. While our bodies aged and weakened, our minds never did,” said ECE Associate Professor Emeritus Roland Priemer.",
        "“I am truly saddened by the passing of Wolfgang. I knew Wolfgang for all of my 32 years here at UIC. He was so distinctive with his thick German accent. He could never be mistaken for anyone but Wolfgang. He was such an imposing force, and yet I found him to be very kind and funny. I have lost a wonderful colleague and the college has lost a great scientist,” said CS Professor Robert Kenyon.",
        "Boerner was highly honored as a scientist. In 2012, he was recognized at 50th anniversary of IEEE Geoscience and Remote Sensing Symposium in Munich, Germany. He received a certificate for his “extraordinary technical contributions to the advancement of radar remote sending science.” Additionally, two special sessions were organized in honor of his birthday: Recent Advancements in POLSAR Imaging in Honor of Professor Boerner’s 75th Birthday,sessions I and II.",
        "“I had the privilege of getting to know Wolfgang when we were both in the old EECS department. He was a bundle of energy, passionate about his work. He scared the daylights out of me as a young assistant professor. But I came to know him as a kind and thoughtful man, and I will miss the smile that came easily to his face and the twinkle that was always in his eye. The college has lost one of its founding giants,” said CS Associate Professor Thomas Moher.",
        "“Dr. Boerner was a truly remarkable person and we will miss our esteemed ECE colleague,” added Ansari. “Our deepest sympathies go out to his family at this very difficult time.”"
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}