{
    "url": "https://engineering.uic.edu/news-stories/alumnus-on-the-road-to-success-with-tech-startup/",
    "title": "Alumnus on the road to success with tech startup | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Ordering food online can get expensive quickly when you add the delivery fee and tip to the total. Unless the order is placed through the online app Chowbus, a Chicago-based tech startup that charges a modest $1 for deliveries.",
        "Co-founded by UIC alumnus Suyu Zhang, who serves as the company’s chief technology officer, Chowbus curates and delivers top-notch ethnic food with a rotating menu. The company started selling food online in 2015. Zhang has a background in mobile apps and he and the co-founder started working on their app, which was launched in March of 2016. Now, they are generating approximately $600,000 a month. The idea for a low delivery fee came from personal experiences ordering food while Zhang was working on his master’s degree.",
        "“When we were in school and ordered food, the delivery fees were too high,” said Zhang. “For an $8 sandwich, I had to pay an extra $6 or $7 delivery fee plus tips. I felt like this was something we could improve, because it was too expensive. So we came up with the idea to group the orders together, so we can deliver the orders in groups.”",
        "They set up hundreds of pickup locations in the Chicago area, with most in the downtown area. When someone places an order, they also select a pickup location, and every day at the same time they can go to that location to pick up food for lunch.",
        "“It’s like a bus with a route, and we have about 20 routes in Chicago,” said Zhang. “Each route has different pickup locations or what we call a ‘stop.’ The driver goes through the same route and to the same stop to deliver the food. Since it is operated like a bus, each stop delivery time is guaranteed. Just like a bus.”",
        "Unlike a regular bus, the Chowbus will be at each stop for approximately 15 minutes, which gives customers plenty of time to pick up their order. This allows multiple people from an area to order and pick up food at a designated location and a designated time.",
        "“The beauty of this is that we can lower the delivery fee to only $1 and still make money,” said Zhang, who noted that they offer door-to-door service which comes with a higher delivery fee. “And you don’t need to pay a tip since you are picking up the food.”",
        "The Drive to Succeed at UIC",
        "Zhang’s road to success started at UIC, where he earned a master’s degree in Electrical and Computer Engineering studying under the direction of ECE Professor Zhichun Zhu.",
        "“Suyu worked with me as a student for about two years. He was a good student and published a conference paper with me,” said Zhu. “I am very glad to hear about his success.”",
        "“It was a good experience. The professor always taught me how to improve the code to make the experiments faster,” said Zhang about working in her laboratory. “I learned the programing skills in classes and I got help from professors. Before I took those classes, I had no idea how much I liked this work. I didn’t even know I liked mobile development.”",
        "Apart from his inspiring experience with Professor Zhu, he enjoyed his time at UIC and recommends it to potential students.",
        "“ECE has good resources and the teachers are really professional. Also Chicago is really nice and the location of UIC is really good,” he said. “It was a great experience.”",
        "According to Zhang, Chicago is a great place for a startup company like Chowbus. Aside from the hungry lunch crowds looking for a unique meal, big tech companies are paying attention to the Chowbus. The company recently raised $1.06 million in fundraising.",
        "The team of 12 employees are moving to a bigger office now that they have outgrown their current location. Additionally, they recently launched the app in Boston and plan to expand to two more cities by the end of 2018.",
        "Learn more about the company at www.chowbus.com."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}