{
    "url": "https://engineering.uic.edu/news-stories/ece-students-addressing-global-health-needs/",
    "title": "ECE students addressing global health needs | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Students from the Department of Electrical and Computer Engineering (ECE) and their peers from the College of Engineering are taking on challenges to improve health care in the developing world. As members of UIC’s chapter of Engineering World Health (EWH), the students are using their engineering knowledge and skills to help people in Vietnam and beyond.",
        "When they are not in the classroom, the students are working together to build unique devices at UIC. This past year, the students constructed a prosthetic arm for a 10-year-old girl in Vietnam, who lost her arm in a playground accident. They also developed a hearing test device that can be easily replicated and used in a variety of locations around the world.",
        "“I’m working on two projects, and one is a prosthetic arm,” said Jessica Espejo, a junior in ECE. “Right now, we are focused on getting the basic prototype of the shape of the arm. I think it’s helpful, as I get more of an idea on how the creation of devices are made. I like this project as it will be directly helping someone in need.”",
        "The EWH members created a functioning prototype that they have been testing with the sensor-less technology they developed specifically for this project. The arm will be custom fitted for the child, while design requirements will assure the arm is low cost, simple, reliable, and, most importantly, comfortable and aesthetically pleasing.",
        "“In terms of circuitry, we’re working to make it as simple as possible for anyone who would have to open it up and fix it incase anything does happen,” she added.",
        "While there are a numerous fabricators and vendors working in Vietnam, they are not affordable. Also, prosthetic costs have decreased dramatically over the years, and the lowest cost for a prosthetic arm today would still be more than $2,000. The UIC students are taking steps to make the arm for a fraction of the price.",
        "Apart from a prosthetic arm, the students are developing a hearing testing device for the general market. The device will test a person’s hearing to see if it’s in the normal range for their age group.",
        "“We’re trying to make it low cost,” said Espejo. “I’m using more of what I’m learning in electrical engineering. I’m working on the printed circuit board of the device and I like that it’s a hands-on experience. I feel like I’m learning a lot that can help me as an ECE student.”",
        "Apart from putting theory into practice, Espejo feels like she is truly being challenged as a member of the student organization.",
        "“In some ways, I am offering a lot to the team as an ECE student,” she said. “For the hearing testing device, I feel like I’m able to help more with circuitry and things that my peers in EWH are not familiar with. In some ways, I feel more pressure to do well, but it’s a good thing. I get more out of it and learn more.”",
        "“For the prosthetic device, we started working on the circuit design, and everyone was looking at me to take the lead,” she said “I enjoy the challenge. However, it would be helpful to have someone else there to confirm what I’m doing is correct; but it’s also trial and error.”",
        "According to Espejo, ECE faculty members provided her with the knowledge to work on the devices with confidence. She also said she can turn to the faculty for assistance if a problem arises.",
        "Apart from putting engineering into action, the EWH students are provided with the opportunity to help the less fortunate.",
        "“I wanted to go into the medical field, but I realized that I like working with the electrical side of things and building things. I was interested in the projects [EWH] are working on, and I decided I wanted more hands-on experience,” she said. “I find this as a way to contribute to the medical and healthcare field and help people.”",
        "Additional ECE students working on the EWH projects include Ziyuan Wang, Dua Shehahed, Danielle Rodriguez, Faraha Saadat, and Ratnay Pandey. The team is scheduled to complete a fully functioning prototype by the end of the semester, and plan to deliver a further revised version by the end of the fall 2018 semester.",
        "See how other ECE student/alumnus contributed to EWH at Repairing Rwanda – ECE graduate helps fix medical equipment in Africa.",
        "Learn more about the student organization at Engineering World Health."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}