{
    "url": "https://engineering.uic.edu/news-stories/ece-student-receives-chancellors-student-service-award/",
    "title": "ECE student receives Chancellor’s Student Service Award | College of Engineering | University of Illinois at Chicago",
    "text": [
        "ECE student Anastasios Kokkinias received the 2018 Chancellor’s Student Service Award during UIC’s 46th Annual Chancellor’s Student Service and Leadership Awards (CSSLA) Ceremony on April 19.",
        "The award recognizes outstanding student leaders and student volunteers who, while maintaining high academic achievement, demonstrate a commitment to the UIC community through participation in student organizations and campus activities and throughout the greater Chicagoland area through active service and community engagement.",
        "Clinical Assistant Professor Renata A. Revelo, of the Department of Electrical and Computer Engineering (ECE), nominated Kokkinias for his outstanding work on a senior design project, which provided much needed support to a Chicago nonprofit.",
        "“[Kokkinias] had extensive service to the University and he was a key team player in the design and coordination with Little Village Environmental Justice Organization (LVEJO) for their project,” said Revelo. “What I noticed, from him and the rest of the team, was that they really took into account LVEJO’s needs and their input in designing something that could be useful, practical, and also serve an educational purpose.”",
        "He was part of a team, which included ECE students Juan Abrego, Charalambos Nicolaou and Miguel Hernandez, that volunteered to implement a lighting system that is powered by renewable energy for the LVEJO garden.",
        "The garden is used as a community hub and event space, but it does not have lighting and activities end when the sun sets. To help the organization get more out of the garden, the students designed a lantern system that will provide the necessary lighting to extend the time of activities.",
        "The system is comprised of a charging dock with wireless transmitters. The lanterns rest upon it and the built-in wireless receivers charge the batteries. Colored LEDs will notify the user when each lantern’s battery is empty or at full capacity. Additionally, solar panels will channel the necessary energy from the sun to power the docking station and charge the lantern’s batteries. The team has worked on the project for two semesters, and they are slated to install the system before the end of the spring semester.",
        "For this project, Kokkinias was voted leader of the senior design group. As the leader, he took on additional responsibilities, which included scheduling meeting times, project goals for the team, staying in contact with LVEJO, and made sure everyone in the group did the same amount of work for good team morale. He also contributed to the design and build of the final lantern design and scheduled time for presentation of design to the community during the summer.",
        "Under the direction of Revelo, 16 ECE students worked in four teams to complete projects for LVEJO, Enlace Chicago, Lakeview Pantry, and People for Community Recovery, which are all nonprofit agencies supporting Chicago residents.",
        "“I’m very happy for Anastasios to be receiving the award, though I wish all of the ECE students who participated could be awarded,” said Revelo.",
        "Apart from his work with the LVEJO, Kokkinias has volunteered extensively throughout the community. He served as the treasurer for two charity ball planning committees. One was for a young girl with Ewing’s Sarcoma, which raised more than $10,000, and another for a man suffering from Acute Myeloid Leukemia. He also participated in suicide prevention 5K run, where he helped raise money for a friend who has suffered from depression. When he’s not fundraising, he donates his time. He volunteered for the Chicago Marathon for the past three years, coached a church volleyball team to a gold medal in a Greek Church competition, and served as the treasurer of UIC’s Hellenic Student Association.",
        "Learn more about all of the student projects at ECE Students Giving Back to the Community."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://ece.uic.edu/news-stories/ece-students-use-senior-design-projects-to-help-community-organizations/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}