{
    "url": "https://engineering.uic.edu/news-stories/biaffect-mood-disorder-app-goes-live-in-apple-app-store/",
    "title": "BiAffect mood disorder app goes live in Apple App Store | College of Engineering | University of Illinois at Chicago",
    "text": [
        "An app developed by local researchers to predict manic episodes and depressive moods in people with bipolar disorder – based on how they interact with their cellphones – is now available to download in Apple’s app store.",
        "Dr. Alex Leow, an associate professor of psychiatry at the University of Illinois at Chicago who helped develop the BiAffect app, describes it as a “fitness tracker” for the brain that researchers can use to study mood disorders as well as the cognitive effects of Parkinson’s and Alzheimer’s disease.",
        "In a pilot study last year of 30 participants, researchers found typing speed, frequency of texting and social media usage correlated with manic and depressive episodes in people with bipolar disorder. Specifically, people who experienced manic episodes tended to type quickly on their phones and overrode spellcheck prompts, while people experiencing a depressive episode tended to write shorter messages, Leow told Chicago Tonight in January 2017.",
        "“We’re tracking how they’re navigating the keyboard, the actual pixels they’re touching,” Leow said. “The overarching goal as I see it is to better understand the relationship between mood and cognition.”",
        "To download the app, users must first agree to participate in a related study led by UIC researchers. Users’ de-identified metadata will be used to continue “to search for digital biomarkers of bipolar disorder and to further refine and improve the app,” according to a UIC press release. People who download the BiAffect app can view their own metadata, including their cellphone usage overtime, number of keystrokes, use of spellcheck and more.",
        "“We think that this crowd-sourced app-based study will soon lead to digital technologies that act as an ‘early alert system’ for people with bipolar disorder to help them see manic and depressive episodes coming, and take action to mitigate the effects of those episodes. Just being aware of them is a step forward for the millions who live with this mood disorder,” said with UIC College of Engineering Dean Peter Nelson, who helped develop the app, in a press release.",
        "Loew says the app isn’t just for people with bipolar disorder. “We want people without mood disorders to use the app as well so that we can better understand keystroke dynamics in healthy adults versus those with bipolar disorder,” she said in a press release. “This will allow us to further hone in on the ‘virtual biomarkers’ of bipolar disorder or even mood in general.”",
        "The BiAffect app was announced last May as the winner in a contest using Apple’s Research Kit, an open-source tool for creating apps, to study mood disorders. In addition to UIC, the development team included researchers from the University of Michigan, along with software companies Arbormoon Software and Sage.",
        "Bipolar disorder affects approximately 5.7 million Americans and is characterized by changes in mood, energy and activity level, according to the National Institute of Mental Health. People with bipolar disorder experience mood episodes ranging from periods of elation, high energy and increased activity levels to depression, low energy and decreased activity levels, respectively referred to as manic episodes and depressive episodes."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}