{
    "url": "https://engineering.uic.edu/news-stories/director-captures-the-beauty-of-aiaa-teams-rocket-igniters-in-slow-motion/",
    "title": "Director captures the beauty of AIAA team’s rocket igniters in slow motion | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Watching the fire and smoke, and hearing the roar of a rocket launch into the sky is a thrilling experience. It’s a vision that UIC’s AIAA (American Institute of Aeronautics and Astronautics) team encounters often when they test rockets and compete at competitions.",
        "Apart from launching rockets, the team members put a lot of time and effort into the design and fabrication of their rockets. A key element is the rocket igniter. Since the igniter is encased inside the rocket, it goes unseen when it functions or, in some instances, malfunctions.",
        "Recently, UIC’s AIAA team members recently started working with director Matt Mikka, who creates documentaries for various networks.",
        "While doing some test filming for another project, he was amazed with the custom rocket igniters the students make for their rockets. Particularly, how beautiful they looked in slow motion.",
        "“I reached out to Matt and he agreed to come by and see what we were doing,” said AIAA Project Manager Patrick Begalowski, who is a student in the Department of Mechanical and Industrial Engineering (MIE). On the first day that he came we recorded that video.”",
        "“I filmed rocket igniters that are used to launch solid rockets with the high-speed camera in 4k slow motion to see how they work,” said Mikka. “I was amazed myself at the beauty of the burn in macro slow motion. I never thought rocket igniters in macro slow motion would look so amazing.”",
        "Mikka isn’t the only person enjoying the video featured on his Warped Perception channel. The video titled Rocket Igniters Burning in Slow Motion 4k – Looks Amazing! has been viewed more than 45,000 times and the count keeps going up. The video Newton’s 3rd Law or Lie? – Solid Rocket Booster In a Vacuum Chamber (Slow Motion) – 4K answers different rocket-related questions with a vacuum chamber and rocket motors. The video has been viewed more than 72,000 times.",
        "Apart from looking amazing in slow motion, the videos have provided the UIC students with valuable insight.",
        "“We did get a lot of good information from the video,” said MIE student and AIAA Rocket Team Manager Mike Pekala. “From a research perspective it was very helpful and provided invaluable data that we wouldn’t have seen otherwise.",
        "With the slow motion video, the team members were able to see the rate of spin of particular pieces of propellant, how fast they’re leaving, what their dispersion is, the density of the particles that are burning, and much more.",
        "The UIC team will be competing in the Battle of Rockets (BOR) 2018 in Culpeper, Virginia, on April 14-15. In 2017, UIC beat out 24 teams to win first place during BOR’s Target Altitude challenge hosted by the Federation of Galaxy Explorers in Westover, Maryland. UIC also will be competing at the annual Spaceport America Cup in Southern New Mexico for on June 19-23, 2018.",
        "UIC’s AIAA chapter is a student run organization primarily dedicated to the study of aerospace and propulsion engineering. The students design and build remote controlled aircraft’s, high powered rockets, and quad-copters. Learn more about AIAA at UIC at https://aiaa.engr.uic.edu.",
        "Additional AIAA at UIC videos on Warped Perception",
        "Mikka posted additional videos to Warped Perception’s secondary channel Warped Perception X. You can see each video at:",
        "White Rocket Propellant Burning in Slow Motion – Warped Perception X 4K",
        "https://www.youtube.com/watch?v=5b1ufCTe-Jk",
        "Gray Aluminized Rocket Propellant Burning in Slow Motion – Warped Perception X 4K",
        "https://www.youtube.com/watch?v=Uwa_QxdelAI",
        "E-Matches Igniting Aluminized Rocket Propellant in Slow Motion – 4K",
        "https://www.youtube.com/watch?v=TaRwJyzF3ow",
        "One of The Most Beautiful Things I Filmed – for Warped Perception [in 4k Slow Motion]",
        "https://www.youtube.com/watch?v=m0BDKsbzm2k"
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://aiaa.engr.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}