{
    "url": "https://engineering.uic.edu/news-stories/cme-student-wins-chancellors-graduate-research-award/",
    "title": "CME student wins Chancellor’s Graduate Research Award | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Minoo Kabir is one of 27 students throughout the university to be awarded the Chancellor’s Graduate Research Award for her work entitled “Enhancing crack detection ability in large infrastructures by integration of acoustic metamaterials and MEMS sensors”",
        "“I’m absolutely thrilled that I received this prestigious award. It’s a great achievement that motivates me to continue my research with more efforts, and I’m so passionate about performing this project,” said Kabir. “I have been so lucky to have such a wonderful advisor, Dr. Didem Ozevin, who supported and encouraged me through my research.”",
        "Kabir works under the direction of Associate Professor Didem Ozevin, of the Department of Civil and Materials Engineering, in the Non-Destructive Structures laboratory.",
        "“Minoo joined my research laboratory in Spring 2014, and showed an impressive performance since then,” said Ozevin. “She wants to pursue an academic career. She definitely has tremendous capabilities as self-disciplined, organized and collegial student, and she can conduct independent research.”",
        "Kabir already published three manuscripts at highly prestigious journals: Sensors and Actuators A: Physical, ASCE Journal of Structural Engineering and Applied Physics Letters. Two new journal manuscripts are in preparation. She published numerous conference papers, and won the first place at highly competitive UIC Research Forum poster competition in Life Sciences/Engineering category in 2016. Additionally, she mentors several female undergraduate research assistants, and inspires them with cutting-edge research. She is co-author with a female undergraduate assistant in a conference paper.",
        "Kabir’s research is related to combining Micro-Electro-Mechanical Systems (MEMS) sensors with metamaterials in order to develop Structural Health Monitoring (SHM) system for large-scale structures as part of Ozevin’s NSF Early Career Development Award. Her research objective is to integrate real time damage monitoring strategies into the earliest stages of the design of civil infrastructure for resilient structural behavior. The integration will be achieved by introducing spatially periodic subsystems into structural elements, which will then behave as acoustic metamaterials as they are tailored to be able to block, redirect, and strengthen propagating elastic waves in the deployed. Such design allows the elastic waves emitted from any structural damage to be more easily focused and captured, long before the damage becomes critical, which allows uninterrupted service and safety in critical civil structures. Considering the current status of infrastructures in U.S., her research has high impact to the society.",
        "“I am truly honored and humbled to receive the Chancellor’s Graduate Research Award,” said Kabir. “This award will make a great contribution to my career as a Ph.D. candidate and researcher. This award will not only help me to successfully complete my Ph.D. research, but also will create the foundation to getting close to my ultimate career goals. I would like to thank the Graduate College for providing this opportunity for graduate students to practice writing research proposals.”"
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}