{
    "url": "https://engineering.uic.edu/news-stories/four-ece-graduate-students-honored-with-awards/",
    "title": "Four ECE graduate students honored with awards | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Graduate students work hard on research projects throughout the year. Four students in the Department of Electrical and Computer Engineering saw their efforts result in awards and scholarships, which will help fund their projects.",
        "Annual Graduate College Outstanding Thesis and Dissertation Award",
        "Fausto Annicchiarico Petruzzelli is one of only seven recipients of the 2017 Annual Graduate College Outstanding Thesis and Dissertation Award. He won in the Outstanding Master’s Thesis category for his work on A Wearable Device for Non-invasive Cardiovascular Monitoring.",
        "Petruzzelli was recommended by ECE Department Head Rashid Ansari and Professors Mojtaba Soltanalian and Shane Phillips. He worked under the joint direction of Professors Ansari, Soltanalian, and Phillips.",
        "“Fausto has research maturity and style uncommon among MS students and he appears to be destined for a successful research and entrepreneurial career,” said Ansari. “He is equipped with an extremely bright and creative mind coupled with a can-do attitude. He is extremely strong in the knowledge of theory, analytical skills, and practical implementation.”",
        "“Fausto is a person who loves hands-on projects, and at the same time, has an excellent grasp of the instrumental theoretical foundations,” added Soltanalian. “He was one of those few students that get things done, which must be clear from his thesis work and hardware implementations. He was usually ready with results few days after each of our discussions!”",
        "The Annual Graduate College Outstanding Thesis and Dissertation Award is given to the most outstanding doctoral dissertation or master’s thesis in each of the four Graduate Program divisions – Arts and Humanities, Behavioral and Social Sciences, Engineering, Mathematics, and Physical Sciences, and Life Sciences.",
        "Chicago Consular Corps Scholarship",
        "Ahmed Mohamed has been chosen as a recipient of Chicago Consular Corps Scholarship for the academic year 2017-2018 from UIC’s Office of International Affairs (OIA). He is one of only nine successful applicants university-wide who were “favorably reviewed” and awarded a $1,000 scholarship. Eligibility for the scholarship is limited to students who have a minimum cumulative UIC GPA of 3.5 (on a 4-point scale).",
        "“I am very pleased that I won this scholarship. Not just for the money but for what it will say about my place at UIC,” said Mohamed.",
        "Mohamed is working on his Ph.D. under the direction of Richard and Loan Hill & Distinguished Professor Michael Stroscio in the Nanoengineering Research Laboratory.",
        "“He ranks as one of the most confident, intelligent, and hard-working students I have ever encountered teaching at UIC, Duke University, and North Carolina State University over a period of thirty years,” said Stroscio. “His strong academic performance is self-explanatory; what is far more remarkably outstanding is his desire to acquire as much knowledge as possible regarding different fields of studies. He is not only a promising student, but also a well- rounded individual with broad, dedicated, and altruistic interests.”",
        "Provost & Deiss Award for Graduate Research",
        "Marco Poort was one of only 17 students throughout the university to be named a recipient of the Provost & Deiss Award for Graduate Research. The competitive award provides students with grants of $1000 to $3000 to support their research.",
        "“It felt great to win the award. It is a great opportunity and I’m honored to win it,” said Poort. “This award will provide funds to build a prototype, which will serve as a proof of concept for future grants that will be vital to my dissertation and also it may lead to a potentially patentable device.”",
        "Poort was recommended for the award by ECE Distinguished Professor Emeritus and Associate Dean Piergiorgio L. E. Uslenghi. He is working on his Ph.D. in the Andrew Electromagnetics Laboratory under his direction.",
        "“He has impressed me as one of the very best students I have had the privilege of supervising during more than half a century of academic work at the University of Michigan and the University of Illinois,” said Uslenghi. “Marco is extremely bright and hard working. He has an impressive knowledge of applied mathematics and electrical engineering, and intends to devote his professional life to an academic career as a university professor specializing in electromagnetics applied to antennas and microwave devices, with the utilization of novel electronic materials and the goal of integrating such devices into systems for communications, remote sensing, and biomedicine.”",
        "The Graduate College’s longest-running support for research by graduate students at UIC is the Provost’s Award for Graduate Research and the W.C. and May Preble Deiss Fund for Biomedical Research Award, which are collectively called the Provost/Deiss Award.",
        "Fall 2017 Chancellor’s Graduate Research Award",
        "Farid Kenarangi is one of 37 students to receive the Fall 2017 Chancellor’s Graduate Research Award for his research on Data Science for On-Chip Hardware Security.",
        "“It is always good to see when your hard work pays off,” said Kenarangi. “Professionally it was a new and educative experience for me as for the first time I was involved in writing a proposal in small scale. And financially, this award will help me in building a hardware setup for testing the proposed idea.”",
        "Kenarangi was recommended by Assistant Professor Inna Partin-Vaisband, where he works in the High Performance Circuits and Systems Research Group laboratory under her direction.",
        "“Among all the Ph. D. students and engineers who were working under my supervision, I rank Farid at the very top for his ability to conduct independent research and for his productivity,” Partin-Vaisband. “Farid is a truly creative, independent, and hard-working researcher and engineer. His recent theoretical work on detecting hardware attacks in modern ICs comprises proof-of-concept at the circuit, model, and algorithmic levels and exhibits a promising foundation for producing a new design discipline at the intersection of physical modeling, data analytics, and Internet of Things.”",
        "The Chancellor’s Graduate Research Award supports multidisciplinary scholarships in an attempt to expose graduate students to a variety of research and creative fields. The award is a way for students early in their studies to develop new research directions for their Ph.D. dissertations or terminal degree thesis/capstone project and has been used by graduate programs as a way for students to practice writing research proposals. Funding in the sum of $5,000 is awarded in one-year pilot grants to support preliminary research of students seeking future funding from external sources.",
        "Learn more about ECE’s Graduate program at https://ece.uic.edu/graduate/."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://ece.uic.edu/graduate/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}