{
    "url": "https://engineering.uic.edu/news-stories/houshang-darabi-wins-excellence-in-teaching-award/",
    "title": "Houshang Darabi wins Excellence in Teaching Award | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Each year, UIC honors some of its most dedicated and outstanding teachers with the Award for Excellence in Teaching. The winners, who receive a $5,000 salary increase, are selected by past recipients of the award from nominations made by departments and colleges. This year, MIE Professor Houshang Darabi was one of five faculty members throughout the university to be awarded.",
        "Many students are undecided as to what career path to take following graduation. But Houshang Darabi knew exactly the road he wanted to travel.",
        "“Sitting in class as an undergraduate student, I always wanted to switch places with my instructor,” Darabi said. “I would ask myself, ‘If I was teaching what would I do?’ Now that I’m doing it, I really enjoy it.”",
        "There are numerous types of engineers, including aerospace, mechanical, biomedical, civil and petroleum.",
        "Darabi selected industrial because of the “human component that is involved.”",
        "Industrial engineers work to eliminate waste of time, money, materials, person hours, machine time, energy and other resources that do not generate value. They create engineering processes and systems that improve quality and productivity.",
        "“In industrial engineering, humans are a big part of the equation,” Darabi said. “Take, for example, a theme park. Engineers calculate how many ticket agents are needed, how much should be charged for admission, and where to locate the rides, all to satisfy the customers at a minimal cost. If your customers are satisfied, your revenue increases. The goal is to maximize profit for both humans and resources.”",
        "Darabi teaches courses in financial engineering, operations research, probability, statistics and data mining, a field in which he has conducted extensive research.",
        "Originally from Iran, Darabi received his Ph.D. from Rutgers University. He has spent the last 17 years of his career at UIC, helping students grow not just academically but also as a person.",
        "“I love interacting with students,” he said. “My main philosophy in teaching is I ask myself what the final goal is, why are we teaching these students and why are they here. Students are not here to solely receive a letter grade or receive a degree. I want my students to be ready to find a job or continue their education in graduate school. I want my students to become a useful member of society.”",
        "In addition to the other courses Darabi teaches, he has redesigned a class entitled “Professional Development Seminar,” where second-semester seniors are asked “if they are ready to leave.” Students are provided information in various modules, from how to secure a job or continue their education in graduate school, financial planning, and how to excel in a job. The course, Darabi said, has been well received.",
        "“Not only do our current students love it, but some of our alumni, when told of the class, said they wish it had been offered to them, because the information our current students learn, the alumni have not learned until two or three years into a job. Our students believe the course gives them an advantage in the workplace.”",
        "In each class Darabi teaches, he tries to make a connection with the course material and practical applications. The goal, he said, is to always challenge his students.",
        "“If you’re not challenged, you’re not learning anything,” he said. “Students consider my classes difficult, but at the same time they are happy they were challenged and they say they learned a lot. That’s enough for me. Then I did my job.”",
        "read about the other winners at UIC Today."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://today.uic.edu/excellence-in-teaching",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}