{
    "url": "https://engineering.uic.edu/news-stories/engineers-kickoff-the-racing-season-with-second-place-win/",
    "title": "Engineers kickoff the racing season with second place win | College of Engineering | University of Illinois at Chicago",
    "text": [
        "UIC Motorsports kicked off the racing season with a second-place win during the Backwoods Baja competition hosted by University of Wisconsin – Stout on Oct. 21.",
        "The team competed against 20 colleges made up of approximately 200 students during the event, which is consisted of three events. There are two endurance races where the cars compete to get the most laps, and not break in the given time frame, and a third race called the fastest lap. During the third race, the teams drive a single lap backwards on the track to find who has the fastest car and the most skilled driver.",
        "The sprint to the finish wasn’t easy for UIC, as they had to overcome some challenges before they got on the track. The drive took approximately six hours as the team was towing a trailer with two cars, and a flat tire on the van delayed them for an additional hour.",
        "At the event, the team was welcomed with several hours of rain, which left the track in different conditions.",
        "“One section of the track was flooded, the forest section was dry, and some sections were tacky,” said Alexander Bulger, the vice president of UIC Motorsports and an MIE student. “After an hour, ruts formed in all the turns due to all the Baja vehicles racing through.”",
        "Apart from outracing their opponents, a key element of the race is organizing tools and members, and making sure the cars run smoothly. Every second counts when you’re racing against time. Especially if a repair is needed.",
        "“Our second vehicle had two mechanical failures, but the team was able to repair both quickly and get the vehicle back into the race,” said Bulger. “The first being the rear left tire loosing during the race and eventually ripping off the car completely. The car was towed in and worked on for 20 minutes and put back out. It then received another failure of the rear trailing arm due to fatigue and was replaced within 10 minutes and put back into the race.”",
        "The team worked together efficiently to fix the vehicle as well as swap drivers in both vehicles quickly. Everything went very smooth for the team, which advanced them to one of the leading positions.",
        "“It felt great winning second place,” said Bulger. “We obviously hoped to receive first again, since last year we won. But I think this is a good starting ground for our team and to improve for the next race.”",
        "Apart from working in a team environment, the SAE competitions contributes to the students’ engineering skills.",
        "“This team allows you to work on projects where you go from concept to final design. You apply the entire engineering process and the material learned from class into the real world,” said Bulger. “You also work in a high stress environment to meet deadlines as well as repair cars as quickly as possible during the race. It is incredibly fulfilling and expands your toolset as an engineer.”",
        "The team at the event was comprised of Mechanical Engineering students Jenifer Rubio, who serves as the UIC Motorsports president, James Gooderham, who is the UIC team captain, Michelle McClary, Kris Gardner, Ruben Sanchez, Christopher Dwyer, Andrew Johnson, Kenneth Brenner, Danny Brits, Kyle Middleton, Bailee Cooney, Jeremy Villarde, Amy Basinger, Josh Yudys, Emanuel Borrero, Dulce Varela, and Computer Science student Joe Borowicz.",
        "With its first successful race completed, the team is preparing for its next race – the Blizzard Baja – in February at Michigan Tech., where UIC won first place in 2016.",
        "Learn more about UIC Motorsports here."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://sae.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}