{
    "url": "https://engineering.uic.edu/news-stories/professor-xu-researching-space-technology-with-nasa-early-career-faculty-award/",
    "title": "Professor Xu researching space technology with ‘NASA Early Career Faculty’ award | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Astronauts are not alone when they execute amazing experiments in space. There are many people involved, and MIE Professor Jie Xu is one of the expert researchers working with NASA to make space exploration easier.",
        "Xu recently received the prestigious NASA Early Career Faculty grant for his project PIPES: Piezoelectric Instrument for Precision Exploration Sampling. He is one of only eight people to receive the award, which has a total amount of $600,000 for three years.",
        "“PIPES is a miniaturized liquid sample acquisition and handling system, which looks like a straw and is powered by a hand-held box,” he said. “The “straw” contains multiple flow paths for parallel sampling. Enabled by 3D printing, PIPES integrates acoustic actuation to achieve multiple sampling functions, including pumping, filtering, and mixing, in one compact unit.”",
        "The system will fill a gap in NASA’s in-flight sensing capabilities: the lack of miniaturized fluidic sampling and handling systems. The PIPES will make dramatic improvements at the system level in terms of weight, cost and operational simplicity.",
        "“As a versatile micro- to meso-scale fluidic sampling system, the PIPES can work with multiple micro- and meso-scale detection technologies such as electrochemical sensors, micromachined chromatographs and miniature mass spectrometers,” said Xu. “Therefore, it has great crosscutting potential in biomedical and environmental applications.”",
        "In space, the astronauts are not experts in every field, and it can be complicated for them using tubes, mixing liquids, and all types of testing that are easily performed in a laboratory. Ideally, this system will allow astronauts to push a button and everything is done automatically. This is a system to simplify experiments in space.",
        "“The particular focus is obtaining liquid samples in space and in the spaceship,” he said. “They always need to test the drinking water quality to see if there is any bacteria. Or on another planet, if they want to get a liquid sample and do different testing. That’s the main part and the first phase of the project. Later, I’m planning to integrate sensors into the system. They can get samples easily and as it flows past the sensor they will get results. It will tell them if there’s bacteria or whatever molecules they are looking for.”",
        "The Early Career Faculty award recognizes outstanding young researchers to address high priority needs of America’s space program. It challenges them to examine the theoretical feasibility of ideas and approaches critical to making space travel, exploration, and science more effective, affordable, and sustainable.",
        "“It’s important that we support early career faculty to conduct space technology research and develop groundbreaking, high-risk, high-payoff space technologies,” said Steve Jurczyk, associate administrator for NASA’s Space Technology Mission Directorate in Washington. “Early career faculty often have the advantage of looking at some of our challenges in new ways and developing innovative solutions to meeting them.”",
        "NASA’s Early Career Faculty efforts are an element of the agency’s Space Technology Research Grants program. The goal of this program is to accelerate the development of space technologies in their earliest stages to enable future systems capabilities and missions for NASA, other government agencies, and the commercial space sector.",
        "Learn more about Jie Xu’s research at The Microfluidics Laboratory."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "http://xu.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}