{
    "url": "https://engineering.uic.edu/news-stories/ece-alumnus-named-chief-scientist-at-telephonics/",
    "title": "ECE alumnus named Chief Scientist at Telephonics | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Congratulations to Department of Electrical and Computer Engineering (ECE) alumnus Dr. Lorenzo Lo Monte on being named the Chief Scientist at Telephonics.",
        "Telephonics is a New York-based corporation with 1,500 employees, and a $500 million annual revenue specialized in ISR, radar and tactical communication systems solutions. Lo Monte is overseeing the engineering and scientific teams and advises the executive board.",
        "Before joining Telephonics, Lo Monte was the director of the Mumma Radar Laboratory and an associate professor at the University of Dayton, where he taught courses on radar and electronic warfare, and served many U.S. Department of Defense government agencies.",
        "Lo Monte also was appointed as the Topical Editor for the IEEE Sensors Journal, as a representative to the Aerospace and Electronics Systems (AES) Board of Governor, and is an AES Distinguished Lecturer.",
        "“Lorenzo is an exceptional person, and his success is great news,” said Dr. Rashid Ansari, ECE Department Head. “The distinguished lecturer of IEEE AES is a wonderful accomplishment, too.”",
        "“Lorenzo came to ECE with a very strong recommendation from his advisor for his Master’s degree from the University of Rome at Tor Vergata in Rome, Italy,” said ECE Professor Danilo Erricolo, who is the director of the Andrew Electromagnetics Laboratory at UIC. “His former advisor told me that Lorenzo was the best student he ever had. He was at the top of the class (at UIC), very professional and detailed oriented. I am very happy for him.”",
        "Lo Monte said he had a great experience at UIC, which prepared him for the working world in many different ways.",
        "“UIC offers an excellent graduate program, which is deep and thorough enough to prepare you seamlessly for any technical job,” said Lo Monte. “However, UIC provided me with something special that other schools can’t vaunt much. In the high-tech industry, being worldly and cosmopolitan is paramount for success. Diversity and inclusion help you to understand and interface with the world. Differently from many other universities, UIC has a very diverse student body and culture. At UIC, I started my professional networking with people from all over the world and all backgrounds. This network, nurtured through the years, allowed me to expand my knowledge, social understanding and wisdom.”",
        "Along with the university’s diversity, the ECE faculty members had a profound impact on the young Ph.D. student.",
        "“Since my first day of work as a Ph.D. research assistant, the entire ECE faculty acted like a family to me,” said Lo Monte. “All professors were kind and helpful, proactively ready to listen to my technical, and personal, concerns. This amiable and accommodating environment helped me focus solely on my research and Ph.D.”",
        "While the 2009 graduate has achieved a great deal of success in his young career outside of UIC, he still has strong ties to the ECE department.",
        "“I am actively in contact with my Ph.D. advisor, Professor Danilo Erricolo. We wrote grants and publications together long after my Ph.D. was completed,” he said. “We are still pursuing grants and ideas together, and we share common interests with the IEEE. I have been collaborating with former UIC Ph.D. students, such as Pawan Setlur, Harun Hayvaci, and Stefano Canta, who have also achieved great success in their respective careers.”",
        "While Lo Monte has a bright future ahead of himself, he still reflects on his time at UIC with strong fondness.",
        "“UIC was a marvelous experience. Life at the campus, nearby the campus, and in the adjacent downtown are unparalleled,” said Lo Monte. “The learning experience, both technical and social, that I had at UIC has been so far the most important of my life, and I will cherish these memories forever. I’ll never forget the wonderful, yet ephemeral time at UIC.”",
        "Learn more about ECE at www.ece.uic.edu."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "http://www.ece.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}