{
    "url": "https://engineering.uic.edu/news-stories/ece-highlighted-at-women-in-engineering-summer-program/",
    "title": "ECE highlighted at Women in Engineering Summer Program | College of Engineering | University of Illinois at Chicago",
    "text": [
        "UIC’s Women in Engineering Summer Program (WIESP) provided high school girls with the power to build and learn more about the endless possibilities of working in engineering.",
        "The month-long summer program was made up of 25 rising juniors and seniors from around the city and the surrounding suburbs, and focused on Electrical and Computer Engineering (ECE). It is designed to be very hands-on and interactive, and understanding the importance of students taking ownership of their work while demonstrating team work and collaboration.",
        "“I believe it is important to host an engineering program like WIESP because we cannot expect women to choose engineering as a profession if they are not exposed to the field. Through this program, we addresses that, in order to bridge the gender gap in the field, a multi-sector approach needs to be considered,” said Elsa M. Soto, Associate Director of Women in Engineering Programs (WIEP). “To break gender segregation and stereotypes in engineering, and to increase the participation of women in engineering at the academic level, universities like UIC, local high schools, corporate partners, and community affiliates all need to work together to promote engineering as a viable career path for women. WIESP is a great opportunity for various institutions to work together and foster the next generation of women engineers.”",
        "Supporting Soto with the program were UIC engineering students and several ECE faculty members, who played a major role developing and supporting the program. In order to keep students engaged for a month, ECE’s Assistant Professor Hulya Seferoglu designed a module for the program, which focused on application development on android-based mobile devices. The students learned how to develop a calculator app and basic games such as Pac Man. Research Professor Ahmet Enis Cetin, with the assistance of ECE Ph.D. candidate, Ouday Hanosh, designed the second module, which introduced them to Arduino and MATLAB. Projects consisted of designing a motion detection system and heart rate monitor using Arduino Uno and PIR sensor, as well as designing an Arduino car robot.",
        "Another ECE faculty member who supported the camp was Associate Professor Natasha Devroye, who took time out of her busy schedule to talk to the young students about her career in engineering and journey to becoming a professor at UIC. The professor finds it important to reach out to young females and introduce them to engineering.",
        "“For those who do not know people in engineering in the first place it’s important to reach out to show them what we do. You can’t go into a profession you don’t know,” said Devroye. “For those who already know something about engineering, it helps them to decide whether it’s a field for them or not. I’d argue that the same is true for reaching out to males in engineering, but I guess there is some kind of stereotype that engineering is not a female profession, and so giving them extra information and opportunities could help debunk that myth for a few.”",
        "For Devroye, contributing to the program is about more than introducing the teens to engineering. It’s about being an exemplary model and inspiring the teens to succeed.",
        "“I don’t know how to help increase the percentage of females in engineering other than by being an example of one,” she said. “I want to make myself visible whenever I can. I hope that by seeing me they would feel they could do it too.”",
        "To find about more opportunities for middle school and high school students to learn about engineering, visit http://wiep.engr.uic.edu. For more information about the Department of Electrical and Computer Engineering at www.ece.uic.edu.",
        "",
        "",
        "Posted by UIC WIEP – Women in Engineering Programs on Thursday, July 20, 2017"
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "http://wiep.engr.uic.edu/",
        "http://www.ece.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}