{
    "url": "https://engineering.uic.edu/news-stories/engineers-rocket-to-first-place-at-aiaa-competition/",
    "title": "Engineers rocket to first-place at AIAA competition | College of Engineering | University of Illinois at Chicago",
    "text": [
        "The AIAA at UIC Rocketry Team outshined 24 teams to win first place during the Target Altitude challenge at the annual Battle of the Rockets (BOR) 2017 competition hosted by the Federation of Galaxy Explorers in Westover, Maryland.",
        "UIC successfully designed and built a rocket to fly on any commercial certified G-level rocket motor to an altitude of 1,213 feet. UIC came closest to the 1,213 mark for the win. They also safely recovered their rocket to fly again, which is one of the requirements of the competition.",
        "“Winning BOR Target Altitude was fantastic for us,” said team captain Matt Valenzeno, a student in the Department of Mechanical and Industrial Engineering (MIE). “We feel like we’ve made huge strides. That victory, along with our other successful launches this year, provide us momentum and added confidence to really begin to stretch ourselves. We feel like we’ve accomplished the major goals that we set out for this year — to gain more knowledge about rocketry, field competitive teams at all of our competitions, and provide our members with opportunities to prepare themselves for a career in aerospace.”",
        "Some of the colleges UIC competed against included Northeastern University, Northwestern University, George Mason University, Worcester Polytechnic Institute, University of Maryland, College Park, Montana Tech, and Case Western Reserve University.",
        "“I’m not surprised they won,” said MIE Professor Kenneth Brezinsky, the organization’s faculty advisor. “They take it very seriously, and every year they have students who are very high-level rocketeers who have gone through the certification process by the National Association of Rocketry and the Tripoli Rocketry Association.”",
        "“The students in AIAA are passionate about the aircrafts they design, build and fly and the rocket competitions,” he added. “They are extremely self-motivated and have to learn a lot on their own. What characterizes them is their extreme motivation and self-direction and cohesiveness as a group, because they work as a team to get these things done.”",
        "The UIC team was made up of Mechanical and Industrial Engineering students Tom Javorski, of La Grange, Ill. Michal Pekala, of Bartlett, Ill, Patrick Begalowski of Chicago, Kevin Mallari of Chicago, Marcin Maksimowicz of Chicago, Rachel Cruz of Woodridge, Ill., Eduardo Ocampo, of Cuernavaca, Mexico, and Matt Valenzeno, of Overland Park, Kan., Electrical Engineering student Jeff Groenhof, of Algonquin, Ill, and Computer Science student Corey Habel, of Gurnee, Ill.",
        "Additionally, Marcin Bialon, of Addison, Ill, served as the team lead before graduating in December with a degree in Mechanical Engineering. While he wasn’t able to attend the competition, Valenzeno acknowledged that he got the team started off on the right foot, with the first version of the rocket built early in the fall and test flown a number of times before winter break.",
        "“I was extraordinarily pleased with the team’s work ethic and compatibility,” said Valenzeno. “Everyone was more than willing to help as needed. Even with the stressful last couple of weeks before the competition, we were able to remain upbeat and optimistic. That’s one thing I love about this group — everyone is excited to learn more about rocketry.”",
        "Apart from winning competitions, developing professional skills, and finding common ground among their peers, members of AIAA at UIC have worked at some prestigious institutions. MIE students Ninoshka Llontop, of Wheeling, Ill., landed an internship at Virgin Galactic and Barak Stoltz, of Northbrook, Ill., took on a position at SpaceX. Both of the team’s last two Rocketry Projects Managers work with propulsion systems for NAVAIR, the U.S. Naval Air Systems Command.",
        "The AIAA (American Institute of Aeronautics and Astronautics) chapter at the University of Illinois at Chicago is a student run organization located in Region III. It is primarily dedicated to the study of aerospace and propulsion engineering.  The club was formed in 2011 for students with a passion for aerospace engineering. The organization designs and builds high-powered rockets, remote controlled aircrafts and quad-copters.",
        "Learn more about AIAA at UIC at http://aiaa.engr.uic.edu.",
        "https://www.facebook.com/AIAAatUIC/videos/727525300753311/"
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "http://aiaa.engr.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}