{
    "url": "https://engineering.uic.edu/news-stories/new-engineering-buildings-on-track/",
    "title": "New engineering buildings on track | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Dream big. Work hard. Do good. Six words that help encapsulate much of what UIC has been about in its short fifty-three year history. Today, they also specifically describe the College of Engineering, as Dean Peter Nelson and staff help to chart the course for the next fifty years of history by making plans to construct two new buildings that will serve a student body that has been growing steadily over the last decade and is projected to continue that growth. Since December 2016, building plans have progressed in key ways.",
        "Computing, Design, Research and Learning Center",
        "Plans for the College’s new Computing, Design, Research and Learning Center (CDRLC) made significant progress in December 2016, thanks to meeting a key fundraising goal for the project: A matching challenge was issued by E. Eugene Carter who agreed to contribute $1.5 million in matching dollars on the first $1.5 million raised for the building. This challenge was met by 30 donors. Together, with Dr. Carter’s gift, they collectively helped raise a total of $3.7 million by December 31, 2016.",
        "In May 2018, an alumni donor issued a second match challenge to alumni and friends by offering a 2:1 match on gifts of a certain amount for a limited time to raise an additional $1 million. Gifts of a minimum of $25,000—or a minimum of $5,000 if your company matches—are eligible for the 2:1 match and can be pledged for a period of up to five years. If you are interested in helping us meet this exciting challenge, please contact Janet Kashuba at jkashuba@uic.edu or (312) 996-2168.",
        "To date, the College has raised $5.1 million of our total goal for the Computing, Design, Research and Learning Center (CDRLC). The goal, originally projected to be $13.6 million, will likely increase to $15 million on a total building cost of approximately $96 million to be funded through a combination of fundraising, state appropriations, and operational revenue.",
        "Targeted for completion in 2021, the CDRLC is planned to be a 168,000 square foot/six story building facing Taylor Street and immediately adjacent to the Engineering Research Facility. The building will contain flexible-module classrooms in a range of sizes and types to support new learning paradigms, as well as research labs, interdisciplinary student design space, and faculty and staff offices. It will also house UIC’s Department of Computer Science. With the ever-increasing demand for our engineering and computer science programs, the CDRLC building will play an essential role in allowing the College to continue to fulfill its mission of access to excellence and success.",
        "",
        "Engineering Innovation Building",
        "The Engineering Innovation Building budget was approved by the University of Illinois Board of Trustees in November 2016, with the design and site plan approved by the Board of Trustees in March 2017. Since March 2016, UIC staff have been working with architectural and engineering firms to develop construction plans and bid package specifications. A groundbreaking ceremony was held on November 17, 2017 with Chicago’s Major Rahm Emanuel, along with a host of other dignitaries in attendance. The building will be completed by fall 2019.",
        "The building’s 50,500 square feet will include space for three departments. Space for the Department of Chemical Engineering will include labs, classrooms, and office space for faculty and students moving from their current building, which is located off campus, east of the Dan Ryan Expressway. In addition, there will be new space for the Department of Mechanical and Industrial Engineering and the Department of Civil and Materials Engineering. The building includes an option to incorporate the campus’s first high bay structural research lab as part of the building. Plans for the proposed High Bay Lab include strong floor, wind, and water testing capabilities to test multiple hazards simultaneously.",
        "See photos from the groundbreaking ceremony here."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}