{
    "url": "https://engineering.uic.edu/news-stories/eces-first-abraham-lincoln-fellow-earns-his-ph-d/",
    "title": "ECE’s first Abraham Lincoln Fellow earns his Ph.D. | College of Engineering | University of Illinois at Chicago",
    "text": [
        "On May 6, Albert Colon went from student to Doctor of Philosophy during the hooding ceremony — signifying his successful completion of the Department of Electrical and Computer Engineering’s graduate program — during UIC’s spring commencement. Colon was not be alone during the ceremony, but he does hold one special distinction. Colon graduated as the first ECE student awarded the Abraham Lincoln Fellowship.",
        "The goal of UIC’s Abraham Lincoln Fellowship program is to increase the excellence and diversity of the graduate student body by attracting applicants who have overcome obstacles to achieve academic success, like President Lincoln himself, who by his words and actions forged the framework for America’s pursuit of freedom, equality and justice. All applicants must be nominated by their departments, and selection criteria for the fellowship is based on academic achievement, promise and alignment with the goals of the fellowship. Nominees must be citizens or permanent residents.",
        "Colon, a Chicago native and an alumnus of Lane Tech College Prep on Chicago’s North Side, earned his bachelor’s degree in Electrical Engineering from UIC in May 2012. During his undergraduate time he worked as a tutor in the Minority Engineering Recruitment and Retention Program, was a member of the Institute of Electrical and Electronics Engineers student chapter, and the Society of Hispanic Professional Engineers, which contributed to his earning the fellowship.",
        "“He is an outstanding student with strong analytical skills, and was one of the top-performing students in my class” said Rashid Ansari, ECE Department Head and Professor. “Albert is an extremely bright and motivated student with strong potential to perform well in research.”",
        "Earning the fellowship provided Colon with more than financial support. It allowed him to excel in his classes and research, and gain the recognition of ECE faculty.",
        "“Typically if you don’t get a fellowship, you have to dedicate time toward other assistantships,” he said. “It becomes hard when you have to juggle classes, teaching assistantship positions, and your own research. It can be stressful. With the fellowship, you can focus on your classes and research, and it pushes you ahead on your progress.”",
        "With the fellowship support, Colon gained a tremendous amount of experience working as a Research Assistant in UIC’s Nanotechnology Core Facility and at Argonne National Laboratory in Lemont, Illinois.",
        "“I had the opportunity to work in two labs,” said Colon, who works under the direction of ECE Professor Lucy Shi. “She’s great. She is very supportive of us, spent a lot of time with us, and guided us through the laboratory process.”",
        "Colon, along with Chenjie Tang, is the professor’s first students to earn a Ph.D. under her direction at UIC.",
        "“Albert Colon is a good student, working hard and very easy-going,” said Shi. “He is very detail-oriented, and for our project one has to pay extra attention to even minor things.”",
        "With a strong background in research, Colon is ready to take on his next challenge. A short time after graduation, he moved to Albuquerque, New Mexico, to work at Sandia National Laboratory.",
        "Learn more about ECE’s graduate studies program at https://ece.uic.edu/graduate/."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://ece.uic.edu/graduate/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}