{
    "url": "https://engineering.uic.edu/news-stories/cme-students-win-globe-award-second-place-overall-at-engineering-senior-design-expo/",
    "title": "CME students win Globe Award, second place overall at Engineering Senior Design Expo | College of Engineering | University of Illinois at Chicago",
    "text": [
        "A team of CME students won second place overall at the 28th Annual UIC Engineering Senior Design Expo on April 21, 2017 at the UIC Forum, 725 W. Roosevelt Road, Chicago.",
        "The team of Mike Anzalone, Mary Cunningham, Yousef Dana, Garret Golden and Stephen Lashock won the Silver Award, which had a prize of $2,000, with their project Grant Park Reef Trail, which used virtual reality during their presentation.",
        "The group also won a Globe Award in the Infrastructure Improvement category. The expo was made up of 130 projects, which were presented by more than 500 students competing in five categories.",
        "The goal of the Grant Park Reef Trail project is to renovate Monroe Harbor to become a positive addition to the existing trail along Lake Michigan, which is one of Chicago’s greatest attractions. In its current state, Monroe Harbor appears to be unsafe due to excessive deteriorating concrete and heavy traffic from runners, walkers, bicyclists and tourists. The students proposed a modernized, two-tier path separating the speeding bikers and pedestrians has been designed. The design also includes more handicapped accessible features, a new seawall along the lake, and the creation of an artificial reef.",
        "With guidance from Philip Willink, the Shedd Aquarium’s lead researcher, the reef is designed using recycled materials acquired on site, which will help promote marine life and attract recreational fishing.",
        "Major benefits of this project include increased user satisfaction, safety, eco-friendliness and economic growth from increased usage. The Grant Park Reef Trail will be a contemporary destination for Chicago residents and tourists.",
        "“I am thrilled to see the Grant Park Reef Trail project receive this recognition,” said CME Clinical Assistant Professor Joseph Schulenberg, who was the team’s faculty advisor. “The team was able to combine two unique aspects, the reclaimed material reef and the use of virtual reality. Additionally the project is implementable and serves a real need. I feel that the use of virtual reality could very well become a new standard in communicating complex projects to clients and stakeholders. I was truly impressed with the work the group did.”",
        "“I took the advising role that if the students needed help, they knew that they could ask,” added Schulenberg. “With my work with the Corps of Engineers, I was able to provide information regarding similar projects to help them with scope and layout.”",
        "The team also were advised by Dritan Shehi, a professional engineer at Collins Engineering, Inc., who worked on The 606 trail in Chicago. He meet with the team often and ensured the project was detailed and well thought out.",
        "Another key element to the team’s success was its diverse mix of skill sets, and the ability to work with people in a research laboratory in the College of Engineering.",
        "“We have diverse passions ranging from transportation, structural, and environmental engineering, to fishing and video game making,” said Dana. “Each of us used these strong interests and skills to contribute to the project. Additionally, we had great help from those outside the project group. We worked extensively with UIC’s Electronic Visualization Lab to create a virtual reality model for our proposed trail.”",
        "Preparing engineers to succeed in the real world is the end goal for all of the students in the College of Engineering. The students demonstrated a wide-variety of engineering projects, which demanded strong skills and the ability to work in a team environment. And the Grant Park Reef Trail team is only one example of the how UIC is preparing tomorrow’s engineers.",
        "“The entire expo experience was very rewarding,” said Dana. “We knew we had something special with the virtual reality. Given the amount of hours and effort the team collectively put forth, we were really excited to hear our project announced twice during the award ceremony. More importantly, we were really happy that we were able to effectively present all of our project ideas and goals.”",
        "Additional projects to win Globe Awards included LEED the WAY and Scaling up Aquaponics in Chicago with Replicable Urban Farms. Second Place Honorable Mention projects were Design and Analysis of a Cross-Laminated Timber Building, and Science Technology Engineering & Mathematics Center, and Thermo-Drone."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}