{
    "url": "https://engineering.uic.edu/news-stories/professor-pan-named-2017-outstanding-young-manufacturing-engineer/",
    "title": "Professor Pan named 2017 Outstanding Young Manufacturing Engineer | College of Engineering | University of Illinois at Chicago",
    "text": [
        "As the faculty in the Department of Mechanical and Industrial Engineering (MIE) continues to grow at UIC, so do the accolades for their dedication to research. Recently, Assistant Professor Yayue Pan was named a 2017 Outstanding Young Manufacturing Engineer Award from the Society of Manufacturing Engineers (SME).",
        "Pan was recognized for her “exceptional contributions and accomplishments in the manufacturing industry.” She is one of only 17 people – all age 35 or younger – to receive the award, who were selected based on their work in emerging manufacturing applications, technical publications, patents, and academic or industry leadership. The young professor was nominated by two senior professors outside of UIC who are familiar with her research.",
        "“This is my first external award in this field since my graduation in 2014,” said Pan, who joined the UIC faculty directly after graduation. “It means a lot to have my work recognized. It encourages me to do more in the manufacturing field.”",
        "Pan is the director of MIE’s Additive Manufacturing Laboratory and her research is focused on novel additive manufacturing processes and their applications in energy and biomedical fields. Her work investigates multimaterial and multifunctional additive manufacturing processes, new material feeding approaches in stereolithography for superfast 3D printing of structures with wide, solid cross-sections and rapid prototyping of multifunctional smart materials for applications in fields such as thermal energy storage, responsive smart structures, sensors and electronics, etc.",
        "“I’m working on how to improve the 3D printing process speed, accuracy, or the resolution of the manufacturing technology,” said Pan. “I’m also working on how to additive manufacture smart materials, which have different local compositions, properties and functionalities.”",
        "One project she is researching in her lab is about how to additive manufacture multi-material 3D objects consisting of arbitrarily distributed micro/nano-sized building blocks. The manufacturing of micro/nano-machines is still challenging due to the difficulty in combining multiple materials or assembling multiple components into a 3D structure to achieve desired functionalities. She’s working on establishing new additive manufacturing strategy for fabricating 3D multi-material particle-polymer composites, to produce multi-functionalities by controlling local material distribution.",
        "“By combining different materials in the nano or microscale level and build a 3D object with free form features in a layer-by-layer way, we can achieve excellent properties and functionalities that were impossible before,” she said. “This research integrates multiple physical phenomena with advanced manufacturing and involves various disciplines of science and engineering including modeling and simulation, process design and development, and material engineering.”",
        "According to Pan, additive manufacturing has the capability to fabricate complicated shapes in one step without any assembly. The design has much more freedom with additive manufacturing.",
        "“Compared to traditional manufacturing technologies like CNC machining or injection molding, additive manufacturing has many unique benefits like being capable of fabricating complicated three-dimensional geometries without any tooling or any molding steps,” she said. “It can make impacts on different field like mechanical or aerospace or automobile or biomedical fields or consumer products. It could be anything,” she added.",
        "Learn more about the professor’s research at Additive Manufacturing Laboratory. http://yayuepan.lab.uic.edu/"
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "http://yayuepan.lab.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}