{
    "url": "https://engineering.uic.edu/news-stories/ece-faculty-member-awarded-for-outstanding-teaching-performance/",
    "title": "ECE faculty member awarded for outstanding teaching performance | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Kim Fitzgerald takes a lot of pride in her work. And for her dedication, the lecturer in the Department of Electrical and Computer Engineering (ECE), was selected by her peers to receive a “2016 – 2017 Teaching Recognition Program” (TRP) award for her outstanding teaching contributions at UIC.",
        "The award, which comes from the UIC Center for the Advancement of Teaching-Learning Communities, recognizes faculty members who concluded that her “teaching is an excellent example of the high quality of instruction that characterizes the best of UIC.”",
        "She was one of only a handful of faculty members throughout the university to receive the award. The review committee considered multiple variables, including her statement, student feedback, peer reviews, course materials, mentoring of students, curriculum development, and implementation of impactful and innovative teaching approaches.",
        "Peer reviews were thoughtfully provided by ECE faculty members Dr. Renata Revelo and Dr. Vladimir Goncharoff, who found her teaching portfolio impressive.",
        "“I was a bit surprised to learn I received this award, but very happy because I knew I had absolutely put every effort possible into my application, despite some personal issues that came up around that time,” said Fitzgerald. “This was the first time I had even applied for the TRP, and the entire process has caused me to reflect on my teaching in very new ways. I am very fortunate to have some very supportive colleagues and mentors in the ECE department.”",
        "As a recipient of a TRP award, she will be honored by the campus at the 2017 Faculty Awards Reception.",
        "The TRP award isn’t the only honor she received in 2016. Fitzgerald also was named a “2016 Teaching Scholar” by the UIC Center for the Advancement of Teaching-Learning Communities. The program pairs teaching scholars with a Master Teaching Scholar.",
        "“She is one of our outstanding teaching faculty members,” said Department Head Rashid Ansari, who provided a statement of support. “Kim is always seeking more effective ways of teaching to ensure the success of her engineering students at UIC.”",
        "“I was really happy to officially join this group of UIC instructors in a unique setting that supported teaching,” said Fitzgerald. “I was curious to learn their techniques and apply them in my own classroom. I actually already knew a few people because, throughout my career, I would always take the time to meet the instructor who taught before and after me in the same classroom.”",
        "Fitzgerald received her Master of Science in Electrical and Computer Engineering from UIC and her MBA from Roosevelt University. She teaches a broad range of courses in analog and digital circuits, as well as in signal theory. She also manages undergraduate student recruitment events. These are two areas the professor has her sights set on growth.",
        "“In the next five years, I want to teach a 500 level course,” she said. “I also want to see female ECE students double.”",
        "Learn more about her research interests and accomplishments at Fitzgerald Profile."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://ece.uic.edu/profiles/kimberly-fitzgerald-ms/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}