{
    "url": "https://engineering.uic.edu/news-stories/professor-subramanian-is-using-nanotechnology-to-improve-the-sustainability-of-rechargeable-batteries/",
    "title": "Professor Subramanian is using nanotechnology to improve the sustainability of rechargeable batteries | College of Engineering | University of Illinois at Chicago",
    "text": [
        "When people think about renewable energy the first things that come to mind are usually windmills, solar panels, and hydropower. But there is a major component in this process that needs to be addressed, and a new professor in UIC’s Department of Mechanical and Industrial Engineering’s is addressing this issue.",
        "Professor Arunkumar Subramanian, director of the Laboratory for Integrated Nanosystems (LINS) is investigating ways to make rechargeable batteries more sustainable. He is researching rechargeable batteries that use sodium ions instead of lithium ions for storing charge. The goal of this project is to improve the mechanical stability and electrochemical energy storage capacity of sodium-ion batteries by tuning the pore geometry and ionic content of microporous, sodium-ion intercalation electrodes. The research will address the large size of sodium ions, which creates multiple problems within a rechargeable battery, including its mechanical instability during the charging and discharging process.",
        "“Through a nanotechnology-based approach, this collaborative project will develop and test new cathodes for sodium-ion batteries using hollow nanowires, which seek to confine the sodium ions within a tunnel structure of about a nanometer in lateral dimensions,” said Subramanian. “The key innovation is that by confining the sodium ions within the tunnel, the electrode swelling and its mechanical degradation can be controlled, thereby leading to improvements in capacity retention and lifespan. Our primary contribution in this project involves the electrochemically-correlated mechanical testing of battery electrodes at a single particle level using nanoelectrochemical cells constructed on silicon chips. These material characterization capabilities can also be used to advance research and probe similar material degradation concerns that exist within other future metal ion battery systems based on magnesium, aluminum and potassium.”",
        "Due to the more abundant availability of sodium, this research also addresses the emerging sustainability concerns involving the supply and geographic constraints associated with sourcing lithium metal in larger quantities for use in future transport electrification applications.",
        "The funding for his research was made possible by a grant from the National Science Foundation (NSF). Subramanian is the principal investigator of a $225,000 award entitled “Collaborative Research: High-performance nanowire cathodes with stabilized microporous tunnels for Na-ion batteries,” which runs from Aug. 16, 2016 to June 30, 2019. This project involves collaborative efforts with Ekaterina Pomerantseva, an assistant professor in materials science at Drexel University.",
        "Exploring Battery Sustainability with CAREER Award",
        "Professor Subramanian is also a recipient of the NSF’s Faculty Early Career Development (CAREER) award, which is the most prestigious award given by the NSF in support of the early career-development activities of those teacher-scholars who are most likely to become the academic leaders in their fields.  He has been awarded $465,289 over five years from Aug. 16, 2016 to April 30, 2020 for his proposal entitled “CAREER: Sustainable Solutions for Li-ion Batteries through Cycle-Life Improvements in Nanostructured, ‘Green’ Cathodes.”",
        "The research objective of this project is to advance the sustainability of lithium-ion (Li-ion) battery technology through life-span improvements in electrodes, which are sourced from sustainable and low cost manganese oxides.",
        "“A key technical aspect of the research plan is to study battery materials made from single ‘nanowires’ in order to better understand the fundamental battery processes and deliver material processing strategies that enhance lithium-ion battery lifespan,” said Subramanian. “If successful, this research will advance energy storage technology for future clean energy needs, particularly in the transportation sector where electric vehicles are one alternative for reducing fossil fuel consumption and greenhouse gas production.”",
        "Learn more about the professor Subramanian’s research at LINS."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}