{
    "url": "https://engineering.uic.edu/news-stories/first-use-of-graphene-to-detect-cancer-cells/",
    "title": "First use of graphene to detect cancer cells | College of Engineering | University of Illinois at Chicago",
    "text": [
        "What can’t graphene do? You can scratch “detect cancer” off of that list.",
        "By interfacing brain cells onto graphene, researchers at the University of Illinois at Chicago have shown they can differentiate a single hyperactive cancerous cell from a normal cell, pointing the way to developing a simple, noninvasive tool for early cancer diagnosis.",
        "“This graphene system is able to detect the level of activity of an interfaced cell,” says Vikas Berry, associate professor and head of chemical engineering at UIC, who led the research along with Ankit Mehta, assistant professor of clinical neurosurgery in the UIC College of Medicine.",
        "“Graphene is the thinnest known material and is very sensitive to whatever happens on its surface,” Berry said. The nanomaterial is composed of a single layer of carbon atoms linked in a hexagonal chicken-wire pattern, and all the atoms share a cloud of electrons moving freely about the surface.",
        "“The cell’s interface with graphene rearranges the charge distribution in graphene, which modifies the energy of atomic vibration as detected by Raman spectroscopy,” Berry said, referring to a powerful workhorse technique that is routinely used to study graphene.",
        "The atomic vibration energy in graphene’s crystal lattice differs depending on whether it’s in contact with a cancer cell or a normal cell, Berry said, because the cancer cell’s hyperactivity leads to a higher negative charge on its surface and the release of more protons.",
        "“The electric field around the cell pushes away electrons in graphene’s electron cloud,” he said, which changes the vibration energy of the carbon atoms. The change in vibration energy can be pinpointed by Raman mapping with a resolution of 300 nanometers, he said, allowing characterization of the activity of a single cell.",
        "The study, reported in the journal ACS Applied Materials & Interfaces, looked at cultured human brain cells, comparing normal astrocytes to their cancerous counterpart, the highly malignant brain tumor glioblastoma multiforme. The technique is now being studied in a mouse model of cancer, with results that are “very promising,” Berry said. Experiments with patient biopsies would be further down the road.",
        "“Once a patient has brain tumor surgery, we could use this technique to see if the tumor relapses,” Berry said. “For this, we would need a cell sample we could interface with graphene and look to see if cancer cells are still present.”",
        "The same technique may also work to differentiate between other types of cells or the activity of cells.",
        "“We may be able to use it with bacteria to quickly see if the strain is Gram-positive or Gram-negative,” Berry said. “We may be able to use it to detect sickle cells.”",
        "Earlier this year, Berry and other coworkers introduced nanoscale ripples in graphene, causing it to conduct differently in perpendicular directions, useful for electronics. They wrinkled the graphene by draping it over a string of rod-shaped bacteria, then vacuum-shrinking the germs.",
        "“We took the earlier work and sort of flipped it over,” Berry said. “Instead of laying graphene on cells, we laid cells on graphene and studied graphene’s atomic vibrations.”",
        "Co-authors on the study are Bijentimala Keisham and Phong Nguyen of UIC chemical engineering and Arron Cole of UIC neurosurgery.",
        "Funding was provided by UIC."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}