{
    "url": "https://engineering.uic.edu/news-stories/professor-abiades-research-focuses-on-materials-with-protective-surfaces/",
    "title": "Professor Abiade’s research focuses on materials with protective surfaces | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Instead of applying copious amounts of deicing fluids to remove ice buildup from an aircraft before winter takeoffs, airport ground crews may see a lot less ice to clear away.",
        "Professor Jeremiah Abiade and his team in the Laboratory for Oxide Research and Education (LORE), developed a composite that has the potential to prevent ice from building up on aircrafts. Under Abiade’s direction, student Sin-Pui Fu developed a ceramic polymer composite that is based on cerium dioxide with polyurethane.",
        "“Instead of using a whole lot of chemicals during the winter at O’Hare or Midway [airports] to get rid of the ice on the planes, our idea is to put a coating on the structure before it goes into use,” said Abiade, of the Department of Mechanical and Industrial Engineering (MIE) at UIC. “They still may have to use some of the current de-icing methods, but they will have to use less of the chemicals which are pretty bad for the environment.”",
        "The LORE team is interested in materials that are considered oxides — a metal compound with oxygen. They are looking at the magnetic properties of oxides, and also the use of non-magnetic oxides as layers that they can put nanoparticles into it to study the properties of these nanoparticles. The researchers are also interested in the wetting properties of oxides and oxide composites with polymers. They are examining the use of oxides for energy harvesting or energy storage applications, too.",
        "“The general interest in these materials is for water repellency,” said Abiade. “We are looking at making materials that have a good combination of high durability plus good adhesion to whatever surface that they are coated to along with extreme water repellency. These coatings can be used to protect metals from corrosion or they could be used to protect surfaces from bacterial adhesion, and they can be used to protect surfaces against icing and frosting.”",
        "Abiade and Fu looked at how water droplets behave on these under static and dynamic conditions. He put a water droplet on a surface and determined if it balled up. If it balls up, it’s a hydrophobic material and the water acts as if it were afraid of the surface. If it’s hydrophilic the water will spread out. He is trying to understand what parameters they need to change so the materials become more hydrophobic, which is the physical property that describes the repulsion of the water droplet by the surface or balling up of the water droplet.",
        "Abiade’s recent research accomplishments, which were a collaboration with MIE Professor Alexander Yarin, were recently published in the American Chemical Society journal “Langmuir.” In the paper, the two research groups investigate the wetting properties of these materials at room temperature and low temperatures.",
        "“We are actually able to make what is called “super-hydrophobic materials,” meaning the water really, really balls up and makes a more round shape,” said Abiade. “We saw that this material maintained these properties even at very low temperatures. That suggests that it might be good for anti-icing.”",
        "Learn more about the Professor Abiade’s research group at LORE."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://lore.lab.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}