{
    "url": "https://engineering.uic.edu/news-stories/professor-paprotny-making-advancements-on-wearable-sensors-for-measuring-air-quality/",
    "title": "Professor Paprotny making advancements on wearable sensors for measuring air quality | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Professor Igor Paprotny is on a roll! The prolific researcher is making significant advancements on two wearable sensors he is developing in his laboratory in the Department of Electrical and Computer Engineering at UIC.",
        "The first project entitled “PM Badge: A Wearable MEMS Direct-Read Mass PM2.5 Sensor” is geared toward the development of a wearable sensor that is much smaller and more accurate than the instrumentation currently used by the EPA to measure air pollution, which is about the size of a toaster or a desktop computer.",
        "“Exposure assessment is needed to address environmental issues arising from increased exposure to airborne particulate matter (PM),” said Paprotny. “This project will carry out research on developing and miniaturizing PM sensors with potentially major improvement in performance.”",
        "The research for this project is made possible by a grant from Kanomax Holding, Inc. The period for this grant runs until May 30, 2017.",
        "For his project entitled “Miniaturized Wearable Personal Dust Exposure Monitor for Respirable and Alveolar Dust in Underground Coal Mines,” Paprotny is developing a new air-microfluidic sensor for measuring the ambient particle concentration in two size ranges, particles less than four micrometers in diameter and finer PM that is less than one micrometer, which penetrate deeper into the lungs than larger particles.",
        "This project is geared toward controlling levels of respirable particles so they remain below regulatory standards set by NIOSH, MSHA, and other agencies. Current instrumentation to monitor personal exposure to these particles is their weight (4.4 kg), large form factor, and cost.",
        "Paprotny will leverage the research of the Air-Microfluidic Group (AMFG), which he is the group leader, in developing direct-reading MEMS PM mass sensors, which presents over an order of magnitude reduction in size and cost for a personal dust monitor compared to the state-of-the-art.",
        "The AMFG is a research consortium that includes University of Illinois at Chicago, Lawrence Berkeley National Laboratory, University of California, Berkeley, Argonne National Laboratory, and U.S. Environmental Protection Agency. Its mission is to conduct research in the use of micro electro mechanical systems technologies, nanofabrication, microfluidics, chemical engineering and material science, for developing miniaturized, inexpensive, and portable/wearable low-cost lab-on-a-chip type devices for ambient air-quality monitoring and gas analysis.",
        "The research for this project is made possible by a the two-year grant from the Centers for Disease Control (CDC)/National Institute for Occupational Safety and Health (NIOSH),” which started in September and runs until Aug. 30, 2018.",
        "The two new grants are the third and fourth he received in less than a year for a total of more than $803,000 in research funding. He is the sole principal investigator for all four awards.",
        "Learn more about Professor Paprotny’s research and the AMFG at http://www1.ece.uic.edu/~paprotny."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}