{
    "url": "https://engineering.uic.edu/news-stories/professor-hatami-marbinis-sets-his-sights-on-cornea-research/",
    "title": "Professor Hatami-Marbini sets his sights on cornea research | College of Engineering | University of Illinois at Chicago",
    "text": [
        "“If it isn’t broke, don’t fix it,” is a common phrase, but you won’t hear engineers saying it. Engineers are known as problem solvers, and often they make things better by researching and understanding how materials work. Professor Hamed Hatami-Marbini, of the Department of Mechanical and Industrial Engineering, is researching the mechanical properties of the cornea to find new solutions for diseases that plague it.",
        "The cornea is a unique transparent tissue whose mechanical properties play a vital role in maintaining its stability and optical function. The loss of corneal structural integrity due to diseases such as keratoconus and ectasia leads to significant bulging and may cause severe visual impairment including blindness.",
        "In the case of keratoconus, which impacts approximately 1 in 2,000 people, the cornea becomes weakened and bulges due to constant pressure. It’s not a one-day process. It is a non-stopping disease that happens throughout several years, and it gets worse and worse every year.",
        "“As it’s bulging out, the optical properties of the cornea become damaged so light cannot get focused on the back of the eye and the vison becomes distorted,” said Hatami-Marbini. “There have been ways to manage the disease. Usually, people wear lenses that prevent the cornea from bulging out, but this is not a permanent solution. People can’t wear the lenses all the time, and the tissue gets weakened and weakened.” This is not a permanent solution as the tissue will eventually become so weak that it basically cannot be reinforced with lens or other external objects. Another solution for many patients has been transplantation, which is an invasive procedure and includes stitches in the eye. Although corneal transplantation has a high success rate, it involves a lifelong risk of rejection.",
        "“When we first started to study the cornea, we were interested to understand why the cornea is transparent. Our primary objective was to determine the underlying mechanisms that make the tissue both transparent and strong so that we could use the same principles to make similar structure materials, which are resilient and also transparent,” said Hatami-Marbini. “Now, we are also interested to understand how the mechanics of the cornea work. So in cases where the tissue gets diseased, we can intervene and reinforce the tissue so that the disease does not defect the transparency as well as the function of the cornea.”",
        "Hatami-Marbini’s research uses an integrated experimental and computational framework to characterize the effects of the collagen crosslinking procedure on different aspects of corneal biomechanical properties. Different techniques are used to measure the changes in the mechanical properties of corneal tissue before and after collagen crosslinking procedure.",
        "“The experiments are complemented by numerical finite element models,” said Hatami-Marbini. “It is expected that the successful completion of this project could eventually lead to new engineering design concepts.”",
        "Crosslinking polymers is an idea that has been successful in other areas like dental implants. Now the MIE professor is researching the use of the same concepts to strengthen the cornea.",
        "“This treatment procedure works, but still we don’t know how it exactly works,” said Hatami-Marbini. “Our research is about understanding how crosslinking of the cornea works. We want to improve the technique or find the deficiencies of the technique.”",
        "The professor’s initial data, which was published in Current Eye Research and in the Journal of Biomechanics, shows that some of the previous results are not accurate and overestimate the benefits of this technique as beneficial, but not as much as people used to believe.",
        "“Basically, we want to get to the bottom of this,” he said. “Whatever is working right now, is it accurate enough? Is our knowledge good? How can we get this better? How can we adjust the parameters to get better basic responses and provide more comfort to patients?”",
        "By understanding how the material properties of the cornea work, the technique he is researching also has the potential to open the flood gates to correcting a variety of eye-related problems such as far-sighted and near-sighted.",
        "“If we know how it works and crack the curvature of the cornea, we can adjust how it bends,” Hatami-Marbini. “This would be the long-term goal. If we understand how this technique works, then we can adapt it and target more ambitious goals, which has a larger audience.”",
        "According to Hatami-Marbini, engineering research at UIC has an advantage over other institutes, as it provides the opportunity to work with “excellent faculty and resources in the College of Medicine.”",
        "The professor’s research is supported by a grant from the National Science Foundation (NSF) entitled “Investigating Corneal Biomechanics after Collagen Cross-linking.” He is the principal investigator for the $321,061 award, which started in September and ends Aug. 31, 2019.",
        "Learn more about Professor Hatami-Marbini’s research in the Computational Biomechanics Research Laboratory at CBRL."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "http://cbrl.lab.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}