{
    "url": "https://engineering.uic.edu/news-stories/professor-max-bernikers-research-offers-a-new-perspective-to-motor-learning/",
    "title": "Professor Max Berniker’s research offers a new perspective to motor learning | College of Engineering | University of Illinois at Chicago",
    "text": [
        "What is your phone number?",
        "While answering this question, you probably used a method called chunking. You placed the numbers together into different sections – starting with area code, then the next three numbers, and finished with the last four digits. The organization of seemingly random numbers into chunks with slight pauses makes it easier to remember. Phone numbers are typically not seen or remembered as 3124138717. Instead, it is placed into chunks and seen as 312-413-8717.",
        "Chunking applies to movement, too. Elemental actions are merged into “chunks” and complex movements are made by combining many chunks together.",
        "Dr. Max Berniker, an assistant professor in the Department of Mechanical and Industrial Engineering (MIE) at the University of Illinois at Chicago (UIC), is part of a team of researchers whose groundbreaking research on motor learning skills is making significant advances in explaining the phenomenon of movement chunking and has important implications for the early diagnosis, treatment and rehabilitation therapy for patients with neurological disorders.",
        "In this context, researchers have had difficulty explaining how humans and other animals transition from computationally simple but inefficient movements to computationally demanding but efficient ones. Our study resolves this difficulty by showing, theoretically and experimentally, that the most cost-effective complexity-efficiency learning paths are the ones that produce chunking. Therefore, chunking is the natural by-product of a clever strategy that minimizes learning costs.",
        "The team’s research presents two extraordinary findings. First, it develops a theory for why chunking occurs.",
        "“Though we still don’t know precisely why, our brains prefer working with blocks, or “chunks” of movements, and then stringing a series of these chunks together to make sophisticated movements, like for example, a dance routine. We wondered whether or not this was because it was easier to plan and recall a series of chunks rather than a long sequence of movements,” said Berniker. “Chunking movements might be the best way to use a minimum of your brain’s valuable resources and still look like a good dancer.”",
        "The research also shows theoretically that there are certain stages of learning complex movements at which it is optimally cost-effective to merge small chunks together. It shows that savings on cumulative costs of learning can be achieved by selecting when to merge chunks together in an intelligent way. By dividing the movement sequence into chunks, optimizing for efficiency within chunks, and then merging chunks only when further gains in efficiency are required.",
        "The researchers are making theoretical advances on a well-known behavioral phenomenon in psychology, whose characteristics were well documented but whose causes were poorly understood. They are proposing a theoretical model for the causes of chunking using the modern tools of computational motor control. By framing chunking as an economic tradeoff in the motor system, it opens up a broad range of questions in motor control, optimal control theory, and cognitive neuroscience.",
        "“Our work provides a mathematical explanation and experimental evidence that chunking is a cost-effective strategy for learning new movements,” said Berniker. “In effect, chunking is a balance between using a minimum amount of your brain’s power and while being maximally efficient with your movements.”",
        "The field of computational motor control is concerned with building computational models that aim to discover how the brain controls the movement of our bodies and what are the goals and constraints of the motor system.",
        "The findings in the research have the potential to benefit people suffering from Parkinson’s disease, Huntington’s disease, and strokes. The understanding of chunking can be crucial for early diagnosis, treatment, and rehabilitation therapy. Framing chunking as an economic tradeoff offers a fresh perspective on motor learning and its disorders. For instance, the irregular nature of movements post-stroke may be attributed to lower computational budgets for motor learning, and the inefficient movements seen in stroke may thus be adaptive to this budget. Any rehabilitation approach can benefit from this insight.",
        "The team’s research is featured the in Nature Communications, an online-only open access journal, and includes researchers from the Rehabilitation Institute of Chicago (RIC) at Northwestern University, Syracuse University, University of California, Santa Barbara, and the University of Pittsburgh.",
        "Berniker is the director of The Motor Behavior Lab in the MIE department and works on the computational basis of biological motor behavior, examining issues such as motor control to motor learning and sensorimotor decision making. Berniker’s group works in motor behavior, running experiments to gather data and using computational tools to analyze the results. The group generally employ a normative framework, using hypotheses to quantify how the nervous system should optimally produce behaviors, and comparing these predictions with experimental evidence.",
        "Learn more about Berniker’s research at The Motor Behavior Lab."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "http://sensorimotorcontrolatorium.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}