{
    "url": "https://engineering.uic.edu/news-stories/uic-engineers-take-checkered-flag-at-winter-baja-2016-race/",
    "title": "UIC engineers take checkered flag at Winter Baja 2016 race | College of Engineering | University of Illinois at Chicago",
    "text": [
        "The freezing temperatures of Michigan’s Upper Peninsula couldn’t stop the red hot UIC Baja team from capturing the checkered flag at the annual Winter Baja 2016 hosted by Michigan Tech University on Saturday, Feb. 13.",
        "Along with the first place trophy, the UIC team burned up the track with the fastest lap time of the day — 3 minutes and 10 seconds — and dethroned the Iowa team that won the race the previous three years.",
        "“The entire field of teams were excited for the dynasty to be unseated. We hope this brings a renewed sense of fun to the competition,” said Justin Czok, president of UIC Motorsports, the College of Engineering’s student chapter of the Society of Automotive Engineers.",
        "The off-season snow race is an endurance event for the entire team as the day started with a frigid -3 degrees Fahrenheit at 7 a.m. with the Tech Inspection, and slowly warmed up to a chilling 8 degrees Fahrenheit when the race concluded at 4 p.m.",
        "A unique tradition that included eating pickled eggs confirmed the starting grid, and placed UIC near the back of the pack. However, persistent driving, efficient pit stops, and the dedication of the many people who built the car thrust them to the lead.",
        "“It was a feeling of disbelief when we first heard we were in the top five midway through the race,” said Czok. “As we watched our car climb in the standings over the course of the last three hours of the race, we saw our alumni near tears of joy to see how their work was being carried on by the current team.”",
        "The Winter Baja is an opportunity for the team to refine its teamwork and prepare for the season of Society of Automotive Engineers (SAE) sanctioned competitions. On Saturday, UIC conquered 39 other cars, many strong engineering teams, and the polar temperatures to capture its first win of 2016.",
        "“It feels great to bring a trophy back to UIC. Everyone was motivated and did their part at the race, so our hard work definitely paid off,” said Baja Captain Chris Dwyer.",
        "“It is with a nod and many thanks to all who support our work that we were able to initiate what we hope will become a winning tradition,” added Czok. “We are proving that we have a firm grasp on our designs going into the full competitions.”",
        "The Baja team is made up of Mechanical and Industrial Engineering students Chris Dwyer, Matt Johnson, Maria Ruiz, Ben Silva, Taha Tayebali, Andrew Johnson; Electrical and Computer Engineering student Justin Czok; Computer Science student Joseph Borowicz, and Mechanical Engineering alumni Jon Moser, Adam Miszta, and Michelle Sentevski.",
        "Apart from driving the car, additional team members serve as pit crew and help with repairs, assisting driver changes and fueling, and work as spotters on the track for any potential vehicle problems or ways a driver might be able to tackle certain areas more efficiently.",
        "The Baja team is slated to compete in two SAE competitions this year. The next race is in April at Tennessee Tech, and the second is in Rochester, NY, in June. Both events will pit the UIC team against more than 100 schools. The team looks poised and ready to push the new 2016 competition car to more strong finishes.",
        "The Blizzard Baja race results are available at Winter Baja. UIC Motorsports, the College of Engineering’s student chapter of the Society of Automotive Engineers, has a Baja team and Formula team. More information about the student organization can be found at http://sae.uic.edu."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "http://sae.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}