{
    "url": "https://engineering.uic.edu/news-stories/researchers-prove-surprising-chemistry-inside-a-potential-breakthrough-battery/",
    "title": "Researchers prove surprising chemistry inside a potential breakthrough battery | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Lithium-air batteries hold the promise of storing electricity at up to five times the energy density of today’s familiar lithium-ion batteries, but they have inherent shortcomings. Researchers at the University of Illinois at Chicago have helped prove that a new prototype is powered by a surprising chemical reaction that may solve the new battery’s biggest drawback.",
        "The findings are reported in the Jan. 11 issue of Nature.",
        "Today’s lithium-air batteries (in which the metallic lithium of the anode, or positive terminal, reacts with oxygen from the air) hold great promise, because they store energy in the form of chemical bonds of oxide compounds. Versions tested to date have stored and released energy from lithium peroxide, an insoluble substance that clogs the battery’s electrode.",
        "Battery scientists at the U.S. Department of Energy’s Argonne National Laboratory developed a prototype that they claimed had the surprising ability to produce only lithium’s superoxide, not peroxide, as the battery discharges. Unlike troublesome lithium peroxide, lithium superoxide easily breaks down again into lithium and oxygen, thus offering the possibility of a battery with high efficiency and good cycle life.",
        "The Argonne group designed the battery to consume one electron rather than two and produce the superoxide, said UIC’s Amin Salehi-Khojin, assistant professor of mechanical and industrial engineering. But it was difficult to prove the reaction took place.",
        "“Ex-situ analysis is not accurate enough to prove such a big claim,” he said.",
        "Salehi-Khojin and postdoctoral research associate Mohammad Asadi devised a state-of-the-art mass spectroscopy apparatus to measure the electrochemical reaction products in situ during charging or discharge of the battery. The system operates in ultra-high vacuum and is “very sensitive to the tiniest change in oxygen concentration,” said Asadi, who is one of five first authors on the paper in Nature.",
        "For the first time, the UIC researchers were able to show that one electron per oxygen atom was produced, indicating lithium superoxide, not peroxide, was forming in the battery. They were also able to show that no other lithium compounds were generated as side-products.",
        "“This is going to be a valuable system for continuing the study of this battery and other types of metal-air batteries,” said Salehi-Khojin. “Not only can we analyze the products of the electrochemical reaction, we can elucidate the reaction pathway. If we know the reaction pathway, we’ll know how to design the next generation of that battery for energy efficiency and cost effectiveness.”",
        "The work was funded by the DOE’s Office of Energy Efficiency and Renewable Energy and Office of Science and the University of Illinois at Chicago Chancellor’s Proof of Concept Fund.",
        "Other authors on the Nature paper are Argonne’s Jun Lu, Dengyun Zhai, Zonghai Chen, Khalil Amine, Xiangyi Luo, Kah Chun Lau, Hsien-Hau Wang, Scott Brombosz, Larry A. Curtiss, Jianguo Wen and Dean J. Miller; Yun Jung Lee, Yo Sub Jeong, Jin-Bum Park and Yang-Kook Sun of Hanyang University in Seoul; Zhigang Zak Fang of the University of Utah; and Bijandra Kumar of the University of Kentucky.",
        "More about the UIC College of Engineering"
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "http://engineering.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}