{
    "url": "https://engineering.uic.edu/news-stories/grad-student-honored-for-his-research-at-materials-research-society-meeting/",
    "title": "Grad student honored for his research at Materials Research Society meeting | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Graduate student Poya Yasaei recently received a Silver Graduate Student Award at the Materials Research Society (MRS) 2015 Fall Meeting in Boston. He was one of only 29 students in the world to be awarded Gold and Silver Awards and recognized for exceptional ability and promising future in materials research based on oral presentations given on Dec. 1, 2015. Silver Award winners receive a $200 prize and a certificate.",
        "Yasaei, who is working on his Ph.D. under the direction of Assistant Professor Amin Salehi-Khojin in the Department of Mechanical and Industrial Engineering (MIE), was honored for his work on “Thermal Transport Across Individual Graphene Grain Boundaries.”",
        "During the meeting, he had the opportunity to participate in the Special Talk Session and deliver a 12-minute presentation followed by a three-to-four-minute question-and-answer segment. “I presented once for the MRS award judges and a second time in the actual symposium session,” said Yasaei. “It went very well.”",
        "Apart from being honored by the MRS, the presentation allowed him to network with like-minded students from the Massachusetts Institute of Technology, Stanford University, and Harvard University in the United States, Fudan University and Tsinghua University in China, Imperial College London in England, and other top international universities.",
        "“I’m in touch with several of awardees discussing possible collaborations,” he said. Apart from networking, he said the experience will help in the future as many of the previous awardees are now working at prestigious institutions.",
        "“I feel proud for being in the company of best graduate students in my research area across the world,” said Yasaei. “I believe this is a great achievement for my personal carrier and UIC. I would like to take this opportunity and acknowledge Professor Salehi-Khojin’s dedication in supervising me in research.”",
        "The MRS Graduate Student Awards are intended to honor and encourage graduate students whose academic achievements and current materials research display a high level of excellence and distinction. Emphasis is placed on the quality of the student and their research ability.",
        "“Poya‘s achievement of the MRS Graduate Student Award is a direct reflection on the outstanding education provided by University of Illinois at Chicago. We hope you will share in this honor. Thank you for your dedication to providing a superior educational experience for your students and advancing the sciences!” said an MRS Representative in a message sent to UIC’s Dean Nelson, of the College of Engineering.",
        "“This is the most prestigious award in the field of material science for graduate students and it is highly competitive,” said Professor Salehi-Khojin, who is the director of MIE’s Nanomaterial and Energy System Laboratory.",
        "The Nanomaterial and Energy System Laboratory is an interdisciplinary research group with the mission to advance the state of the knowledge at the boundary of science and engineering. The team pursues fundamental research in the field of advanced materials synthesis, energy recovery and transport at micro/nanoscale.",
        "Discover more information about the laboratory at Nanomaterial and Energy System Laboratory."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "http://nanomaterialsenergysystems.engr.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}