{
    "url": "https://engineering.uic.edu/news-stories/professor-laxman-saggere-awarded-supplemental-nsf-efri-grant-to-continue-research/",
    "title": "Professor Laxman Saggere awarded supplemental NSF-EFRI grant to continue research | College of Engineering | University of Illinois at Chicago",
    "text": [
        "Professor Laxman Saggere was recently awarded nearly $400,000 from the National Science Foundation’s Office of Emerging Frontiers of Research and Innovation (EFRI) for a project entitled “EFRI-BSBA: Nanoactuation and Sensing of Neural Function for Engineering Future Biomimetic Retinal Implants and Therapies.” The funding is a supplement to his original 2009 EFRI grant and brings the total to approximately $2.4 million.",
        "“The research explores the feasibility of developing a novel retinal prosthesis for people who are blind due to photoreceptor degeneration,” said Professor Saggere. “Our goal is to develop a prosthesis that works by mimicking the functionality of normal photoreceptors lost due to retinal degenerative diseases that ultimately lead to blindness. In this biomimetic approach, we are stimulating the retinal neurons using neurotransmitter chemicals, which is fundamentally different from the conventional approach of stimulating the retina electrically.”",
        "Retinal degenerative diseases such as age-related macular degeneration and retinitis pigmentosa affect more than 10 million people in the United States alone, and there are no known cures or effective treatments available yet. Many research groups around the world are working to develop a prosthesis using electrical stimulation as a restorative aid for patients blind from these degenerative diseases.",
        "“Electrical prosthesis has advanced significantly in the last couple of decades and a few such electrical implants are currently in clinical trials, yet it has number of drawbacks; it stimulates all types of cells in the retina indiscriminately, which is not how the retina works naturally,” said Saggere. “That is a serious limitation to restoring natural vision with the current prostheses. Heat generated during electrical stimulation is another issue. And the acuity levels to which vision can be restored with an electrical-based prosthesis is limited.”",
        "Inspired by nature’s complex mechanism of transducing visual information into chemical signals by the photoreceptor cells in the retina, he envisions an unconventional, but rational, approach to restore the lost functionality of photoreceptors: a light modulated chemical interface at the retina.",
        "“Since the chemical-based prosthesis that we are investigating is biomimetic, it offers several advantages over an electrical prosthesis, including potentially enabling more natural vision and better acuity,” said Saggere.",
        "With a long-term goal of developing a chemical-based retinal implant, the objective of the current project is to understand how the retina and retinal neurons respond physiologically to controlled focal presentation of chemicals at the synaptic subsurface of the retina through specially fabricated MEMS and microfluidic devices.",
        "The grant period is from August 2015 to July 2017 and Professor Saggere is collaborating with Professor John Troy, a vision scientist at the Northwestern University.",
        "To learn more, please contact Professor Laxman Saggere here."
    ],
    "out_links": [
        "https://engineering.uic.edu/",
        "http://uic.edu/",
        "https://engineering.uic.edu/undergraduate/",
        "https://engineering.uic.edu/undergraduate/welcome/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/undergraduate/career-outcomes/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/graduate/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://engineering.uic.edu/about/",
        "https://engineering.uic.edu/about/dean/",
        "https://engineering.uic.edu/about/faculty/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/about/alumni/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/about/contact/",
        "http://ecc.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "http://maps.uic.edu/",
        "https://mie.uic.edu/profiles/laxman-saggere/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}