{
    "url": "https://mie.uic.edu/undergraduate/internships-and-jobs/",
    "title": "Internships and Jobs | Department of Mechanical and Industrial Engineering | University of Illinois at Chicago",
    "text": [
        "This page is designed to help mechanical engineering, industrial engineering, and engineering management students focus on the career resources that align with their fields.",
        "Undergraduates are encouraged to complete at least two internships before graduation—for skill development as well as a competitive edge in the full-time job search. The Engineering Career Center (ECC) is here to help you along the way! Visit its site early (and often) to make the most of its resources and dedicated staff.",
        "The mini-profiles below offer a few examples of the thousands of rewarding careers pursued by alumni of UIC’s undergraduate programs in mechanical engineering, industrial engineering, and engineering management.",
        "Industrial Engineer",
        "Universal Parks and Resorts",
        "How do you hope your work will create positive change in the world? By leveraging engineering skills such as labor modeling, six sigma principles, statistical analysis, and other optimization techniques, I hope to make every guest experience smooth and fun! You may not be thinking about it when you go to a theme park, but every aspect of it is engineered with the guest in mind.",
        "Is there an aspect of studying in Chicago in particular that you feel benefited you? Loved the diversity of people’s backgrounds, thoughts, cultures, places of origin. Also, the ability to try something new every day and explore.",
        "Student organizations you were a part of: Institute of Industrial Engineers (IIE, now IISE), Student Alumni Association, Sustainability Fee Advisory Board, National Residence Hall Honorary, and EcoCampus.",
        "One-sentence “Words of wisdom”: “Do not go where the path may lead, go instead where there is no path and leave a trail.” – Ralph Waldo Emerson",
        "Systems Integration and Test Engineer",
        "NASA Jet Propulsion Laboratory",
        "Prior position(s): Systems engineer and test engineer, Honeywell",
        "What’s great about your job? I’m excited to be working on projects that could change the fundamental way we look at the universe. The Jet Propulsion Lab is filled with so many exciting projects, cutting-edge technology, and some of the smartest minds in science and engineering.",
        "Current project: I’ll be working on systems level testing for the Europa Clipper program, set to launch in 2023. The spacecraft will be sent to Jupiter’s moon to study whether or not conditions there could sustain life.",
        "How did your past work prepare you for this? I was able to gain highly transferable skills both as a systems engineer and as a test engineer at Honeywell. My new role at JPL combines both of my past roles at Honeywell while allowing me to learn a new way to apply that knowledge.",
        "Goals: I am looking forward to the build and launch of my first NASA mission and its journey to Jupiter. In the long term, I hope to learn more about the capabilities of the departments within the lab and eventually lead a team of engineers. I have a lot to learn before then, but JPL is a wonderful place to develop as an engineer and explore new opportunities!",
        "Manufacturing Engineer",
        "SpaceX",
        "What are some of your day-to-day tasks? My day-to-day tasks involve a combination of design, fabrication, and development work. From working with vendors on new facilities to developing pressure systems to test the functionality of the Dragon 2 spacecraft, my work varies greatly from day to day.",
        "What’s great about your job? The best part of my job has to be the people I work with. These are some of the most talented and revolutionary thinkers of our time working on world-changing technologies, and I have the pleasure of working with them daily.",
        "How do you hope your work will create positive change in the world? My work supports a team of people dedicated to make humanity multi-planetary; I can’t help but love every minute of it.",
        "Engineering-industry person you admire most and why: Dr. Alexander Yarin. I worked with Yarin for three years. Being mentored by such an accomplished and talented man changed my mind regarding what it means to be an engineer.",
        "Quality Engineer",
        "Illinois Tool Works",
        "What are some of your day-to-day tasks? I manage the ISO quality management system and lead process-improvement projects to improve system quality.",
        "What’s great about your job? The best part of my job is analyzing data to make decisions that directly impact the business.",
        "How did the College of Engineering prepare you for your career? The College of Engineering prepared me for my career by providing me with the necessary problem-solving skills to succeed. It is evident that every course in its curriculum was carefully crafted to teach a specific skillset that is applicable to many different engineering careers.",
        "Is there an aspect of studying in Chicago in particular that you feel benefited you? When it came to applying for internships in the Chicagoland area, attending a university in the city gave me a huge advantage in terms of immediately interviewing after a phone screen.",
        "Fun fact about you that few people are aware of: I have played the violin since I was three years old.",
        "Sales Engineer",
        "Alicona Metrology",
        "What’s great about your job? Traveling to different parts of the nation to meet with engineers and researchers from different areas and learning about a variety of manufacturing processes. I love the fact that on a daily basis I help people solve problems by better understanding their manufactured components.",
        "How did the College of Engineering prepare you for your career? The College of Engineering gave me the knowledge of different aspects of engineering, and with programs such as Interdisciplinary Product Design, I better understand the perspectives of other majors such as design or business with regard to creating a product.",
        "Is there an aspect of studying in Chicago in particular that you feel benefited you? The diversity in a city like Chicago teaches you a lot about other people and the society we live in. This prepares you for future endeavors, as you will interact with other people with different backgrounds all the time.",
        "Coolest thing you’ve done in the past year (engineering-related or not): Visited the 27th country on my list.",
        "Digital Business Integration Consultant",
        "Accenture",
        "What are some of your day-to-day tasks? As a consultant, our work is project-based, so my role varies slightly from project to project. I am typically responsible for leading and integrating solutions across design and development teams, ensuring that the right priorities are being met, and we are delivering a valuable solution to our digital and technology clients.",
        "What’s great about your job? I really enjoy the challenge that my work brings. Working for a company with such a strong digital culture has allowed me to explore a lot of new areas within the industry before they are mainstream, connect with experts in the field, and find a wealth of online artifacts to help me solve whatever challenge is presented to me.",
        "How did the College of Engineering prepare you for your career? The College of Engineering taught me to think critically and it made me a better problem solver. Having this skills and this degree made me feel more confident in my abilities to work in a highly technical environment, it also exposed me to breadth of topics that I would later see in my professional career. The College of Engineering helped me see that anyone can do anything as long as we have the right skills.",
        "One-sentence “Words of wisdom”: Go to class, sign up for every opportunity that is presented to you, and don’t be afraid to tell people about your goals."
    ],
    "out_links": [
        "https://mie.uic.edu/",
        "http://uic.edu/",
        "https://mie.uic.edu/undergraduate/",
        "https://mie.uic.edu/undergraduate/admitted-students/",
        "https://mie.uic.edu/undergraduate/admissions/",
        "https://mie.uic.edu/undergraduate/abet-accreditation/",
        "https://mie.uic.edu/undergraduate/courses/",
        "https://mie.uic.edu/undergraduate/me-major/",
        "https://mie.uic.edu/undergraduate/ie-major/",
        "https://mie.uic.edu/undergraduate/em-major/",
        "https://mie.uic.edu/undergraduate/minors/",
        "https://mie.uic.edu/undergraduate/student-organizations/",
        "https://mie.uic.edu/undergraduate/student-profiles/",
        "https://mie.uic.edu/undergraduate/student-resources/",
        "https://mie.uic.edu/graduate/",
        "https://mie.uic.edu/graduate/admissions/",
        "https://mie.uic.edu/graduate/courses/",
        "https://mie.uic.edu/graduate/international-programs/",
        "https://mie.uic.edu/graduate/masters-programs/",
        "https://mie.uic.edu/graduate/phd-programs/",
        "https://mie.uic.edu/graduate/phd-dissertations/",
        "https://mie.uic.edu/graduate/post-graduation-outcomes/",
        "https://mie.uic.edu/graduate/student-profiles/",
        "https://mie.uic.edu/graduate/resources/",
        "https://mie.uic.edu/research-page/",
        "https://mie.uic.edu/research-page/mie-research-areas/",
        "https://mie.uic.edu/research-page/labs/",
        "https://mie.uic.edu/faculty-and-staff/",
        "https://mie.uic.edu/faculty-and-staff/department-head/",
        "https://mie.uic.edu/faculty-and-staff/faculty/",
        "https://mie.uic.edu/faculty-and-staff/affiliate-faculty/",
        "https://mie.uic.edu/faculty-and-staff/emeritus-faculty/",
        "https://mie.uic.edu/faculty-and-staff/staff/",
        "https://mie.uic.edu/faculty-and-staff/open-positions/",
        "https://mie.uic.edu/mie-news/",
        "https://mie.uic.edu/seminars/",
        "https://mie.uic.edu/about/",
        "https://mie.uic.edu/about/me/",
        "https://mie.uic.edu/about/ie/",
        "https://energyengineering.uic.edu/",
        "https://mie.uic.edu/about/advisory-board/",
        "https://mie.uic.edu/about/contact/",
        "https://mie.uic.edu/about/welcome/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "http://ecc.uic.edu/",
        "https://ecc.uic.edu/freshman-internship-program/",
        "https://mie.uic.edu/research-page/research-experiences-for-undergraduates/",
        "https://sustainability.uic.edu/student-experience/sustainability-fee/",
        "https://housing.uic.edu/getinvolved/",
        "https://sustainability.uic.edu/green-campus/",
        "https://mie.uic.edu/profiles/alexander-l-yarin/",
        "http://www.ipd.uic.edu/IPD/index.php",
        "https://mie.uic.edu/faculty-and-staff/faculty-resources/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}