{
    "url": "https://mie.uic.edu/graduate/international-programs/",
    "title": "International Programs | Department of Mechanical and Industrial Engineering | University of Illinois at Chicago",
    "text": [
        "International programs enhance the classroom experience of all UIC mechanical and industrial engineering students. Students of all nationalities benefit when they learn alongside—and from—classmates with different backgrounds, interests, and goals.",
        "With this perspective in mind, the Department of Mechanical and Industrial Engineering has developed partnerships with other engineering schools in two countries to create a pathway for Chinese and Italian students to study at UIC. They add to the diversity of the UIC student community, where 25 percent of freshmen speak a first language other than English.",
        "Graduation from our international programs puts students in a favorable position for employment. Some choose to apply for visa-granting jobs at companies in Chicago or around the United States, while others decide to return to their home countries. Many students who complete our international programs also opt to go on for a PhD here at UIC or at another U.S. or international university.",
        "This page provides an overview of our China 3+2 and Italy programs. If you are looking for more information for international students at UIC, please visit the university-wide Office of International Services website.",
        "Our 3+2 program allows engineering students from 20 partner universities throughout China to complete their fourth year of undergraduate study at UIC and, if they fulfill the qualifications, remain here for an MS degree. Students who successfully complete the program receive their bachelor’s degree from their home university in China and an MS degree from UIC.",
        "Students apply for this 3+2 program through their home universities. Please note that this program uses a different admissions procedure than the ones described on this website.",
        "Participants in the 3+2 program spend two academic years at UIC. The first year is a nine-month (two-semester) non-degree undergraduate training program in which students take six courses that correspond to what they would have taken in their final undergraduate year at their universities in China. This includes two undergraduate senior design courses. The second year is open to students who have successfully completed the prior year’s training program and who meet minimum requirements for undergraduate GPA and standardized language test scores. Second-year students take nine graduate-level courses toward the MS degree and must earn a minimum GPA of 3.0 to graduate.",
        "More than 140 students from Italy have now graduated from the MS degree program in mechanical engineering that UIC started in collaboration with the Politecnico di Torino in 1999. The program has been so successful that UIC Engineering has decided to add a new program in industrial engineering in collaboration with the Politecnico di Milano, another top technical university in Italy.",
        "Students in the Italy program complete the standard requirements for the MS degree and conduct thesis research. They spend the first semester in Italy, followed by two semesters in residence at UIC. Students enjoy the opportunity to take coursework not offered at their home institution, work in a new research area, improve their English language skills, gain research and work experience on our campus in Chicago, and sometimes obtain an Optional Practical Training visa to work for a U.S. company for a short time after completion of their degree. Some have chosen to remain for a PhD at UIC.",
        "All graduate students in mechanical and industrial engineering have benefited from the exposure to novel research ideas and ways of approaching engineering problems, and from the notable intellectual and research capabilities of the students from this top technical university in Italy. To date, the MIE faculty have forged significant collaborative projects with faculty in Torino in the areas of energy engineering, fluid dynamics, heat transfer, mechanics, and mechatronics.",
        "My experience at UIC was beyond my expectations. I entered as an international student, and I was nervous, excited, and scared at the same time. UIC not only helped me academically, but also helped me get out of my comfort zone. It pushed me to involve myself in extracurricular activities such as the Society of Women Engineers and the American Society of Mechanical Engineers, take part in engineering competitions, and, above all, become a confident person."
    ],
    "out_links": [
        "https://mie.uic.edu/",
        "http://uic.edu/",
        "https://mie.uic.edu/undergraduate/",
        "https://mie.uic.edu/undergraduate/admitted-students/",
        "https://mie.uic.edu/undergraduate/admissions/",
        "https://mie.uic.edu/undergraduate/abet-accreditation/",
        "https://mie.uic.edu/undergraduate/courses/",
        "https://mie.uic.edu/undergraduate/me-major/",
        "https://mie.uic.edu/undergraduate/ie-major/",
        "https://mie.uic.edu/undergraduate/em-major/",
        "https://mie.uic.edu/undergraduate/minors/",
        "https://mie.uic.edu/undergraduate/internships-and-jobs/",
        "https://mie.uic.edu/undergraduate/student-organizations/",
        "https://mie.uic.edu/undergraduate/student-profiles/",
        "https://mie.uic.edu/undergraduate/student-resources/",
        "https://mie.uic.edu/graduate/",
        "https://mie.uic.edu/graduate/admissions/",
        "https://mie.uic.edu/graduate/courses/",
        "https://mie.uic.edu/graduate/masters-programs/",
        "https://mie.uic.edu/graduate/phd-programs/",
        "https://mie.uic.edu/graduate/phd-dissertations/",
        "https://mie.uic.edu/graduate/post-graduation-outcomes/",
        "https://mie.uic.edu/graduate/student-profiles/",
        "https://mie.uic.edu/graduate/resources/",
        "https://mie.uic.edu/research-page/",
        "https://mie.uic.edu/research-page/mie-research-areas/",
        "https://mie.uic.edu/research-page/labs/",
        "https://mie.uic.edu/faculty-and-staff/",
        "https://mie.uic.edu/faculty-and-staff/department-head/",
        "https://mie.uic.edu/faculty-and-staff/faculty/",
        "https://mie.uic.edu/faculty-and-staff/affiliate-faculty/",
        "https://mie.uic.edu/faculty-and-staff/emeritus-faculty/",
        "https://mie.uic.edu/faculty-and-staff/staff/",
        "https://mie.uic.edu/faculty-and-staff/open-positions/",
        "https://mie.uic.edu/mie-news/",
        "https://mie.uic.edu/seminars/",
        "https://mie.uic.edu/about/",
        "https://mie.uic.edu/about/me/",
        "https://mie.uic.edu/about/ie/",
        "https://energyengineering.uic.edu/",
        "https://mie.uic.edu/about/advisory-board/",
        "https://mie.uic.edu/about/contact/",
        "https://mie.uic.edu/about/welcome/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://www.ois.uic.edu/",
        "https://grad.uic.edu/admissions",
        "https://mie.uic.edu/graduate/admissions/funding-and-financial-aid/",
        "https://mie.uic.edu/graduate/admissions/graduate-admissions-faq/",
        "https://mie.uic.edu/graduate/masters-programs/ms-thesis-information/",
        "https://mie.uic.edu/graduate/phd-programs/preliminary-exam/",
        "https://mie.uic.edu/faculty-and-staff/faculty-resources/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}