{
    "url": "https://mie.uic.edu/graduate/student-profiles/",
    "title": "Graduate Student Profiles | Department of Mechanical and Industrial Engineering | University of Illinois at Chicago",
    "text": [
        "Mechanical Engineering, PhD ’20 | India",
        "Why did you choose UIC College of Engineering? I have access to state-of-the-art research facilities and equipment and extensive collaboration with other research labs around the country.",
        "What is your academic focus within your department? Materials development for electrochemical energy storage.",
        "Name one thing you think UIC does better than anywhere else: UIC allows us to start our PhD research right from our first semester. I believe that gives us a head start and gives us more time to work on our thesis.",
        "How do you hope your research will create positive change in the world? My research pertains to developing materials for next-generation rechargeable batteries. The world is in need of more powerful batteries that can be made out of inexpensive, earth-abundant materials. Development of such high-performance energy storage systems will encourage more use of renewable energy sources, and eventually help in reducing our reliance on fossil fuels.",
        "How do you get around? I like to walk, mostly. (Walking on Chicago streets is something I never find boring.)",
        "Industrial Engineering, PhD ’21 | Dhaka, Bangladesh",
        "What is your academic focus within your department? Additive manufacturing (3D printing) and soft robotics",
        "How (and why) did you choose your faculty advisor? I was interested in working on additive manufacturing for my PhD research. Dr. Yayue Pan is a accomplished scientist in this field. I also liked how passionate she is about research and mentoring her students. I initially joined the lab as a summer research volunteer but later interviewed for a permanent PhD position.",
        "What has been the most rewarding part of doing research at UIC? To learn the true essence of graduate research. At the end of my program, I will get a PhD degree, but the learning curve and the hard work have been truly rewarding for me and will be a life-lesson for my professional journey.",
        "How do you hope your research will create positive change in the world? My work on soft robotics will create a novel way to fabricate untethered, multi-scale, multi-modal soft robots. I also show a direct application in controlled drug delivery that can have a positive effect in healthcare.",
        "Favorite place in Chicago: The beaches along Lake Shore Drive.",
        "Mechanical and Industrial Engineering, PhD ’20 | Kolkata, India",
        "What is your academic focus within your department? Development of anti-icing and anti-frosting surfaces for industrial applications.",
        "What has been the most rewarding part of doing research at UIC? Getting published in a very high-impact journal, getting to know great professors, and learning about different skill sets from my advisor.",
        "How do you hope your research will create positive change in the world? My doctoral research is driven by the belief that advanced and radical materials research will be crucial to addressing several of the pressing issues faced by current society, including energy efficiency and sustainability. This involves fundamental and applied research on surface engineering, comprising design, development, and characterization of innovative material systems that control the way materials behave at interfaces to improve energy efficiency in the field of ice-repellency in energy and transportation sector.",
        "Favorite place in Chicago: The Magnificent Mile",
        "Mechanical Engineering, PhD ’20 | India",
        "Name one thing you think UIC does better than anywhere else: UIC has an inclusive atmosphere that benefits students from diverse backgrounds.",
        "What is your academic focus within your department? To build safe, long-lasting batteries to solve the problem of climate change.",
        "What has been the most rewarding part of doing research at UIC? To see research come to fruition, collaborate with top researchers from national laboratories, and contribute to the growing body of active research.",
        "How do you hope your research will create positive change in the world? We are trying to find next-generation battery materials to solve the problem of climate change. By moving toward inexpensive, long-lasting batteries, we can quickly cut down on fossil-fuel consumption.",
        "Favorite place in Chicago: The lakefront trail and beaches. They offer a respite from busy lives.",
        "Mechanical Engineering, MS ’20 | Iran",
        "Why did you choose UIC College of Engineering? UIC has excellent professors and great facilities for doing research.",
        "Name one thing you think UIC does better than anywhere else: Career services.",
        "Looking broadly at your field of study, who is the person you admire the most, and why? Professor Minkowycz, because he has made many significant developments in the heat transfer field.",
        "Place you’re most likely to be found on campus, and why: The Honors College has a quiet room that’s a good spot for studying.",
        "Favorite place in Chicago: Downtown.",
        "Mechanical Engineering, MS ’20 | India",
        "How is UIC preparing you for your future goals? UIC has helped me think outside the box through innovative projects carried out in different courses.",
        "Name one thing you think UIC does better than anywhere else: UIC has given me many opportunities to participate in different activities and events that are designed to be a platform to help students learn new things outside of their academic fields.",
        "What do you hope to be doing right after graduation? I hope to be working in industry research and development.",
        "Favorite place in Chicago: Millennium Park.",
        "Mechanical Engineering, BS ’18, PhD ’22 | Cicero, IL",
        "Name one thing you think UIC does better than anywhere else: Fostering independence. UIC has a great faculty and resources for students to access. At the same time, the curriculum at UIC and research opportunities challenge students to become independent thinkers and to be innovative.",
        "Most challenging engineering project/assignment you’ve conquered so far: Testing surface coatings for antibacterial properties.",
        "Student organizations you’ve joined: The Society of Women Engineers. I’ve enjoyed being a general member as an undergraduate because of the peer support and career opportunities it provides. Recently, I have accepted the role of being GradSWE president and look forward to building connections and the leadership opportunities this new role will bring.",
        "Favorite place in Chicago: The Chicago Lakefront Trail. You can find a lot of other attractions along the way and get a great view of the lake and city.",
        ""
    ],
    "out_links": [
        "https://mie.uic.edu/",
        "http://uic.edu/",
        "https://mie.uic.edu/undergraduate/",
        "https://mie.uic.edu/undergraduate/admitted-students/",
        "https://mie.uic.edu/undergraduate/admissions/",
        "https://mie.uic.edu/undergraduate/abet-accreditation/",
        "https://mie.uic.edu/undergraduate/courses/",
        "https://mie.uic.edu/undergraduate/me-major/",
        "https://mie.uic.edu/undergraduate/ie-major/",
        "https://mie.uic.edu/undergraduate/em-major/",
        "https://mie.uic.edu/undergraduate/minors/",
        "https://mie.uic.edu/undergraduate/internships-and-jobs/",
        "https://mie.uic.edu/undergraduate/student-organizations/",
        "https://mie.uic.edu/undergraduate/student-profiles/",
        "https://mie.uic.edu/undergraduate/student-resources/",
        "https://mie.uic.edu/graduate/",
        "https://mie.uic.edu/graduate/admissions/",
        "https://mie.uic.edu/graduate/courses/",
        "https://mie.uic.edu/graduate/international-programs/",
        "https://mie.uic.edu/graduate/masters-programs/",
        "https://mie.uic.edu/graduate/phd-programs/",
        "https://mie.uic.edu/graduate/phd-dissertations/",
        "https://mie.uic.edu/graduate/post-graduation-outcomes/",
        "https://mie.uic.edu/graduate/resources/",
        "https://mie.uic.edu/research-page/",
        "https://mie.uic.edu/research-page/mie-research-areas/",
        "https://mie.uic.edu/research-page/labs/",
        "https://mie.uic.edu/faculty-and-staff/",
        "https://mie.uic.edu/faculty-and-staff/department-head/",
        "https://mie.uic.edu/faculty-and-staff/faculty/",
        "https://mie.uic.edu/faculty-and-staff/affiliate-faculty/",
        "https://mie.uic.edu/faculty-and-staff/emeritus-faculty/",
        "https://mie.uic.edu/faculty-and-staff/staff/",
        "https://mie.uic.edu/faculty-and-staff/open-positions/",
        "https://mie.uic.edu/mie-news/",
        "https://mie.uic.edu/seminars/",
        "https://mie.uic.edu/about/",
        "https://mie.uic.edu/about/me/",
        "https://mie.uic.edu/about/ie/",
        "https://energyengineering.uic.edu/",
        "https://mie.uic.edu/about/advisory-board/",
        "https://mie.uic.edu/about/contact/",
        "https://mie.uic.edu/about/welcome/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://yayuepan.lab.uic.edu/",
        "https://ecc.uic.edu/",
        "https://mie.uic.edu/profiles/w-j-minkowycz/",
        "https://honors.uic.edu/",
        "https://swe.students.uic.edu/",
        "https://swe.students.uic.edu/gradswe/",
        "https://grad.uic.edu/admissions",
        "https://mie.uic.edu/graduate/admissions/funding-and-financial-aid/",
        "https://mie.uic.edu/graduate/admissions/graduate-admissions-faq/",
        "https://mie.uic.edu/graduate/masters-programs/ms-thesis-information/",
        "https://mie.uic.edu/graduate/phd-programs/preliminary-exam/",
        "https://mie.uic.edu/faculty-and-staff/faculty-resources/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}