{
    "url": "https://mie.uic.edu/graduate/resources/",
    "title": "Graduate Student Resources | Department of Mechanical and Industrial Engineering | University of Illinois at Chicago",
    "text": [
        "All full-time graduate students in must attend events in the Departmental Seminar Series.",
        "Students must register using the ME 595 or IE 595 course code in every fall and spring semester in which they are registered full-time, and students will receive a grade of satisfactory (S) or unsatisfactory (U) for the course.",
        "To track student attendance, there will be a sign-up sheet in the seminar room that all students must sign in advance of the start of the presentation.",
        "Each student is allowed to miss a maximum of one seminar per semester.",
        "Students may petition for individual waivers of this requirement on a semester-by-semester basis. Requests must be approved by the faculty advisor and by the director of graduate studies. Acceptable reasons for a waiver may include the need to be off-campus for MS thesis or doctoral dissertation research or the need to take an essential course outside of the MIE department that is offered during the usual seminar time slot.",
        "Petitions are the formal requests that students make to the department or the Graduate College for a waiver of policies or regulations.",
        "Graduate petition forms are available from the graduate coordinator in the MIE department office.",
        "Petition requests must be clearly and fully stated on the form, which must be signed by the student and endorsed by the student’s advisor. Petitions that are complete in these respects are submitted to the graduate committee for consideration.",
        "Certain petitions, such as the application for transfer of credit, the application for a leave of absence, and the application for an off-semester vacation, require special forms and have separate procedures. Your faculty advisor, the graduate coordinator, and the Graduate College website are good sources of information on these matters.",
        "“Limited standing” is a status designated to certain students at the time of their admission.",
        "Students on limited standing typically must fulfill a number of set requirements by a stated deadline to be granted full standing.",
        "Requirements often include maintaining a grade point average of 4.0 on a scale of 5 (in other words, a B average) for the first 16 semester hours of coursework, but are determined for each individual by the Graduate College and the department.",
        "If the student has maintained the required minimum GPA and has satisfied any other requirements specified at the time of admission, the student will receive a letter from the director of graduate studies with a notification that full standing has been achieved. A copy of this letter is sent to the Graduate College, and records are modified accordingly.",
        "If a student believes that he or she has fulfilled all of the limited conditions, but has not received the aforementioned letter, he or she must immediately request a review by the director of graduate studies.",
        "A student whose limited standing is not changed to full standing cannot graduate.",
        "Students are permitted to repeat a course for credit if:",
        "or",
        "In the latter case, the course may be repeated only once and may be counted only once toward the degree requirements; the original grade continues to be included in the computation of the grade point average. The approval of both the instructor who will offer the course and the director of graduate studies is required.",
        "Parameters for credit transfer",
        "MS students: No more than 8 semester hours in formal coursework may be approved for transfer toward an MS degree.",
        "PhD students: Students entering the PhD program with an MS degree from an accredited institution automatically receive credit for 32 semester hours toward the 108 semester hours required for the PhD. If a student desires transfer credit beyond these 32 semester hours, he or she must submit a petition and follow the steps outlined below (see the “Procedure” section). No more than 8 semester hours of formal coursework beyond the automatic 32 hours may be approved for transfer toward the PhD.",
        "Students admitted with non-degree status: No more than two courses taken by non-degree graduate students may be transferred if the student is later admitted to the Graduate College or to a degree program. As with all credit transfers, grades received in the courses must be A or B.",
        "Students taking a leave of absence: A student who is taking an official leave of absence from UIC and is considering taking graduate coursework at another institution during that leave should consult his or her faculty advisor and the director of graduate studies in advance to determine whether courses may or may not be transferable.",
        "Procedure",
        "A graduate student in a degree-granting program may be granted a leave of absence up to one calendar year (including summer) upon the recommendation of the graduate program and the approval of the Graduate College.",
        "Time spent on an approved leave is not counted toward the degree deadlines.",
        "To request a leave of absence, students must complete a Graduate Petition for Leave of Absence form and obtain all necessary signatures. This form is available from the Graduate College.",
        "A petition for leave must be submitted prior to the 10th day of instruction in the term that begins the period of leave.",
        "Students who return from leave at the expected time should simply register for the term as usual; no special forms are required.",
        "Students who are on leave of absence are not covered by the health and personal accident insurance until they return to campus.",
        "Leave will not be granted to PhD candidates who have passed the preliminary exam unless their programs require an off-campus activity or unless they have documented medical or other extraordinary reasons.",
        "Students may continue to register for graduate courses as long as they remain in good academic standing and make satisfactory academic progress.",
        "The minimal Graduate College academic criterion is that a student must maintain a cumulative grade point average of at least 4.00 (on a scale of 5.00) on all work taken at UIC as a graduate student. Transfer credit is not computed in the cumulative grade point average. If, during two successive terms in residence, the cumulative grade point average is below 4.00 as defined above, the student is placed on probationary status. This warns students that, if their academic record continues to be unsatisfactory, they will not be permitted to register. After three consecutive terms in residence with a cumulative grade point average below 4.00 as defined above, the student will not be eligible for further registration.",
        "Upon admission to graduate study in mechanical or industrial engineering, you will be assigned a temporary faculty advisor by the director of graduate studies. This assignment is made on the basis of your intended field of concentration or on a special interest that you indicated on your application. Your temporary advisor will help you through the first semester of registration and acquaints you with department rules, regulations, and procedures.",
        "MS students are required to select a permanent degree advisor by the end of the first semester, no later than after the completion of 16 semester hours of coursework.",
        "PhD students are required to select permanent degree advisor before the end of the second semester, no later than after the completion of 20 semester hours of coursework.",
        "All students must inform the director of graduate studies of their advisor selection by completing a form available in the MIE department office. The failure to do so may result in delay of graduation.",
        "An advisor may indicate at any time that he or she no longer wishes to retain a student under his or her supervision. Should the advisor decide not to retain the student, he or she must inform the student and the director of graduate studies in writing.",
        "Should a student desire to end the association with his or her advisor, he or she similarly must inform the advisor and the director of graduate studies in writing. The student then must find another eligible member of the MIE department faculty willing to serve as his or her advisor.",
        "There are several aspects to course selection, and two are particularly important:",
        "Whether you meet with your advisor in person or communicate by email, you should review the requirements in the catalog (see links above) before you meet. You should also check the online schedule of courses and decide which classes you think you might want to take. Your advisor will not select courses for you; you should have a list of courses you are considering before you contact your advisor. You should also prepare a list of your questions for your advisor, but please make sure that the answers to those questions are not readily available on the university or department websites.",
        "Here are four pieces of course-selection advice:",
        "First of all, don’t panic! It is completely fine for you to select your courses the week before classes begin, or even during the first week of classes. It is a good idea to attend all classes you may be interested in during the first week of class and then make a final decision about which ones to take for the entire semester.",
        "Do not worry if you don’t hear back immediately from your academic advisor. Remember that faculty members often have significant research and travel commitments during the summer, and as a result, they may not respond quickly to requests for advising. If your advisor does not reply to your request within a week, please email miegrad@uic.edu for assistance.",
        "In general, the answer to this question is no. If your form is purely administrative in nature, please give it to the graduate coordinator in the MIE main office, who can obtain the director of graduate studies’ signature for you. The graduate coordinator will let you know if it is necessary for you to discuss the form with the DGS.",
        "No. MS students in mechanical engineering and industrial engineering may not take Master’s in Energy Engineering courses (those with course codes starting with ENER) toward their degree requirements.",
        "This FAQ is not meant to be exhaustive, but answers to many questions are available throughout this department website or in the UIC graduate catalog for mechanical engineering or industrial engineering.",
        "If you do not find the answers to your questions online, you may contact the graduate coordinator in the main office or email miegrad@uic.edu.",
        "You may also contact your academic advisor with any questions.",
        "UIC is committed to full inclusion and participation of people with disabilities in all aspects of university life. Students who face or anticipate disability-related barriers while at UIC should connect with the Disability Resource Center (DRC) on the web at drc.uic.edu, by email at drc@uic.edu, or by phone at (312) 413-2183 to create a plan for reasonable accommodations.",
        "In order to receive accommodations, students must disclose disability to the DRC, complete an interactive registration process with the DRC, and provide their course instructor with a Letter of Accommodation. Course instructors in receipt of a Letter of Accommodation will work with the student and the DRC to implement approved accommodations."
    ],
    "out_links": [
        "https://mie.uic.edu/",
        "http://uic.edu/",
        "https://mie.uic.edu/undergraduate/",
        "https://mie.uic.edu/undergraduate/admitted-students/",
        "https://mie.uic.edu/undergraduate/admissions/",
        "https://mie.uic.edu/undergraduate/abet-accreditation/",
        "https://mie.uic.edu/undergraduate/courses/",
        "https://mie.uic.edu/undergraduate/me-major/",
        "https://mie.uic.edu/undergraduate/ie-major/",
        "https://mie.uic.edu/undergraduate/em-major/",
        "https://mie.uic.edu/undergraduate/minors/",
        "https://mie.uic.edu/undergraduate/internships-and-jobs/",
        "https://mie.uic.edu/undergraduate/student-organizations/",
        "https://mie.uic.edu/undergraduate/student-profiles/",
        "https://mie.uic.edu/undergraduate/student-resources/",
        "https://mie.uic.edu/graduate/",
        "https://mie.uic.edu/graduate/admissions/",
        "https://mie.uic.edu/graduate/courses/",
        "https://mie.uic.edu/graduate/international-programs/",
        "https://mie.uic.edu/graduate/masters-programs/",
        "https://mie.uic.edu/graduate/phd-programs/",
        "https://mie.uic.edu/graduate/phd-dissertations/",
        "https://mie.uic.edu/graduate/post-graduation-outcomes/",
        "https://mie.uic.edu/graduate/student-profiles/",
        "https://mie.uic.edu/research-page/",
        "https://mie.uic.edu/research-page/mie-research-areas/",
        "https://mie.uic.edu/research-page/labs/",
        "https://mie.uic.edu/faculty-and-staff/",
        "https://mie.uic.edu/faculty-and-staff/department-head/",
        "https://mie.uic.edu/faculty-and-staff/faculty/",
        "https://mie.uic.edu/faculty-and-staff/affiliate-faculty/",
        "https://mie.uic.edu/faculty-and-staff/emeritus-faculty/",
        "https://mie.uic.edu/faculty-and-staff/staff/",
        "https://mie.uic.edu/faculty-and-staff/open-positions/",
        "https://mie.uic.edu/mie-news/",
        "https://mie.uic.edu/seminars/",
        "https://mie.uic.edu/about/",
        "https://mie.uic.edu/about/me/",
        "https://mie.uic.edu/about/ie/",
        "https://energyengineering.uic.edu/",
        "https://mie.uic.edu/about/advisory-board/",
        "https://mie.uic.edu/about/contact/",
        "https://mie.uic.edu/about/welcome/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://my.uic.edu/uPortal/f/welcome/normal/render.uP",
        "http://mie.uic.edu/graduate/courses/",
        "https://drc.uic.edu/",
        "https://catalog.uic.edu/gcat/course-descriptions/ener/",
        "https://ecc.uic.edu/",
        "http://mie.uic.edu/graduate/admissions/funding-and-financial-aid/",
        "https://catalog.uic.edu/gcat/graduate-study/graduate-study/",
        "https://grad.uic.edu/graduate-student-forms",
        "http://grad.uic.edu/",
        "https://catalog.uic.edu/gcat/course-descriptions/ie/",
        "https://catalog.uic.edu/gcat/colleges-schools/engineering/ie/ms/",
        "https://catalog.uic.edu/gcat/colleges-schools/engineering/ie/phd/",
        "https://ehso.uic.edu/",
        "https://catalog.uic.edu/gcat/course-descriptions/me/",
        "https://catalog.uic.edu/gcat/colleges-schools/engineering/me/ms/",
        "https://catalog.uic.edu/gcat/colleges-schools/engineering/me/phd/",
        "http://mie.uic.edu/room/",
        "https://grad.uic.edu/",
        "https://catalog.uic.edu/gcat/colleges-schools/engineering/me/",
        "https://catalog.uic.edu/gcat/colleges-schools/engineering/ie/",
        "https://grad.uic.edu/admissions",
        "https://mie.uic.edu/graduate/admissions/funding-and-financial-aid/",
        "https://mie.uic.edu/graduate/admissions/graduate-admissions-faq/",
        "https://mie.uic.edu/graduate/masters-programs/ms-thesis-information/",
        "https://mie.uic.edu/graduate/phd-programs/preliminary-exam/",
        "https://mie.uic.edu/faculty-and-staff/faculty-resources/",
        "https://uic.edu/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}