{
    "url": "https://csun.uic.edu/",
    "title": "CSUN - Complex and Sustainable Urban Networks Laboratory",
    "text": [
        "NEWS",
        "Welcome to the website of the complex and sustainable urban networks (CSUN) laboratory.",
        "We live in a fascinating world and we have some significant challenges to overcome. The mission of CSUN is to advance scientific knowledge and create software for the design of smart, sustainable, and resilient cities. This website aims to describe the activities going on within CSUN, but we also have many projects that are about to start, and we invite you to come back frequently.",
        "",
        "Latest News",
        "All urban infrastructure systems “live” in the same space and all are interrelated, so why do engineers and planners design them separately? One reason is that we all become overly specialized and simply do not know about other systems. As a result, roads are seen as traffic carriers by transport engineers and as open channels by water resources engineers, but the reality is that they are both and so much more.",
        "Through 12 chapters (see table of contents), learn about all urban infrastructure systems with Urban Engineering for Sustainability (MIT Press, 656 pages) written by CSUN Director Sybil Derrible. This textbook introduces urban infrastructure from an engineering perspective, with an emphasis on sustainability. Bringing together both fundamental principles and practical knowledge from civil engineering, environmental engineering, urban planning, electrical engineering, mechanical engineering, and computer science, the book transcends disciplinary boundaries by viewing urban infrastructures as integrated networks.",
        "The text devotes a chapter to each of five engineering systems: electricity, water, transportation, buildings, and solid waste. Other chapters present a formal definition of sustainability; discuss population forecasting techniques; offer a history of urban planning, from the Neolithic era to Kevin Lynch and Jane Jacobs; define and discuss urban metabolism and infrastructure integration, reviewing system interdependencies; and describe the new science of cities—that draws on complexity theory—and machine learning.",
        "Throughout, a hypothetical city state, Civitas, is used to explain and illustrate the concepts covered. Each chapter includes working examples and problem sets. An appendix offers tables, diagrams, and conversion factors.",
        "The book can be used in advanced undergraduate and graduate courses in civil engineering and as a reference for practitioners. It can also be helpful in preparation for the Fundamentals of Engineering (FE) and Principles and Practice of Engineering (PE) exams.",
        "The book cover is of Tokyo (Japan) and was taken by CSUN Director Sybil Derrible. See the full version here.",
        "Feel free to contact CSUN Director Sybil Derrible if you have any questions.",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    "out_links": [
        "https://csun.uic.edu/mission.html",
        "https://csun.uic.edu/team.html",
        "https://derrible.people.uic.edu/gallery.html"
    ]
}