{
    "url": "https://derrible.people.uic.edu/",
    "title": "home",
    "text": [
        "Sybil Derrible, Ph.D.",
        "derrible @ uic . edu",
        "",
        "Smart, Sustainable, and Resilient Cities",
        "Urban Engineer | Complexity and Data Scientist",
        "",
        "Welcome to my personal website. My name is Sybil Derrible, I am an Associate Professor of Sustainable Infrastructure Systems in the Civil and Materials Engineering Department at the University of Illinois at Chicago (UIC), and the Director of the Complex and Sustainable Urban Networks (CSUN) Lab. I am also a Research Associate Professor with the Institute of Environmental Science and Policy, I have a courtesy appointment in the Department of Computer Science, and I am a faculty fellow at the Honors College at UIC.",
        "Make sure to check  the Complex and Sustainable Urban Networks (CSUN) Lab website!",
        "If you have ever traveled to Paris, you probably remember bustling streets, sidewalks too small to accommodate an incessant flow of pedestrians, noise and fumes from cars and trucks that leave you exhausted at the end of the day. But Paris has changed a lot since mid-March 2020. With the COVID-19 pandemic, the French government has implemented strong confinement measures that have left the city streets across France virtually empty. I took this picture in late March 2020 (during my much anticipated sabbatical that is now being spent indoors). We can see the famous free-standing colonnade of the Louvre museum designed primarily by Claude Perrault. We can also see the Rue de Rivoli that is normally full of energetic shoppers and angry drivers. But now they are empty. I am not going to lie. Having short walks around a silent Paris and breathing clean air has been quite enjoyable... plus, a report has shown significant drops in energy and water consumption and solid waste generation... but Paris is not Paris without its bustling streets. Paris is not Paris without its packed cafés and terraces. The confinement is a great reminder that it is not the infrastructure that brings life to a city but its people.",
        "Click on the picture to see a higher resolution photo.",
        "",
        "",
        "Colonnade du Louvre et Rue de Rivoli, Paris, France",
        "",
        "Research interests: My long-term interests include the planning, design and modeling of urban infrastructure. More particularly, I look at the geometric and topological network feature of infrastructure, which is a vital component of \"smart cities.\" From buildings, water/wastewater, electricity, gas, telecom, transport, and even solid waste, all are part of a nexus of co-dependent and ubiquitous elements of infrastructure that is critical to our cities, acting as a significant generator of economic activity and social development. My main goal is to redefine infrastructure planning and design, and develop new policies and design practices to address the challenges of the 21st century.",
        "",
        ""
    ],
    "out_links": [
        "https://derrible.people.uic.edu/dataviz.html",
        "https://derrible.people.uic.edu/hobbies.html",
        "https://derrible.people.uic.edu/services.html",
        "https://derrible.people.uic.edu/gallery.html",
        "https://derrible.people.uic.edu/education.html",
        "https://derrible.people.uic.edu/bio.html",
        "https://derrible.people.uic.edu/index.html",
        "https://derrible.people.uic.edu/pubs.html",
        "https://derrible.people.uic.edu/work.html",
        "https://derrible.people.uic.edu/funding.html",
        "https://derrible.people.uic.edu/projects.html",
        "https://derrible.people.uic.edu/links.html",
        "https://derrible.people.uic.edu/contact.html",
        "https://derrible.people.uic.edu/membership.html",
        "https://derrible.people.uic.edu/teaching.html",
        "http://www.cme.uic.edu/",
        "http://www.uic.edu/",
        "http://csun.uic.edu/",
        "http://www.uic.edu/depts/ovcr/iesp/",
        "https://www.cs.uic.edu/",
        "https://www.honors.uic.edu/"
    ]
}