{
    "url": "https://mie.uic.edu/about/ie/",
    "title": "UIC Industrial Engineering | Department of Mechanical and Industrial Engineering | University of Illinois at Chicago",
    "text": [
        "This field has the breadth—and depth—to take you places.",
        "At its core, industrial engineering is about improving processes.",
        "Industrial engineers develop an ability to spot inefficiencies and fix them. They know how to optimize.",
        "How? They have completed a course of study—like the one we offer here at UIC—that gives them a command of analytics, applications, logistics, and systems. An industrial engineering degree gives you the ability to gather and process data, integrate it all into \"the big picture,\" and come up with solutions that allow people to work better, faster, and smarter.",
        "Systems engineering",
        "Use a process of discovery and exploration to devise the best possible system to meet a need or perform a desired function.",
        "Supply chain management",
        "Oversee the sourcing of raw materials and their transformation into goods and services that people use everyday.",
        "Artificial intelligence",
        "Explore ways to apply artificial intelligence to familiar processes so that those processes lead to better, more accurate outcomes.",
        "Advanced manufacturing",
        "Determine the optimal ways to create products for all sectors—including things used by consumers and things used by industry.",
        "Data analytics",
        "Harness the power of data to help people make more informed decisions about what to do and how to do it.",
        "Healthcare",
        "Come up with systems that make it easier for doctors, nurses, and other providers to do their jobs, leading to better care for patients.",
        "Financial technology",
        "Use analytical and mathematical tools to address financial issues, devise innovative financial products, and identify good investments.",
        "Safety engineering",
        "Ensure that systems across a wide variety of industries are safe for people to use and behave as needed even when a component fails.",
        "Human factors"