{
    "url": "https://ece.uic.edu/undergraduate/internships-and-jobs/",
    "title": "Internships and Jobs | Department of Electrical and Computer Engineering | University of Illinois at Chicago",
    "text": [
        "This page is designed to help electrical engineering, computer engineering, and engineering physics students focus on the career resources that align with their fields. Undergraduates are encouraged to complete at least two internships before graduation—for skill development as well as a competitive edge in the full-time job search. The Engineering Career Center (ECC) is here to help you along the way! Visit its site early (and often) to make the most of its resources and dedicated staff.",
        "The mini-profiles below offer a few examples of the thousands of rewarding careers pursued by alumni of UIC’s undergraduate programs in electrical engineering and computer engineering.",
        "Systems Engineer",
        "Dell",
        "What’s great about your job? Working in a big company can be overwhelming, but I appreciate the opportunity to learn about a variety of products and technologies without needing to change jobs. Getting to work with people who have 15 years of experience is a very valuable experience, too. You get to learn from the people who developed a lot of great technologies and have so much knowledge to share.",
        "Why did you choose UIC? I based my decision on the classes that were offered from different schools. I was interested in UIC’s computer engineering curriculum. My former professors have impressive engineering backgrounds, and I am honored I got to learn from them.",
        "What was the most valuable student organization you joined, and why? Being a part of the Society of Women Engineers (SWE) was one of the best experiences at UIC. I got to be part of a community of girls whom I still keep in contact with, and I helped other young girls get introduced to engineering. I got my current job through the SWE career fair and will always be thankful for the support this organization gave me.",
        "Would you recommend the College of Engineering to new applicants? If so, why? Choosing UIC gave me valuable skills and opened many doors for me. If you are hardworking and engineering is your passion, I would strongly recommend it and encourage everyone to give engineering a chance.",
        "Systems Integration/Test Engineer",
        "Lockheed Martin Corporation",
        "What are some of your day-to-day tasks? I meet and collaborate with other engineers and planners to achieve set goals, develop integration and test processes for various system components, and create test and validation procedures for various test equipment.",
        "What’s great about your job? Learning new things on the job and meeting many different types of people in the field. Also, I have a flexible schedule with every other Friday off work.",
        "What was the most valuable student organization you joined, and why? The most valuable student organization I joined was the Society of Asian Scientists and Engineers because it helped me to meet other students in the field and led me to my first job out of college.",
        "Fun fact about you that few people are aware of: I am a second-degree black belt in Tae Kwon Do.",
        "Hardware Engineer",
        "Northrop Grumman",
        "What are some of your day-to-day tasks? Testing hardware in the lab, writing test procedures, assisting in the design process, and other things!",
        "Why did you choose UIC? I chose UIC because of the many opportunities the College of Engineering offered. One in particular is the Guaranteed Paid Internship Program. I don’t think any other school offers internships to students after their first year of college, and it helps students get that first internship, which can be the hardest to get!",
        "What was your favorite course? ECE 412 Introduction to Filter Synthesis.",
        "Engineering-industry person you admire most, and why: Edith Clarke, the first female electrical engineer!",
        "One-sentence “Words of wisdom” to share with students: Get involved with student organizations and take advantage of all opportunities the college gives you!",
        ""
    ],
    "out_links": [
        "https://ece.uic.edu/",
        "http://uic.edu/",
        "https://ece.uic.edu/undergraduate/",
        "https://ece.uic.edu/undergraduate/admitted-students/",
        "https://ece.uic.edu/undergraduate/undergraduate-admissions/",
        "https://ece.uic.edu/undergraduate/accreditation/",
        "https://ece.uic.edu/undergraduate/ce-major/",
        "https://ece.uic.edu/undergraduate/ee-major/",
        "https://ece.uic.edu/undergraduate/ep-major/",
        "https://ece.uic.edu/undergraduate/courses/",
        "https://ece.uic.edu/undergraduate/minors-in-ece/",
        "https://ece.uic.edu/undergraduate/student-organizations/",
        "https://ece.uic.edu/undergraduate/student-profiles/",
        "https://ece.uic.edu/undergraduate/student-resources/",
        "https://ece.uic.edu/graduate/",
        "https://ece.uic.edu/graduate/admitted-graduate-students/",
        "https://ece.uic.edu/graduate/admissions/",
        "https://ece.uic.edu/graduate/courses/",
        "https://ece.uic.edu/graduate/ms-program/",
        "https://ece.uic.edu/graduate/phd-program/",
        "https://ece.uic.edu/graduate/phd-dissertations/",
        "https://ece.uic.edu/graduate/post-graduation-outcomes/",
        "https://ece.uic.edu/graduate/student-profiles/",
        "https://ece.uic.edu/graduate/student-resources/",
        "https://ece.uic.edu/ece-research/",
        "https://ece.uic.edu/ece-research/areas/",
        "https://ece.uic.edu/ece-research/featured-research/",
        "https://ece.uic.edu/ece-research/labs/",
        "https://ece.uic.edu/ece-research/reus/",
        "https://ece.uic.edu/ece-research/sponsors/",
        "https://ece.uic.edu/faculty-and-staff/",
        "https://ece.uic.edu/faculty-and-staff/department-head/",
        "https://ece.uic.edu/faculty-and-staff/faculty/",
        "https://ece.uic.edu/faculty-and-staff/emeritus-faculty/",
        "https://ece.uic.edu/faculty-and-staff/adjunct-faculty/",
        "https://ece.uic.edu/faculty-and-staff/professional-organizations/",
        "https://ece.uic.edu/faculty-and-staff/faculty-resources/",
        "https://ece.uic.edu/faculty-and-staff/staff/",
        "https://ece.uic.edu/faculty-and-staff/open-positions/",
        "https://ece.uic.edu/ece-news/",
        "https://ece.uic.edu/ece-events/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "http://ecc.uic.edu/",
        "https://ecc.uic.edu/",
        "http://swe.engr.uic.edu/",
        "https://ecc.uic.edu/students/freshman-internship-program/",
        "https://catalog.uic.edu/all-course-descriptions/ece/",
        "https://ece.uic.edu/contact/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}