{
    "url": "https://ece.uic.edu/graduate/admitted-graduate-students/",
    "title": "Admitted Graduate Students | Department of Electrical and Computer Engineering | University of Illinois at Chicago",
    "text": [
        "Congratulations on your admission to the electrical and computer engineering department at UIC! Our department provides collaborative research opportunities and is dedicated to the pursuit of excellence in electrical and computer engineering education and research. We offer courses spanning many areas in electrical and computer engineering.",
        "Our faculty has a broad range of expertise and many professional achievements. Nearly all of our full professors are IEEE fellows. Some have served as presidents or editors of various IEEE societies, and others have earned the prestigious CAREER and Young Investigator Awards from the National Science Foundation and other federal agencies.",
        "The UIC Engineering Career Center offers various opportunities and services. If you want to gain practical work experience before graduation, you can apply for a co-op or internship. You can also take advantage of résumé workshops, mock interviews, and career fairs offered by the college.",
        "ECE offers you an outstanding graduate program. We hope you will become a member of the ECE family.",
        "The next step in your graduate career is to familiarize yourself with information that will help you become a successful new student in ECE. This page is designed to give incoming master’s and PhD students easy access to the resources you need to get started at UIC. If, after reading this page, you still have any questions about joining us at UIC, please contact our student affairs office at ecestudentaffairs@uic.edu. We are happy to help you and look forward to meeting you!",
        "Visit our Admitted Student Guide for important information and next steps in the matriculation process, including activating your UIC account and accessing the my.UIC.edu portal. You will need your university identification number (UIN) and assigned “token.” Once you have activated your my.UIC account, you will be able to manage all aspects of your education at UIC through this site. The portal has information on UIC e-mail, registration, academic records, financial records, and more.",
        "All students should plan on attending the Graduate College orientation and the ECE new graduate student orientation in August. Registration is required for the Graduate College New Student Orientation. Notification of the ECE New Graduate Student Orientation will sent by email.",
        "International students on a visa can enter the country 30 days prior to the start of the term. We strongly suggest you arrive early enough to allow plenty of time to find housing, register for classes and get acclimated to campus. International students are required to attend an additional Office of International Services (OIS) student orientation.",
        "Departmental advising is not required for registration. Students are responsible for reading the graduate program information and selecting courses for which they have the background. Please review prerequisites when selecting coursework. Students who have specific questions on course content should consult with the appropriate course instructor directly. Students who experience registration issues or need clarification on program rules may contact the student affairs office.",
        "All of our graduate courses are geared for students with an undergraduate degree in electrical and computer engineering or an equivalent understanding. Rules and minimum requirements for class levels will be discussed during the mandatory ECE graduate student orientation.",
        "New ECE graduate students have to attend a number of orientation events depending on their specific personal situations. The orientation sessions include:",
        "All new ECE graduate students are strongly encouraged to attend this session. Degree requirements, department policies, student expectations, and other important topics are covered in this session. This orientation is held only once per year, prior to the start of the fall semester.",
        "A confirmation of date and location will be sent by the ECE student affairs office to new students. Students who start in the spring semester must attend this orientation in the fall after they begin at UIC.",
        "This orientation is conducted by UIC’s International Teaching Assistant Program and is mandatory for ALL new TAs. New international TAs will attend the OIS ‘New International Student Summit’ on the same day but will be dismissed in time to attend the TA orientation. Information, including dates and times, is updated on the ITAP website.",
        "UIC’s Office of International Services (OIS) runs an orientation program that is mandatory for all new international students. There is an orientation fee for this program, which is charged to international students’ accounts. Visit the OIS website for information and schedules.",
        "UIC’s Graduate College holds an orientation session for new graduate students from across UIC’s colleges each fall. There is no session in the spring term. Limited spaces are available for this orientation, which has no fee, and registration is required. The ECE department highly recommends that new graduate students choose to attend. Learn more on the Graduate College orientation page."
    ],
    "out_links": [
        "https://ece.uic.edu/",
        "http://uic.edu/",
        "https://ece.uic.edu/undergraduate/",
        "https://ece.uic.edu/undergraduate/admitted-students/",
        "https://ece.uic.edu/undergraduate/undergraduate-admissions/",
        "https://ece.uic.edu/undergraduate/accreditation/",
        "https://ece.uic.edu/undergraduate/ce-major/",
        "https://ece.uic.edu/undergraduate/ee-major/",
        "https://ece.uic.edu/undergraduate/ep-major/",
        "https://ece.uic.edu/undergraduate/courses/",
        "https://ece.uic.edu/undergraduate/internships-and-jobs/",
        "https://ece.uic.edu/undergraduate/minors-in-ece/",
        "https://ece.uic.edu/undergraduate/student-organizations/",
        "https://ece.uic.edu/undergraduate/student-profiles/",
        "https://ece.uic.edu/undergraduate/student-resources/",
        "https://ece.uic.edu/graduate/",
        "https://ece.uic.edu/graduate/admissions/",
        "https://ece.uic.edu/graduate/courses/",
        "https://ece.uic.edu/graduate/ms-program/",
        "https://ece.uic.edu/graduate/phd-program/",
        "https://ece.uic.edu/graduate/phd-dissertations/",
        "https://ece.uic.edu/graduate/post-graduation-outcomes/",
        "https://ece.uic.edu/graduate/student-profiles/",
        "https://ece.uic.edu/graduate/student-resources/",
        "https://ece.uic.edu/ece-research/",
        "https://ece.uic.edu/ece-research/areas/",
        "https://ece.uic.edu/ece-research/featured-research/",
        "https://ece.uic.edu/ece-research/labs/",
        "https://ece.uic.edu/ece-research/reus/",
        "https://ece.uic.edu/ece-research/sponsors/",
        "https://ece.uic.edu/faculty-and-staff/",
        "https://ece.uic.edu/faculty-and-staff/department-head/",
        "https://ece.uic.edu/faculty-and-staff/faculty/",
        "https://ece.uic.edu/faculty-and-staff/emeritus-faculty/",
        "https://ece.uic.edu/faculty-and-staff/adjunct-faculty/",
        "https://ece.uic.edu/faculty-and-staff/professional-organizations/",
        "https://ece.uic.edu/faculty-and-staff/faculty-resources/",
        "https://ece.uic.edu/faculty-and-staff/staff/",
        "https://ece.uic.edu/faculty-and-staff/open-positions/",
        "https://ece.uic.edu/ece-news/",
        "https://ece.uic.edu/ece-events/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://ecc.uic.edu/",
        "https://admissions.uic.edu/graduate-professional/application-process/newly-admitted-students",
        "https://my.uic.edu/uPortal/f/welcome/normal/render.uP",
        "https://grad.uic.edu/graduate-college-new-student-orientation",
        "https://www.ois.uic.edu/cms/one.aspx?pageId=213600&portalId=1581",
        "https://www.ois.uic.edu/",
        "http://idcenter.uic.edu/",
        "http://idcenter.uic.edu/cta-u-pass/",
        "http://grad.uic.edu/",
        "https://www.ois.uic.edu/resources/social_security_number",
        "https://www.ois.uic.edu/resources/money__banking",
        "https://grad.uic.edu/campus-wide-new-ta-orientation",
        "http://grad.uic.edu/graduate-college-new-student-orientation",
        "https://grad.uic.edu/admissions",
        "https://ece.uic.edu/graduate/admissions/financial-aid-and-funding/",
        "https://ece.uic.edu/graduate/admissions/graduate-admissions-faq/",
        "https://ece.uic.edu/graduate/phd-program/qualifying-examination/",
        "https://ece.uic.edu/graduate/phd-program/preliminary-examination/",
        "https://ece.uic.edu/graduate/phd-program/dissertation-process/",
        "https://ece.uic.edu/contact/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}