{
    "url": "https://ece.uic.edu/graduate/ms-program/",
    "title": "MS Program | Department of Electrical and Computer Engineering | University of Illinois at Chicago",
    "text": [
        "The MS program in electrical and computer engineering requires 36 to 40 semester hours of study. How you earn those credits—and what your academic experience is like—depends on whether you select the thesis option or the coursework-only option. Both are explained on this page.",
        "Academic tracks: The ECE department has identified groups of courses that can help guide your academic planning based on the areas of electrical and computer engineering in which you seek to specialize. You can find descriptions of each track and its associated courses on this page.",
        "Departmental seminars: A vast amount of learning takes place outside of traditional courses. ECE arranges regular seminars that give students the opportunity to hear about research advances that are being pioneered by UIC Engineering faculty and doctoral students as well as scholars from outside the university. MS students are required to enroll in a zero-credit course called Departmental Seminar (ECE 595) and attend these sessions for at least one semester of their time in the program. This is an important part of the academic experience at the graduate level.",
        "Get to know UIC ECE! Our MS degree booklet offers an overview of our master’s-level courses, students, alumni, and job placements.",
        "The thesis option is ideal for MS students who are interested in conducting research. This option is strongly advised if you may be interested in pursuing a PhD in the future.",
        "Researching and writing a master’s thesis is an academically intensive process that takes the place of 8 credits of traditional coursework. Students work with a faculty advisor to choose a topic of interest, engage in high-level study of that topic, and develop a paper that may be suitable for submission to a conference or journal.",
        "The thesis experience provides definition to your master’s degree experience and can bolster your application for jobs or doctoral-level study by demonstrating your capabilities.",
        "In the thesis option, students must earn 36 credit hours: 8 credits in ECE 598 MS Thesis Research and 28 credit hours from coursework. There is no comprehensive examination.",
        "For thesis students, at least 12 of your traditional coursework credits must come from courses at the 500 level, excluding ECE 596, ECE 598, and ECE 599. MS thesis students who concentrate in computer engineering may fulfill part of this requirement with up to 4 hours of 500-level graduate coursework in the computer science department (excluding CS 595, CS 596, CS 597, CS 598, and CS 599) with prior ECE department approval.",
        "Of your remaining 16 coursework credits, 12 must be ECE courses. You can apply up to 4 credit hours of non-ECE graduate coursework (which usually translates to one course) toward your degree, as long as you get departmental approval before enrolling. For computer engineering students, any 4 hours of coursework in the computer science department are considered separate from these 4 allowable non-ECE hours.",
        "Stefano Castagneri",
        "Recognizing Collaboration Intent to Control Physical Human-Robot Interaction",
        "Ajita Singh",
        "Energy-Aware Computation in Mobile Devices",
        "Akram Saeed",
        "Location-Based Assistant on Android Platform",
        "Subhajit Ghosh",
        "Vanadium Dioxide Nanowire Functional Devices",
        "Elisa Fevola",
        "Greedy Algorithm for Black-Box Parameterized Modeling of Electromagnetic Structures",
        "Sina Haj Alizad",
        "A Nonparametric Cumulative Distribution Function Estimation and Random Number Generator Circuit",
        "In the coursework-only option, 40 credit hours are required, all of which is earned from coursework.",
        "Of these 40 credit hours, 16 must be from ECE courses at the 500 level, excluding ECE 596, ECE 598, and ECE 599. There is one important exception to this rule: coursework-only MS students who are concentrating in computer engineering may substitute up to 4 credit hours of 500-level ECE coursework with 400-level ECE coursework as long as they replace the same number of hours of non-ECE coursework with 500-level coursework in the computer science department (excluding CS 595, CS 596, CS 597, CS 598, and CS 599), with prior ECE department approval.",
        "Of the remaining 24 coursework credits, 16 must be ECE courses. You can enroll in up to 8 credit hours of courses outside of the ECE department, as long as you get prior departmental approval before you enroll in those classes.",
        "There is no comprehensive examination in the coursework-only option.",
        "Whether you choose the thesis option or the coursework-only option, an MS in electrical and computer engineering from UIC will prepare you to compete for jobs in industry, research positions, or doctoral study."
    ],
    "out_links": [
        "https://ece.uic.edu/",
        "http://uic.edu/",
        "https://ece.uic.edu/undergraduate/",
        "https://ece.uic.edu/undergraduate/admitted-students/",
        "https://ece.uic.edu/undergraduate/undergraduate-admissions/",
        "https://ece.uic.edu/undergraduate/accreditation/",
        "https://ece.uic.edu/undergraduate/ce-major/",
        "https://ece.uic.edu/undergraduate/ee-major/",
        "https://ece.uic.edu/undergraduate/ep-major/",
        "https://ece.uic.edu/undergraduate/courses/",
        "https://ece.uic.edu/undergraduate/internships-and-jobs/",
        "https://ece.uic.edu/undergraduate/minors-in-ece/",
        "https://ece.uic.edu/undergraduate/student-organizations/",
        "https://ece.uic.edu/undergraduate/student-profiles/",
        "https://ece.uic.edu/undergraduate/student-resources/",
        "https://ece.uic.edu/graduate/",
        "https://ece.uic.edu/graduate/admitted-graduate-students/",
        "https://ece.uic.edu/graduate/admissions/",
        "https://ece.uic.edu/graduate/courses/",
        "https://ece.uic.edu/graduate/phd-program/",
        "https://ece.uic.edu/graduate/phd-dissertations/",
        "https://ece.uic.edu/graduate/post-graduation-outcomes/",
        "https://ece.uic.edu/graduate/student-profiles/",
        "https://ece.uic.edu/graduate/student-resources/",
        "https://ece.uic.edu/ece-research/",
        "https://ece.uic.edu/ece-research/areas/",
        "https://ece.uic.edu/ece-research/featured-research/",
        "https://ece.uic.edu/ece-research/labs/",
        "https://ece.uic.edu/ece-research/reus/",
        "https://ece.uic.edu/ece-research/sponsors/",
        "https://ece.uic.edu/faculty-and-staff/",
        "https://ece.uic.edu/faculty-and-staff/department-head/",
        "https://ece.uic.edu/faculty-and-staff/faculty/",
        "https://ece.uic.edu/faculty-and-staff/emeritus-faculty/",
        "https://ece.uic.edu/faculty-and-staff/adjunct-faculty/",
        "https://ece.uic.edu/faculty-and-staff/professional-organizations/",
        "https://ece.uic.edu/faculty-and-staff/faculty-resources/",
        "https://ece.uic.edu/faculty-and-staff/staff/",
        "https://ece.uic.edu/faculty-and-staff/open-positions/",
        "https://ece.uic.edu/ece-news/",
        "https://ece.uic.edu/ece-events/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://ece.uic.edu/graduate/tracks/",
        "http://cs.uic.edu/",
        "https://admissions.uic.edu/graduate-professional/apply",
        "https://grad.uic.edu/admissions",
        "https://ece.uic.edu/graduate/admissions/financial-aid-and-funding/",
        "https://ece.uic.edu/graduate/admissions/graduate-admissions-faq/",
        "https://ece.uic.edu/graduate/phd-program/qualifying-examination/",
        "https://ece.uic.edu/graduate/phd-program/preliminary-examination/",
        "https://ece.uic.edu/graduate/phd-program/dissertation-process/",
        "https://ece.uic.edu/contact/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}