{
    "url": "https://ece.uic.edu/graduate/student-profiles/",
    "title": "Student Profiles | Department of Electrical and Computer Engineering | University of Illinois at Chicago",
    "text": [
        "Electrical and Computer Engineering, PhD ’20 | India",
        "What is your academic focus within your department? My research interests are in the field of computer vision and adversarial machine learning. Currently, I am developing robust deep learning models for computer vision tasks.",
        "Why did you choose UIC? UIC’s College of Engineering has an exceptional research history in my domain. It also provides utmost flexibility and top-class research facilities for PhD graduates.",
        "What has been the most rewarding part of doing research at UIC? The research exposure I received at UIC aided in landing me with opportunities to work with leading research organizations like Robert Bosch and Kitware Inc. Furthermore, I was able to collaborate with other universities and apply my UIC research work to its full potential.",
        "How do you hope your research will create positive change in the world? Artificial intelligence has impacted various fields, such as computer vision, natural language processing, and sentiment analysis. This has caused a huge concern of security in terms of privacy. My research focuses on remediation of such security concerns by developing robust models.",
        "Electrical and Computer Engineering, PhD ’21 | Moscow, Russia",
        "Why did you choose UIC? UIC’s position in university ratings shows that it’s a good school with a wide range of research opportunities. The College of Engineering is one of the biggest schools with a good variety of educational programs. It is famous for its diversity, which is reflected in a large number of international students enrolled in PhD programs.",
        "What is your academic focus within your department? I focus on electromagnetics. This area covers many problems and concepts based on applications of electromagnetic fields.",
        "How (and why) did you choose your faculty advisor? The first thing I paid attention to was our similar research interests. My advisor is a great researcher and faculty member.",
        "Place you’re most likely to be found on campus, and why: I was given a desk in a shared research lab last year, so I started spending much time there doing my work and my research. I like that office space and my colleagues.",
        "Electrical and Computer Engineering, PhD ’20 | Iraq",
        "Name one thing you think UIC does better than anywhere else: UIC brings people together from all over the world to focus on a shared educational experience.",
        "What is your academic focus within your department? My research is focused on machine learning, signal processing, and sensors.",
        "How (and why) did you choose your faculty advisor? I wanted an opportunity to work with someone with the expertise and experience to push me to the next level.",
        "Why did you choose UIC? I had always wanted to explore the city of Chicago, and I had heard that UIC had a solid ECE program. It was an easy decision for me.",
        "Favorite place in Chicago: UIC and downtown",
        "Electrical and Computer Engineering, PhD ’21 | Cuenca, Ecuador",
        "How is UIC preparing you for your future goals? Something I really like about UIC is that it really wants students to succeed. They will put all the tools you need in your hands so that, with the right attitude and desire to achieve your goals, you have the feeling you are in the right place. They care not only about your grades, but also all other important aspects of life.",
        "What is your academic focus within your department? I work on information theory, and my current topic is error exponents on the probability of error of two-way channels.",
        "How (and why) did you choose your faculty advisor? I met my advisor, Dr. Natasha Devroye, during my master’s, which I earned at UIC back in 2011. I admired the impact of her work and her achievements and always viewed her as a mentor and someone to learn from. I remember thinking, “If I go back for a PhD, it has to be under her supervision.” I’m very happy she accepted me as her student and happy to have come back to UIC for my PhD.",
        "What do you hope to be doing 10 years from now? I really like teaching and doing research. In 10 years, I see myself doing larger-impact research and collaborating with people from all around the world.",
        "Electrical and Computer Engineering, MS ’20 | Chennai, India",
        "What is your academic focus within your department? Mechatronics and semiconductors",
        "Why did you choose UIC? Because you can customize your courses. During my undergraduate degree I studied instrumentation, and I wanted to take courses in multiple disciplines to be a more successful engineer. Also, it’s hard to ignore the fact that Chicago is a beautiful city to live in.",
        "What do you hope to be doing right after graduation? To apply my skills in a suitable field for my degree and look for new learning opportunities.",
        "Place you’re most likely to be found on campus, and why: Mechatronics Lab. We are working on an autonomous race car this semester, and we spend a major chunk of our time at the lab.",
        "Electrical and Computer Engineering, MS ’20 | India",
        "Why did you choose UIC? UIC has a very talented pool of professors, and that contributed a lot toward my decision to attend.",
        "What do you hope to be doing 10 years from now? I would like have a business of my own.",
        "How is UIC preparing you for your future goals? UIC is giving me the right exposure by being in the center of many industries. Chicago is one of the biggest cities in the world, and this makes a huge impact as we get to experience more about the corporate world than other places.",
        "Looking broadly at your field of study, who is the person you admire the most, and why? I admire Andew Ng, the man most people call the father of modern artificial intelligence."
    ],
    "out_links": [
        "https://ece.uic.edu/",
        "http://uic.edu/",
        "https://ece.uic.edu/undergraduate/",
        "https://ece.uic.edu/undergraduate/admitted-students/",
        "https://ece.uic.edu/undergraduate/undergraduate-admissions/",
        "https://ece.uic.edu/undergraduate/accreditation/",
        "https://ece.uic.edu/undergraduate/ce-major/",
        "https://ece.uic.edu/undergraduate/ee-major/",
        "https://ece.uic.edu/undergraduate/ep-major/",
        "https://ece.uic.edu/undergraduate/courses/",
        "https://ece.uic.edu/undergraduate/internships-and-jobs/",
        "https://ece.uic.edu/undergraduate/minors-in-ece/",
        "https://ece.uic.edu/undergraduate/student-organizations/",
        "https://ece.uic.edu/undergraduate/student-profiles/",
        "https://ece.uic.edu/undergraduate/student-resources/",
        "https://ece.uic.edu/graduate/",
        "https://ece.uic.edu/graduate/admitted-graduate-students/",
        "https://ece.uic.edu/graduate/admissions/",
        "https://ece.uic.edu/graduate/courses/",
        "https://ece.uic.edu/graduate/ms-program/",
        "https://ece.uic.edu/graduate/phd-program/",
        "https://ece.uic.edu/graduate/phd-dissertations/",
        "https://ece.uic.edu/graduate/post-graduation-outcomes/",
        "https://ece.uic.edu/graduate/student-resources/",
        "https://ece.uic.edu/ece-research/",
        "https://ece.uic.edu/ece-research/areas/",
        "https://ece.uic.edu/ece-research/featured-research/",
        "https://ece.uic.edu/ece-research/labs/",
        "https://ece.uic.edu/ece-research/reus/",
        "https://ece.uic.edu/ece-research/sponsors/",
        "https://ece.uic.edu/faculty-and-staff/",
        "https://ece.uic.edu/faculty-and-staff/department-head/",
        "https://ece.uic.edu/faculty-and-staff/faculty/",
        "https://ece.uic.edu/faculty-and-staff/emeritus-faculty/",
        "https://ece.uic.edu/faculty-and-staff/adjunct-faculty/",
        "https://ece.uic.edu/faculty-and-staff/professional-organizations/",
        "https://ece.uic.edu/faculty-and-staff/faculty-resources/",
        "https://ece.uic.edu/faculty-and-staff/staff/",
        "https://ece.uic.edu/faculty-and-staff/open-positions/",
        "https://ece.uic.edu/ece-news/",
        "https://ece.uic.edu/ece-events/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://ece.uic.edu/profiles/natasha-devroye/",
        "https://grad.uic.edu/admissions",
        "https://ece.uic.edu/graduate/admissions/financial-aid-and-funding/",
        "https://ece.uic.edu/graduate/admissions/graduate-admissions-faq/",
        "https://ece.uic.edu/graduate/phd-program/qualifying-examination/",
        "https://ece.uic.edu/graduate/phd-program/preliminary-examination/",
        "https://ece.uic.edu/graduate/phd-program/dissertation-process/",
        "https://ece.uic.edu/contact/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}