{
    "url": "https://ece.uic.edu/ece-research/featured-research/",
    "title": "Featured Research | Department of Electrical and Computer Engineering | University of Illinois at Chicago",
    "text": [
        "Sudip K. Mazunder receives grants for two projects, a high density onboard electric vehicle charger, and power and energy controls for surgical cutting tools.",
        "Mazumder, a professor in the Electrical and Computer Engineering Department and the director of Laboratory for Energy and Switching-Electronic Systems (LESES), is the recipient of two grants funding this work: a Small Business Technology Transfer (STTR) Phase I grant from the NSF and a National Institute of Health grant with the University of Illinois at Urbana-Champaign.",
        "The NSF grant has a very aggressive goal of developing a high-power gallium-nitride (GaN) transistor based onboard charger to be used on electric vehicles (EV). By eliminating the need for long charging times, an onboard charger could enable broader adoption of EVs. He is targeting a Level 2 EV charger specification for the onboard charger, but the technology can be scaled for higher power (and reduced charging time) by either having multiple charging modules working together, or using a three-phase input power.",
        "The NIH grant is a project at the confluence of engineering and medicine, and Mazumder is the sole engineering expert from UIC on the project. Electrosurgery tools, which incorporate laser beams and harmonic/oscillating instruments, are typically operated at a fixed power level, sometimes damaging tissue and causing complications from excessive voltage. To mitigate these side effects, Mazumder is working on a distributed power electronics system that can precisely control the flow of energy during surgery. The power will vary based on the type of tissue, the thickness of the tissue, location, and tissue impedance.",
        "Learn more about his work.",
        "",
        "The NICEST Lab receives nearly $2 million in NSF funding to study, from both theoretical and practical perspectives, how to best communicate data over future wireless networks.",
        "The lab’s faculty leaders, Natasha Devroye, Hulya Seferoglu, Besma Smida, and Daniela Tuninetti, have been awarded three grants from the National Science Foundation towards this goal.",
        "Devroye, Smida, and Tuninetti are co-principal investigators on the NSF funded project “CIF: Medium: Delay, reliability, rate tradeoffs in broadcast channels.” This four-year, $1.2 million grant will be used to determine the fundamental tradeoff between delay, transmission rate, and reliability for data transmission in wireless cellular networks. The grant has both an information theory and a communication theory component. How information is stored and transmitted across wireless networks, and how quickly the transmission of that information occurs, must be prioritized as different technologies come online in ever-increasing numbers.",
        "Tuninetti received a three-year, $475,000 NSF grant to develop a framework for distributed computation, to enable faster information exchange for future data- and computation-intense applications. The grant, “CIF: Small: Fundamental Tradeoffs Between Communication Load and Storage Resources in Distributed systems,” covers two related problems: distributed cache-aided ‘Fog Radio Access Network’ architectures, which models a type of data network envisaged for 5G wireless systems, and peer-to-peer distributed data shuffling, which has applications in big data and machine learning.",
        "Devroye and Wenjing Rao are co-PIs on an NSF grant of nearly $240,000 to develop a new framework for understanding, in a systematic, theoretically explained way, the fundamental limits and properties of Physically Unclonable Functions (PUFs). These computer hardware circuits, which are easily built into computer chips, are key to securing IoT devices but have been shown to be “machine learnable,” or capable of overhearing communicated data, and allowing an attacker to predict the behavior of the PUF, compromising security. The duo hopes to transform how PUFs are designed and used for authentication.",
        "Find more information about the NICEST lab on their UIC site.",
        "Assistant Professor, Electrical and Computer Engineering",
        "Distributed coded computations for Internet of Things",
        "The Internet of Things (IoT) is emerging as a new Internet paradigm connecting an exponentially increasing number of smart IoT devices and sensors. IoT applications include smart cities, transportation systems, mobile healthcare and smart grid, to name a few. Unlocking the full power of IoT requires analyzing and processing this data through computationally intensive algorithms at unprecedented high rates, with stringent reliability, security, and latency constraints. In many scenarios, these algorithms cannot be run locally on the computationally limited IoT devices and are rather outsourced to the cloud. This leaves the IoT network, and the applications it is supporting, at the complete mercy of threats—for example, hackers, unfriendly nations, or natural disasters such as hurricanes or earthquakes—that can jeopardize the IoT or completely disconnect it from its “brain,” the cloud, with potentially catastrophic consequences. To mitigate the computational bottleneck in IoT, Dr. Seferoglu and her collaborators focus on the scenario that IoT devices help one another in their computations in a distributed fashion, with possible help from the cloud, if available. Their approach is based on the new theory of coded computations, which studies the design of erasure and error-correcting codes to improve the performance of distributed algorithms through “smart” data redundancy. Dr. Seferoglu and the team have developed distributed, adaptive, and secure coded computation algorithms for IoT devices, and they have deployed these algorithms on real IoT devices to demonstrate the efficiency of the approach.",
        "To watch a video about this research, click here.",
        "Research papers by Dr. Seferoglu’s research team are available here and here.",
        "Mitra Dutta, Michael Stroscio work on phononic effects in diamond electronics",
        "Mittra Dutta and Michael Stroscio are working to improve diamond-based transistors, which will enable higher-power, higher-frequency communications. Transistors, key components in almost all modern electronics, amplify currents and switch currents on and off. Currently, most transistors are made of silicon, due to its abundance and relatively low cost. Diamond maintains its functionality working at significantly higher temperatures and at higher frequencies than current transistors, but to date has not resulted in the speeds expected, due to electron scattering.",
        "They are working with Argonne National Laboratory as part of a cooperative agreement with the US Army Research Lab to develop the diamond transistors and explore novel ways to tailor the phonons or lattice vibrations of transistor structure to reduce the electron scattering, leading to the decrease in electrical conductivity.",
        "Dutta and Stroscio are working with the US Air Force Office of Scientific Research on a related project, examining phonon effects in different novel layered materials. The goal of the project is to will provide scaling laws describing the fundamental electronic properties of these emerging electronic materials where the properties will change as different materials are interfaced. Additional novel devices of 2D layers sandwiched between 3D layers will also be investigated.",
        "Read more about their work here."
    ],
    "out_links": [
        "https://ece.uic.edu/",
        "http://uic.edu/",
        "https://ece.uic.edu/undergraduate/",
        "https://ece.uic.edu/undergraduate/admitted-students/",
        "https://ece.uic.edu/undergraduate/undergraduate-admissions/",
        "https://ece.uic.edu/undergraduate/accreditation/",
        "https://ece.uic.edu/undergraduate/ce-major/",
        "https://ece.uic.edu/undergraduate/ee-major/",
        "https://ece.uic.edu/undergraduate/ep-major/",
        "https://ece.uic.edu/undergraduate/courses/",
        "https://ece.uic.edu/undergraduate/internships-and-jobs/",
        "https://ece.uic.edu/undergraduate/minors-in-ece/",
        "https://ece.uic.edu/undergraduate/student-organizations/",
        "https://ece.uic.edu/undergraduate/student-profiles/",
        "https://ece.uic.edu/undergraduate/student-resources/",
        "https://ece.uic.edu/graduate/",
        "https://ece.uic.edu/graduate/admitted-graduate-students/",
        "https://ece.uic.edu/graduate/admissions/",
        "https://ece.uic.edu/graduate/courses/",
        "https://ece.uic.edu/graduate/ms-program/",
        "https://ece.uic.edu/graduate/phd-program/",
        "https://ece.uic.edu/graduate/phd-dissertations/",
        "https://ece.uic.edu/graduate/post-graduation-outcomes/",
        "https://ece.uic.edu/graduate/student-profiles/",
        "https://ece.uic.edu/graduate/student-resources/",
        "https://ece.uic.edu/ece-research/",
        "https://ece.uic.edu/ece-research/areas/",
        "https://ece.uic.edu/ece-research/labs/",
        "https://ece.uic.edu/ece-research/reus/",
        "https://ece.uic.edu/ece-research/sponsors/",
        "https://ece.uic.edu/faculty-and-staff/",
        "https://ece.uic.edu/faculty-and-staff/department-head/",
        "https://ece.uic.edu/faculty-and-staff/faculty/",
        "https://ece.uic.edu/faculty-and-staff/emeritus-faculty/",
        "https://ece.uic.edu/faculty-and-staff/adjunct-faculty/",
        "https://ece.uic.edu/faculty-and-staff/professional-organizations/",
        "https://ece.uic.edu/faculty-and-staff/faculty-resources/",
        "https://ece.uic.edu/faculty-and-staff/staff/",
        "https://ece.uic.edu/faculty-and-staff/open-positions/",
        "https://ece.uic.edu/ece-news/",
        "https://ece.uic.edu/ece-events/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://mazumder.lab.uic.edu/",
        "https://ece.uic.edu/news-stories/sudip-k-mazumder-receives-two-new-grants-on-power-electronics/",
        "http://nicest.lab.uic.edu/profiles/devroye-natasha/",
        "http://nicest.lab.uic.edu/profiles/seferoglu-hulya/",
        "http://nicest.lab.uic.edu/profiles/smida-besma/",
        "http://nicest.lab.uic.edu/profiles/tuninetti-daniela/",
        "https://nicest.lab.uic.edu/",
        "https://ece.uic.edu/news-stories/ece-distinguished-professors-dutta-stroscio-work-with-u-s-army-to-improve-diamond-based-transistors/",
        "https://ece.uic.edu/contact/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}