{
    "url": "https://healthinformatics.uic.edu/health-information-management-degrees/",
    "title": "Health Information Management Degree Programs Online",
    "text": [
        "UIC’s Health Information Management programs equip students with an in-depth understanding of cutting-edge practices and methodologies, while applying real-world experiences to make a seamless transition from degree to profession.",
        "Options Designed to Fit Your Needs",
        "Program features include:",
        "UIC’s online HIM program was designed to prepare graduates to take the prestigious Registered Health Information Administrator (RHIA) exam. This dynamic degree program provides skilled instruction in the management and use of information and information systems for healthcare planning and provision, resource allocation, and executive decision making. As you work your way through the curriculum presented 100 percent online, you will also explore essential topics, such as coding, systems analysis, data quality management and health information research.",
        "The online Master of Science in Health Information Management imparts the technical knowledge and industry-specific skills to help you become an influential leader in today’s healthcare system. Our 12-course, 100 percent online program offers you a solid foundation in health information theory and practice.The carefully crafted curriculum prepares you to help organizations develop and implement effective health information management strategies, advance the quality of patient care and safeguard the integrity of electronic health records.",
        "",
        "UIC’s HIM programs were designed to prepare graduates to take the prestigious Registered Health Information Administrator (RHIA) exam. The HIM programs provide skilled instruction in the management and use of information and information systems for healthcare planning and provision, resource allocation, and executive decision-making.",
        "According to the U.S. Department of Labor Bureau of Labor Statistics, employment of medical and health services managers is expected to grow by 20% from 2016 to 2026, much faster than the average for all occupations.",
        "94% of students who responded to a survey are satisfied with their academic experience in the program.",
        "100% of employers who responded to a survey are satisfied with job performance of our graduates.",
        "88% of graduates were employed in their field of choice within the first year of graduation.",
        "",
        "Hear from an industry expert on how having a degree or advanced degree will put you ahead in the race to find a job, especially in the healthcare field.",
        "",
        "The Registered Health Information Administrator (RHIA) credential signifies that a person has competency in the skill sets of coding, management, technology, privacy, security and data integrity. Our program allows students to sit for the RHIA exam.",
        "The HIM curriculum is taught by esteemed faculty who have held prestigious roles within the healthcare industry. UIC’s award-winning faculty members bring an unprecedented level of expertise and real-world experience into our online classrooms.",
        "The Health Information Management programs offered by UIC are designed to impart the knowledge and critical skills important for helping organizations develop and implement effective health information management strategies, advance the quality of patient care and safeguard the integrity of electronic health records. Many areas of study are covered in this CAHIIM-accredited, 100 percent online program to help prepare students for the various roles defined by health information management.",
        "Modeled after the successful on-campus program, our 100 percent online Bachelor of Science in Health Information Management program explores relevant topics, such as data coding and reimbursement systems, quality management and health information systems. The cutting-edge curriculum provides skilled instruction in the management and use of information and information systems for healthcare planning and provision, resource allocation and executive decision making.",
        "The program’s advanced curriculum presented 100 percent online offers a solid foundation in health information theory and practice. As a student, you will have the opportunity to expand upon your bachelor’s degree education and gain the coveted leadership and management skills that can help you thrive in today’s ever-evolving healthcare industry."
    ],
    "out_links": [
        "https://healthinformatics.uic.edu/",
        "http://healthinformatics.uic.edu/apply-now/",
        "https://healthinformatics.uic.edu/health-informatics-degrees/",
        "https://healthinformatics.uic.edu/health-informatics-degrees/admissions/",
        "https://healthinformatics.uic.edu/health-informatics-degrees/applied-health-professionals/",
        "https://healthinformatics.uic.edu/health-informatics-degrees/careers/",
        "https://healthinformatics.uic.edu/health-informatics-degrees/curriculum/",
        "https://healthinformatics.uic.edu/health-informatics-degrees/medical-informatics/",
        "https://healthinformatics.uic.edu/health-informatics-degrees/nursing-informatics/",
        "https://healthinformatics.uic.edu/health-informatics-degrees/pharmacy-informatics/",
        "https://healthinformatics.uic.edu/health-informatics-degrees/programs-requirements/",
        "https://healthinformatics.uic.edu/health-informatics-degrees/student-outcomes/",
        "https://healthinformatics.uic.edu/health-information-management-degrees/admissions/",
        "https://healthinformatics.uic.edu/health-information-management-degrees/careers/",
        "https://healthinformatics.uic.edu/health-information-management-degrees/curriculum/",
        "https://healthinformatics.uic.edu/health-information-management-degrees/programs-requirements/",
        "https://healthinformatics.uic.edu/health-information-management-degrees/student-outcomes/",
        "https://healthinformatics.uic.edu/about/",
        "https://healthinformatics.uic.edu/about/faculty/",
        "https://healthinformatics.uic.edu/about/policies/",
        "https://healthinformatics.uic.edu/about/rankings/",
        "https://healthinformatics.uic.edu/about/tuition-financial-aid/",
        "https://healthinformatics.uic.edu/blog/",
        "https://healthinformatics.uic.edu/apply-now/",
        "https://healthinformatics.uic.edu/privacy-policy/",
        "http://healthinformatics.uic.edu/blog/how-a-health-information-management-degree-can-help-your-career/",
        "http://healthinformatics.uic.edu/blog/what-earning-the-rhia-credential-signifies/",
        "http://healthinformatics.uic.edu/blog/the-ideal-him-online-student-karen-patena-mba-rhia-fahima/",
        "http://healthinformatics.uic.edu/blog/who-makes-an-ideal-candidate-for-a-post-baccalaureate-certificate-in-health-information-management/",
        "http://healthinformatics.uic.edu/blog/health-information-management-curriculum/",
        "http://healthinformatics.uic.edu/blog/what-skills-will-students-have-when-they-graduate/",
        "http://healthinformatics.uic.edu/health-information-management-degrees/curriculum/bachelor-of-science-in-health-information-management-bs-him/",
        "http://healthinformatics.uic.edu/health-information-management-degrees/curriculum/master-of-science-in-health-information-management/",
        "http://healthinformatics.uic.edu/health-information-management-degrees/admissions/",
        "http://healthinformatics.uic.edu/about/",
        "http://healthinformatics.uic.edu/about/rankings/",
        "http://healthinformatics.uic.edu/blog/",
        "https://healthinformatics.uic.edu/do-not-sell-my-info/"
    ]
}