{
    "url": "https://comm.uic.edu/about/news-2/",
    "title": "News | Communication | University of Illinois at Chicago",
    "text": [
        "",
        "Zizi Papacharissi, UIC professor and head of communication and professor of political science, was recently interviewed by L’Express, a French weekly news magazine, about Mayor Lori Lightfoot’s use of humor during the COVID-19…",
        "",
        "",
        "A Chicago Tribune story on coronavirus culture and trends includes a comment from Sam Taylor, UIC assistant professor of communication, who cites the explosion of creativity taking place online during the pandemic. https://bit.ly/35isvAl (subscription…",
        "",
        "",
        "Zizi Papacharissi, Professor and Head of Communication, previewed the State of the Union address President Donald Trump delivered on Tuesday Feb 4th 2020 for  WTTW’s (PBS affiliate) Chicago Tonight. https://news.wttw.com/2020/02/04/trump-faces-accusers-what-watch-during-his-big-speech",
        "",
        "",
        "The South China Morning Post interviewed Elaine Yuan, UIC associate professor of communication, in a story examining information security and privacy in China, where large data breaches have recently occurred and recent surveys…",
        "",
        "",
        "Every January Choice Magazine, a premiere review magazine for the Association of College & Research Libraries, a division of the American Library Association, publishes a list of the best scholarly titles reviewed by…",
        "",
        "",
        "Associate Professor Adrienne Massanari is quoted in a piece for the Wellcome Trust’s (UK) Mosaic magazine called “Why do holes horrify me?” about trypophobia and other phenomena like ASMR that are predominately spread…",
        "",
        "",
        "The Telegraph (UK) features Kishonna Gray, UIC assistant professor of communication and gender and women’s studies, in an article that examines what impact, if any, violent video games has on behavior versus the…",
        "",
        "",
        "Rebecca Ann Lind, Director of Undergraduate Studies and an Associate Professor in the Department of Communication at the University of Illinois at Chicago (UIC), has been awarded the 2019 Broadcast Education Association (BEA)…",
        "",
        "",
        "Steve Jones, UIC distinguished professor of communication, was interviewed in an Associated Press article on Internet hoaxes, particularly ones that involve children, and what parents can do to verify and talk to their…",
        "",
        "",
        "including A Networked Self: Platforms, Stories, Connections; A Networked Self: Love; A Networked Self: Birth, Life, Death; A Networked Self: Human Augmentics, Artificial Intelligence, Sentience, and, w/ Pablo Boczkowski, Trump and the Media",
        "",
        "",
        "So everything is broken: What do we do to fix the world we love? https://simplecast.com/s/9cb862c7 EPISODE NOTES So everything is broken: What do we do to fix the world we love? Dr. Kishonna…",
        "",
        "",
        "is ranked #1 two years in a row in Google Scholar, and in #2 in the 2015 Journal Citation Reports for Communication.",
        "",
        "",
        "Fast Company magazine quotes Steve Jones, UIC distinguished professor of communication, in an article examining public perception of the technology industry and Silicon Valley culture. Jones addresses how tech companies struggle with governing…",
        "",
        "",
        "Poynter’s morning round up offers brief previews of several paper presentations scheduled for this weekend’s American Political Science Association’s annual meeting, including one from Sharon Meraz, UIC associate professor of communication. Meraz’s paper…",
        "",
        "",
        "Steve Jones, UIC distinguished professor of communication, is quoted in an Associated Press story about technology companies’ efforts to deal with group and individual accounts that promote hate and violence.",
        "",
        "",
        "Congratulations to Jenny Korn, for joining the new class of Berkman Klein Center for Internet and Society at Harvard University Fellows. As Fellow, Jenny will  primarily work in Cambridge, Massachusetts, alongside Berkman Klein…",
        "",
        "",
        "Zizi Papacharissi, Professor and Head, has been elected Fellow of the International Communication Association.",
        "",
        "",
        "UIC assistant professor of communication, discusses how her Google Doc on the technology and implications involved with the Pokémon Go app became a crowdsourced syllabus.",
        "",
        "",
        "The Associated Press interviewed Steve Jones, UIC distinguished professor of communication, in an article about the freedom of speech debate and reversal by Facebook to allow postings of the “napalm girl” photo, the…",
        "",
        "",
        "Catherine Knight Steele joins UMD as newly appointed Project Director for the Andrew Mellon-funded grant Synergies among Digital Humanities and African American History and Culture and concurrently as an Assistant Professor in the…",
        "",
        "",
        "is ranked #1 two years in a row in Google Scholar, and in #2 in the 2015 Journal Citation Reports for Communication.",
        "",
        "",
        "Walter Podrazik, adjunct lecturer for the Department of Communication, was interviewed by C-SPAN live from the floor of the Democratic National Convention in Philadelphia, talking about the media preparations and issues involved in…",
        "",
        "",
        "Dana Capocci, a recent UIC Communication Department graduate, was nominated for the 2016 NCAA Woman of the Year award. Read the full story here.",
        "",
        "",
        "The Associated Press quotes Steve Jones, UIC distinguished professor of communication, in an article about a French appeals court ruling against Facebook, which is being sued by user who posted a photo of…",
        ""
    ],
    "out_links": [
        "https://comm.uic.edu/",
        "http://uic.edu/",
        "https://comm.uic.edu/about/",
        "https://comm.uic.edu/about/contact-us/",
        "https://comm.uic.edu/about/calendar/",
        "https://comm.uic.edu/about/administrative-support/",
        "https://comm.uic.edu/academics/",
        "https://comm.uic.edu/academics/undergraduate-studies/",
        "https://comm.uic.edu/academics/graduate-studies/",
        "https://catalog.uic.edu/gcat/course-descriptions/comm/",
        "https://comm.uic.edu/academics/award-application-info/",
        "https://comm.uic.edu/people/",
        "https://comm.uic.edu/people/faculty/",
        "https://comm.uic.edu/people/staff/",
        "https://comm.uic.edu/people/students/",
        "https://comm.uic.edu/our-research/",
        "https://las.uic.edu/",
        "https://give.las.uic.edu/units/comm/",
        "http://maps.uic.edu/",
        "https://comm.uic.edu/news-stories/professor-zizi-papacharissi-interviewed-by-lexpress/",
        "https://comm.uic.edu/news-stories/uic-assistant-professor-dr-samuel-taylor-quoted-in-a-chicago-tribune-story/",
        "https://comm.uic.edu/news-stories/zizi-on-tv/",
        "https://comm.uic.edu/news-stories/uic-associate-professor-of-communication-dr-elaine-yuan-was-interviewed-by-south-china-morning-post/",
        "https://comm.uic.edu/news-stories/woke-gaming-by-dr-gray-named-as-an-outstanding-academic-title-oat-by-choice-reviews/",
        "https://comm.uic.edu/news-stories/massanari-quoted-in-mosaic/",
        "https://comm.uic.edu/news-stories/the-telegraph-uk-features-kishonna-gray-uic-assistant-professor-of-communication-and-gender-and-womens-studies/",
        "https://comm.uic.edu/news-stories/rebecca-ann-lind-receives-beas-2019-lifetime-achievement-in-scholarship/",
        "https://comm.uic.edu/news-stories/steve-jones-uic-distinguished-professor-of-communication-interviewed-in-an-associated-press-article-on-internet-hoaxes/",
        "https://comm.uic.edu/news-stories/zizi-papacharissi-professor-and-head-of-communication-publishes-five-books/",
        "https://comm.uic.edu/news-stories/kishonna-gray-featured-on-podcast/",
        "https://comm.uic.edu/news-stories/new-media-society-edited-by-uic-distinguished-professor-steve-jones-2/",
        "https://comm.uic.edu/news-stories/fast-company-magazine-quotes-steve-jones/",
        "https://comm.uic.edu/news-stories/associate-professor-sharon-merazs-work-on-fake-news/",
        "https://comm.uic.edu/news-stories/steve-jones-uic-distinguished-professor/",
        "https://comm.uic.edu/news-stories/jenny-korn-joins-new-class-of-harvards-berkman-center-fellows/",
        "https://comm.uic.edu/news-stories/zizi-papacharissi-professor-and-head-has-been-elected-fellow/",
        "https://comm.uic.edu/news-stories/in-a-q-a-with-chicagoinno-com-adrienne-massanari/",
        "https://comm.uic.edu/news-stories/the-associated-press-interviewed-steve-jones-uic-distinguished-professor-of-communication/",
        "https://comm.uic.edu/news-stories/catherine-knight-steele-comm-uic-phd-joins-the-university-of-maryland/",
        "https://comm.uic.edu/news-stories/new-media-society-edited-by-uic-distinguished-professor-steve-jones/",
        "https://comm.uic.edu/news-stories/walter-podrazik-adjunct-lecturer-for-the-department-of-communication/",
        "https://comm.uic.edu/news-stories/dana-capocci-recent-comm-uic-grad/",
        "https://comm.uic.edu/news-stories/the-associated-press-quotes-steve-jones/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}