{
    "url": "https://comm.uic.edu/about/",
    "title": "About | Communication | University of Illinois at Chicago",
    "text": [
        "The Department of Communication offers degrees oriented to research and theory about a central issue in life of the 21st century: dynamic and complex human and mediated communication. The B.A. program is comprehensive, spanning the old boundaries that once divided the discipline into speech and journalism departments and instead offering courses that teach life skills firmly rooted in the liberal arts and sciences.",
        "Graduate programs train students to generate new knowledge about communication. The M.A. program emphasizes two areas, media and intercultural studies, and students also bridge the older divisions of the discipline by applying ideas and methods from one to the other area of emphasis. The PhD program focuses on technology, a key factor that has transformed the discipline: the rise of interactive digital communication.",
        "The Department of Communication at the University of Illinois at Chicago meets the goals of a liberal education by enhancing critical awareness of self and others within a wide range of communication contexts, from personal to public.",
        "The study of communication has origins in the liberal arts and sciences. The discipline encompasses interests in culture, society, politics, economics, history, and the arts, as seen through the distinctive lens of communication. That perspective emphasizes how communication establishes, sustains, and transforms interpersonal, institutional, and intercultural life.",
        "In its research, the department faculty draws upon a wide range of humanistic and scientific methods and collaborates as needed to answer the questions at hand.",
        "In its curriculum, the department incorporates a similar breadth of ideas and methods. Study is based on modes of inquiry, rather than on narrowly focused job skills likely to go quickly out of date. Courses help students learn how to learn rather than what to do.",
        "Through the study of communication theory, criticism, and methods, students learn to research, analyze, and articulate solutions to communication problems in a variety of media (such as speech, print, broadcast, and computer) and settings (ranging from interpersonal to cross-cultural) and to re-educate themselves as issues change."
    ],
    "out_links": [
        "https://comm.uic.edu/",
        "http://uic.edu/",
        "https://comm.uic.edu/about/contact-us/",
        "https://comm.uic.edu/about/news-2/",
        "https://comm.uic.edu/about/calendar/",
        "https://comm.uic.edu/about/administrative-support/",
        "https://comm.uic.edu/academics/",
        "https://comm.uic.edu/academics/undergraduate-studies/",
        "https://comm.uic.edu/academics/graduate-studies/",
        "https://catalog.uic.edu/gcat/course-descriptions/comm/",
        "https://comm.uic.edu/academics/award-application-info/",
        "https://comm.uic.edu/people/",
        "https://comm.uic.edu/people/faculty/",
        "https://comm.uic.edu/people/staff/",
        "https://comm.uic.edu/people/students/",
        "https://comm.uic.edu/our-research/",
        "https://las.uic.edu/",
        "https://give.las.uic.edu/units/comm/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}