{
    "url": "https://comm.uic.edu/our-research/",
    "title": "Research | Communication | University of Illinois at Chicago",
    "text": [
        "Collaborations",
        "Professional Organizations",
        "The Department holds an institutional membership in the National Communication Association (NCA) and professors most often present their research at the International Communication Association (ICA). Graduate students in the Department win annual awards for teaching and research from these two main associations of the discipline. Students serious about an academic or research career should consider joining these groups, which offer student membership discounts. The International Association for Media and Communication Research (IAMCR) is recognized by the United Nations as a locus of international research related to mediated Communication. The Department has special relations with some smaller associations, by virtue of the involvement of the faculty in their leadership, regional connection, or historical origins. Association of Internet Researchers (AoIR) Central States Communication Association (CSCA) Members of the Department belong to a range of specialty associations, such as those related to specific research methods. American Association for Public Opinion Research (AAPOR) International Network for Social Network Analysis (INSNA) International Visual Sociology Association (IVSA) The Communication discipline is interdisciplinary in orientation. Faculty may belong to national and international groups principally representing disciplines allied with specific research interests, such as groups for anthropologists (AAA), culturalists (ACS, CSA), economists (AEA), journalists (AEJMC, BEA), linguists (LSA, AAAL), political scientists (APSA), rhetoricians (MLA, ACA), sociologists (ASA), and the like. These affiliations may also develop later in a scholarly career.",
        "Electronic Visualization Laboratory (EVL)",
        "The UIC Electronic Visualization Laboratory (EVL) is an interdisciplinary graduate research laboratory that combines art and computer science, specializing in advanced visualization and networking technologies. The laboratory is a joint effort of UIC's College of Engineering and The School of Art & Design, representing the oldest formal collaboration between engineering and art in the country and offering graduate degrees in electronic visualization (MFA, MS, PhD). Funded research projects include: distributed computing/visualization, collaborative software, the development of viable, scalable, deployable stereo displays and management of next-generation advanced networking initiatives."
    ],
    "out_links": [
        "https://comm.uic.edu/",
        "http://uic.edu/",
        "https://comm.uic.edu/about/",
        "https://comm.uic.edu/about/contact-us/",
        "https://comm.uic.edu/about/news-2/",
        "https://comm.uic.edu/about/calendar/",
        "https://comm.uic.edu/about/administrative-support/",
        "https://comm.uic.edu/academics/",
        "https://comm.uic.edu/academics/undergraduate-studies/",
        "https://comm.uic.edu/academics/graduate-studies/",
        "https://catalog.uic.edu/gcat/course-descriptions/comm/",
        "https://comm.uic.edu/academics/award-application-info/",
        "https://comm.uic.edu/people/",
        "https://comm.uic.edu/people/faculty/",
        "https://comm.uic.edu/people/staff/",
        "https://comm.uic.edu/people/students/",
        "https://las.uic.edu/",
        "https://give.las.uic.edu/units/comm/",
        "http://maps.uic.edu/",
        "http://www.evl.uic.edu/",
        "https://comm.uic.edu/faculty-administration/",
        "https://comm.uic.edu/support/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}