{
    "url": "https://bioe.uic.edu/undergraduate/admitted-students/",
    "title": "Admitted Students | Richard & Loan Hill Department of Bioengineering | University of Illinois at Chicago",
    "text": [
        "Welcome to the undergraduate program in bioengineering at UIC!",
        "Congratulations on your acceptance. We look forward to introducing you to the faculty, staff, and fellow students who will help you to develop your knowledge and skills in bioengineering—and set you on your way toward a rewarding career.",
        "We encourage all of our incoming students to visit a few important places to gather all the information you need for a great start at UIC.",
        "UIC has a dedicated page for new undergraduate students. Start here to get all the information you will need as you start your education at UIC.",
        "You will receive one-on-one guidance from our faculty to make sure you are enrolling in the courses you need to complete your degree on time and be well-positioned to achieve your post-graduation goals. Preview how the process works on our academic advising page.",
        "Before you begin your UIC program is a great time to familiarize yourself with all the prospects that await you here—whether it’s courses in biotransport or biostatistics, the Neural Engineering Laboratory, classes on the biology of the brain, or finding out how to make computer models of physiological systems. Start on our courses page; we also recommend you check out the UIC undergraduate course catalog page for bioengineering.",
        "UIC Bioengineering’s faculty and staff are dedicated to helping you understand what’s required of you and succeed in your academic pursuits. The student affairs office and the faculty have put together some questions and answers (with quick videos!) to put you on the right track.",
        "Degree requirements are the courses you must complete with passing grades to earn your undergraduate degree. Think of it as the university’s academic contract with you. Watch a brief video on this topic.",
        "The degree requirements are laid out in the undergraduate course catalog. The undergraduate catalog is updated every year, and the bioengineering degree requirements are updated every two years. It is essential that you use the catalog that was in place in the semester you entered the program. (Because you are a newly admitted student, the current course catalog, linked in the first sentence of this paragraph, is the one for you.) Watch a brief video on this topic.",
        "Concentration area electives are designed to make you as competitive as possible for whatever you’re going to do next, whether that is a job in industry, professional school, or graduate school. They are flexible and allow you a degree of choice. Watch a brief video on this topic.",
        "You will choose your concentration area electives in consultation with your academic advisor, who is a faculty member. He or she will help you to make a choice that will benefit you after UIC. Most concentration area electives are 300-level or 400-level math, science, or engineering courses. You can find the specific criteria at the top of the concentration area elective form, which is available in the department office. Watch a brief video on this topic.",
        "You should submit the form as soon as you know which courses you will be reporting. In general, that will be the semester before the one when you intend to graduate. You do not have to have completed all of the courses listed on the form yet, but you should be enrolled in them by the time you submit the form. Watch a brief video on the topic.",
        "A curriculum flowchart is a visual representation of the degree requirements. You can find these on our undergraduate Student Resources page. Remember to use the version of the flowchart that pertains to the semester when you entered the bioengineering program. Watch a brief video on this topic.",
        "You should not take a course without having taken the listed prerequisite. However, there are three exceptions. This brief video will explain.",
        "The discipline of bioengineering is driven by advances in research. UIC allows you to participate in bioengineering research as an undergraduate—and you should! You can do so by enrolling in BIOE 398. This course gives you three advantages: credit toward your degree, a hands-on experience that you can talk about in academic or job interviews, and a path to a vibrant letter of recommendation from your research advisor. Find more information about undergraduate research activities at the bottom of our undergraduate research proposal form. We encourage you to talk to faculty members if you think you will be interested. Even though students enroll in BIOE 398 toward the end of their program, it can never hurt to let faculty know early on that you have research in mind. Watch a brief video on this topic.",
        "Our department office is a great place to start. The student affairs team is located in Room 218 on the second floor of SEO. You also can email bioe@uic.edu for help."
    ],
    "out_links": [
        "https://bioe.uic.edu/",
        "http://uic.edu/",
        "https://bioe.uic.edu/undergraduate/",
        "https://bioe.uic.edu/undergraduate/admissions/",
        "https://bioe.uic.edu/undergraduate/accreditation/",
        "https://bioe.uic.edu/undergraduate/bioengineering-major/",
        "https://bioe.uic.edu/undergraduate/bioinformatics-major/",
        "https://bioe.uic.edu/undergraduate/bioengineering-minor/",
        "https://bioe.uic.edu/undergraduate/courses-undergraduate/",
        "https://bioe.uic.edu/internships-and-jobs/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://bioe.uic.edu/undergraduate-student-organizations/",
        "https://bioe.uic.edu/undergraduate/undergraduate-student-profiles-bioe/",
        "https://bioe.uic.edu/undergraduate/student-resources-undergraduate/",
        "https://bioe.uic.edu/graduate/",
        "https://bioe.uic.edu/graduate/admissions/",
        "https://bioe.uic.edu/graduate/admitted-students/",
        "https://bioe.uic.edu/graduate/courses-graduate/",
        "https://bioe.uic.edu/graduate/ms-programs/",
        "https://bioe.uic.edu/graduate/phd-programs/",
        "https://bioe.uic.edu/graduate/dissertations/",
        "https://bioe.uic.edu/graduate/post-graduation-outcomes/",
        "https://bioe.uic.edu/graduate/graduate-student-profiles/",
        "https://bioe.uic.edu/graduate/student-resources-graduate/",
        "https://bioe.uic.edu/bioe-research/",
        "https://bioe.uic.edu/bioe-research/research-2/",
        "https://bioe.uic.edu/bioe-research/featured-research/",
        "https://bioe.uic.edu/bioe-research/grants/",
        "https://bioe.uic.edu/bioe-research/labs/",
        "https://bioe.uic.edu/faculty-and-staff/",
        "https://bioe.uic.edu/about-us/",
        "https://bioe.uic.edu/faculty-and-staff/department-head/",
        "https://bioe.uic.edu/faculty-and-staff/faculty/",
        "https://bioe.uic.edu/faculty-and-staff/affiliate-faculty/",
        "https://bioe.uic.edu/faculty-and-staff/emeriti/",
        "https://bioe.uic.edu/faculty-and-staff/staff/",
        "https://bioe.uic.edu/faculty-and-staff/faculty-jobs/",
        "https://bioe.uic.edu/bioe-news/",
        "https://bioe.uic.edu/bioe-news/annual-report/",
        "https://bioe.uic.edu/bioe-news/newsletter/",
        "https://bioe.uic.edu/bioe-news/bioe-news-archive/",
        "https://bioe.uic.edu/bioe-events/",
        "https://bioe.uic.edu/bioe-events/upcoming-events/",
        "https://bioe.uic.edu/bioe-events/calender/",
        "https://bioe.uic.edu/bioe-events/annual-events/",
        "https://bioe.uic.edu/bioe-events/seminar-archive/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "https://medicine.uic.edu/",
        "http://maps.uic.edu/",
        "https://admissions.uic.edu/undergraduate/application-process/newly-admitted-students",
        "http://bioe.uic.edu/undergraduate/courses-undergraduate/",
        "https://catalog.uic.edu/ucat/colleges-depts/engineering/bioe/bs/",
        "http://bioe.uic.edu/undergraduate/student-resources/",
        "https://admissions.uic.edu/apply-now",
        "https://financialaid.uic.edu/",
        "https://forms.uofi.uic.edu/sec/1820274",
        "https://bioe.uic.edu/undergraduate/bioengineering-major/dual-degree-bs-ms/",
        "https://bioe.uic.edu/internships-and-jobs/research-experiences-for-undergraduates/",
        "https://bioe.uic.edu/undergraduate/student-resources-undergraduate/undergraduate-academic-advising/",
        "https://bioe.uic.edu/contact/",
        "https://ehso.uic.edu/",
        "https://drc.uic.edu/",
        "https://www.uic.edu/about/visit-directions",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://bioe.uic.edu/bioepay/",
        "https://bioe.uic.edu/hr-procedures/",
        "https://bioe.uic.edu/rooms/",
        "https://bioe.uic.edu/media-resources/",
        "https://bioe.uic.edu/teaching-resources/",
        "https://bioe.uic.edu/teaching-online/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}