{
    "url": "https://bioe.uic.edu/undergraduate-student-organizations/",
    "title": "Student Organizations | Richard & Loan Hill Department of Bioengineering | University of Illinois at Chicago",
    "text": [
        "The bioengineering department at UIC houses five student organizations that are open to students in bioengineering and bioinformatics.",
        "Visit our college-wide student organizations page for more information about other College of Engineering student organizations that might be of interest, including interdisciplinary groups such as:",
        "Graduate students in bioengineering and bioinformatics also are eligible to join the UIC-wide Graduate Student Council.",
        "Alpha Eta Mu Beta is the national honor society for students of biomedical engineering. The society recognizes academic excellence and provides opportunities for networking, service, training, and leadership.",
        "The Graduate Student Council serves to represent the bioengineering department outside of UIC, encourage personal and professional development among students, and act as a liaison group to the College of Engineering administration, among other key functions.",
        "The Biomedical Engineering Society sponsors applied research projects and organizes an annual research symposium. Research teams meet once or twice per week to pursue work that benefits people, such as 3D-printed prosthetics or filtering masks for people who live in cities with poor air quality.",
        "Engineering World Health members travel around the globe to perform service projects that improve health and well-being. With a focus on the developing world, UIC’s chapter of EWH recently has sent project teams to Rwanda and Vietnam."n Chicago; Society of Future Physicians",
        "Internships: JUMP Trading and Simulation (Peoria), Shirley Ryan AbilityLab (Chicago)",
        "Bioengineering, BS ’22",
        "Winnebago, IL",
        "Student activities: Women’s Club Rugby (treasurer), Peer Health Exchange, Engineering World Health",
        "Why UIC? I chose to attend UIC because of the close relationship between the bioengineering department and the College of Medicine. Going to a school with an associated medical campus grants a lot of opportunities for hands-on applications of what we learn in class.",
        "Snapshots from class: In my first bioengineering class, BIOE 101, I built and designed a motorized game of mouse trap. In my BIOE 250 class—Clinical Problems in Bioengineering—we had to come up with a new method to quantify the disease state of ulcerative colitis.",
        "Engineering industry figure you admire: William F. House. He was the inventor of the first cochlear implants.",
        "Words of wisdom: Consistently sleeping eight hours a night will change your life.",
        "Bioengineering ’21",
        "Chicago, IL",
        "On becoming an engineer: I have always loved to learn how to formulate objects and manipulate them to perform up to a certain outcome or expectation. I would explore items around the house and observe and tinker with the way they work. My explorations sometimes turn certain spots in the house into a mess, but these are my most treasured experiences that helped to nurture my love for the engineering field.",
        "UIC advantage: I cannot stress enough how important it is to me that UIC is diverse. To be able to look into every field and find at least three people that look like you is a comforting feeling. UIC is not only diverse in ethnicity and race, but also in ideas and ways of thinking. There are also people who have a cause that they care so passionately about, and they are not afraid to show it and do something about it. These are what UIC does better than anywhere else.",
        "Post-graduation plans: Because I am in the Guaranteed Professional Program Admissions honors program, after graduation I am hoping to embark on earning my graduate degree in bioengineering at UIC.",
        "Favorite place in Chicago: Chinatown. I love to visit the different restaurants and enjoy the night walks as well.",
        "Bioengineering, BS ’21",
        "Palatine, IL",
        "Dream job: Astrobiologist",
        "Internship: Medical University of South Carolina, Department of Radiology. My time spent at MUSC helped me to decide that I want to study neural engineering.",
        "Why would you recommend the College of Engineering to others? There are plenty of resources that will help you succeed along the way.",
        "UIC in one word: Inclusiveness",
        "Bioengineering, BS ’20",
        "Naperville, IL",
        "On engineering school in a big city: Because UIC is located in Chicago, we have greater access to different engineering companies and areas of research. There are always speakers coming from different universities and companies to talk about their careers.",
        "Favorite course: CME 260 Properties of Materials",
        "Internship: Argonne National Laboratory, working on Atomic Layer Deposition in their clean room; Dr. Michael Stroscio’s Nanoengineering Research Lab, focusing on quantum dot bio-sensors",
        "Next goal after this program: a PhD in nanoengineering or materials engineering",
        "What’s the greatest advantage of UIC Engineering? It allows students to learn new technical skills. I never used any coding before starting college. Now, I can use it for several classes.",
        "Bioengineering, BS ’20",
        "Elgin, IL",
        "Why UIC? It is close to home and offers cell and tissue engineering as a concentration, which not many other schools in the area have. It’s also located in the heart of Chicago, so there are many opportunities nearby.",
        "Internships: Shirley Ryan AbilityLab",
        "Career goal: Neurologist (medical school is up next!)",
        "Most challenging project to date? During my internship at the Shirley Ryan AbilityLab, I was able to program a Raspberry Pi to collect arm motion data using an accelerometer and send the data to a computer over a network. I had no experience coding in Python or using a Raspberry Pi, and I had no background in circuits when I started the project. But my mentors at the lab were very helpful, and having experience working with Arduino in BIOE 101 helped, too.",
        "Bioengineering, BS ’20",
        "Lemont, IL",
        "Future plans: Medical school",
        "Favorite thing about the BioE department: Access to the MakerSpace. The equipment and people there are a fantastic resource.",
        "Most challenging (and rewarding) class assignment: I recently worked on a project where we put together a device to read the pressure in the foot as a person walks and wirelessly transmit that data to our computer, where the data was processed and visualized.",
        "On working with faculty: The professors are for the most part involved in fascinating research and are open to having undergraduate students help out.",
        "Best activity in Chicago: Fishing at Diversey Harbor",
        "Bioengineering, BS ’20",
        "Des Plaines, IL",
        "Best thing about UIC Bioengineering: The Clinical Immersion Program offered during the summer before Senior Design. This internship provides an opportunity for bioengineering students to apply knowledge from an academic setting in a clinical environment. It’s an excellent platform for uniting the development of medical devices and the commitment to improving the quality of life of individuals.",
        "Tips on future planning: The College of Engineering does a fantastic job of setting students up for success post-graduation through career resources, job fairs, and the Guaranteed Paid Internship Program.",
        "Student activities: Tau Beta Pi Engineering Honor Society (vice president), Society of Future Physicians, Golden Key International Honor Society, Future Leaders Program, Alpha Eta Mu Beta",
        "Most valuable student club experience: My role in the Society of Future Physicians provides great opportunities to shadow and network with physicians.",
        "Bioengineering, BS ’21 | Chicago, IL",
        "Why did you choose UIC College of Engineering? I want to contribute to the development of medicine and medical devices that can improve the lives of people everywhere.",
        "Favorite course: BIOE 410 FDA and ISO Requirements for the Development and Manufacturing of Medical Devices",
        "What is the most valuable student organization you’ve joined? BMES because I am currently working on developing a prosthetic arm with colleagues that will benefit a young boy named Drew.",
        "Favorite restaurant in Chicago: Au Cheval because it’s such an culinary gem that isn’t expensive. Try the burger and the duck heart gravy (trust me).",
        "Bioengineering, BS ’21 | Bloomington, IL",
        "Why did you choose UIC? I chose UIC Engineering because of what the city and college has to offer me and because I wanted to go to a top notch engineering program in Illinois.",
        "Favorite course: BIOE 240 Modeling Physiological and Data Systems, It is one of the foundations of Bioengineering where you learn programming.",
        "Favorite thing about the department you’re majoring in: Professor Les Bogdanowicz",
        "Dream job: Designing prosthetics",
        "Bioengineering, BS ’21 | Woodridge, IL",
        "Name one thing you think UIC does better than anywhere else: It allows such a vast diversity of cultures and ideas to mix and collaborate.",
        "Favorite thing about the department you’re majoring in: Definitely the professors who are able to make any material they talk about interesting, especially Salman Khetani and Les Bogdanowicz.",
        "Engineering project/assignment you did that you’re most proud of: My current research in the MTM lab. I’m currently investigating the effects of a chemotherapy drug on a specific cancer cell type.",
        "Favorite restaurant in Chicago: Jim’s Original. It has cheap and classic food."
    ],
    "out_links": [
        "https://bioe.uic.edu/",
        "http://uic.edu/",
        "https://bioe.uic.edu/undergraduate/",
        "https://bioe.uic.edu/undergraduate/admissions/",
        "https://bioe.uic.edu/undergraduate/admitted-students/",
        "https://bioe.uic.edu/undergraduate/accreditation/",
        "https://bioe.uic.edu/undergraduate/bioengineering-major/",
        "https://bioe.uic.edu/undergraduate/bioinformatics-major/",
        "https://bioe.uic.edu/undergraduate/bioengineering-minor/",
        "https://bioe.uic.edu/undergraduate/courses-undergraduate/",
        "https://bioe.uic.edu/internships-and-jobs/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://bioe.uic.edu/undergraduate-student-organizations/",
        "https://bioe.uic.edu/undergraduate/student-resources-undergraduate/",
        "https://bioe.uic.edu/graduate/",
        "https://bioe.uic.edu/graduate/admissions/",
        "https://bioe.uic.edu/graduate/admitted-students/",
        "https://bioe.uic.edu/graduate/courses-graduate/",
        "https://bioe.uic.edu/graduate/ms-programs/",
        "https://bioe.uic.edu/graduate/phd-programs/",
        "https://bioe.uic.edu/graduate/dissertations/",
        "https://bioe.uic.edu/graduate/post-graduation-outcomes/",
        "https://bioe.uic.edu/graduate/graduate-student-profiles/",
        "https://bioe.uic.edu/graduate/student-resources-graduate/",
        "https://bioe.uic.edu/bioe-research/",
        "https://bioe.uic.edu/bioe-research/research-2/",
        "https://bioe.uic.edu/bioe-research/featured-research/",
        "https://bioe.uic.edu/bioe-research/grants/",
        "https://bioe.uic.edu/bioe-research/labs/",
        "https://bioe.uic.edu/faculty-and-staff/",
        "https://bioe.uic.edu/about-us/",
        "https://bioe.uic.edu/faculty-and-staff/department-head/",
        "https://bioe.uic.edu/faculty-and-staff/faculty/",
        "https://bioe.uic.edu/faculty-and-staff/affiliate-faculty/",
        "https://bioe.uic.edu/faculty-and-staff/emeriti/",
        "https://bioe.uic.edu/faculty-and-staff/staff/",
        "https://bioe.uic.edu/faculty-and-staff/faculty-jobs/",
        "https://bioe.uic.edu/bioe-news/",
        "https://bioe.uic.edu/bioe-news/annual-report/",
        "https://bioe.uic.edu/bioe-news/newsletter/",
        "https://bioe.uic.edu/bioe-news/bioe-news-archive/",
        "https://bioe.uic.edu/bioe-events/",
        "https://bioe.uic.edu/bioe-events/upcoming-events/",
        "https://bioe.uic.edu/bioe-events/calender/",
        "https://bioe.uic.edu/bioe-events/annual-events/",
        "https://bioe.uic.edu/bioe-events/seminar-archive/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "https://medicine.uic.edu/",
        "http://maps.uic.edu/",
        "http://bioe.uic.edu/profiles/andreas-linninger-phd/",
        "http://diversity.uic.edu/",
        "http://gppa.uic.edu/",
        "https://makerspace.uic.edu/",
        "https://clinicalimmersion.uic.edu/",
        "https://ecc.uic.edu/freshman-internship-program/",
        "https://catalog.uic.edu/ucat/course-descriptions/bioe/",
        "https://bmes.students.uic.edu/",
        "https://catalog.uic.edu/all-course-descriptions/bioe/",
        "https://bioe.uic.edu/profiles/bogdanowicz-les/",
        "https://bioe.uic.edu/profiles/salman-khetani-phd/",
        "https://admissions.uic.edu/apply-now",
        "https://financialaid.uic.edu/",
        "https://forms.uofi.uic.edu/sec/1820274",
        "https://bioe.uic.edu/undergraduate/bioengineering-major/dual-degree-bs-ms/",
        "https://bioe.uic.edu/internships-and-jobs/research-experiences-for-undergraduates/",
        "https://bioe.uic.edu/undergraduate/student-resources-undergraduate/undergraduate-academic-advising/",
        "https://bioe.uic.edu/contact/",
        "https://ehso.uic.edu/",
        "https://drc.uic.edu/",
        "https://www.uic.edu/about/visit-directions",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://bioe.uic.edu/bioepay/",
        "https://bioe.uic.edu/hr-procedures/",
        "https://bioe.uic.edu/rooms/",
        "https://bioe.uic.edu/media-resources/",
        "https://bioe.uic.edu/teaching-resources/",
        "https://bioe.uic.edu/teaching-online/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}