{
    "url": "https://bioe.uic.edu/graduate/courses-graduate/",
    "title": "Courses | Richard & Loan Hill Department of Bioengineering | University of Illinois at Chicago",
    "text": [
        "This page provides access to information about current course offerings in bioengineering. Both graduate and undergraduate courses can be found here.",
        "The course catalog is maintained by the university. Visit the bioengineering department’s catalog page to see up-to-date course codes and descriptions for classes in both bioengineering and bioinformatics.",
        "The objective of this course is to provide general aspects of dental science and research for undergraduate students. The course will include (i) introduction to dentistry (ii) basics of clinical procedures (iii) basics of restorative dentistry/implants (iv) basics of endodontics (v) biomaterials used in dentistry (vi) biomechanics aspects in dentistry/TMJ disorder (vii) clinical concerns/challenges (viii) surgery room animations (ix) new drug delivery system. Students will be able to understand the basics of dental science. They will also learn the advancements in dentistry, such as new biomaterials, biosensors, and diagnostic tools. This course is suitable for students who are interested in pre-dental or research related to dental/oral science. It is open to undergraduate and graduate students in bioengineering, biological science, applied heath science, mechanical engineering, or materials engineering.",
        "Over the past decade, wearables and nearables technologies have revolutionized and quantified multiple aspects of our lives including sports, fitness, entertainment, medicine, and health monitoring. In this course, we will learn how to design and fabricate wearables and nearables devices. The course provides the opportunity to work in cross-disciplinary groups and develop the skill set needed to be part of this emerging field. This new, exciting class combines various sensors, software platforms, and Bluetooth technology to create wearable and nearable devices. An open-ended project module will allow you the option to collaborate with a selected industry partner on a real-world problem, potentially leading to a future internship. This course is open to a total of 32 undergraduate and graduate students in bioengineering, computer science, or electrical and computer engineering. Students must have a background in circuit design via ECE 115 and ECE 210.",
        "Manual palpation represents one of the most traditional diagnostic methods. The sensitivity of manual palpation is rooted in the correlation of pathological changes with the mechanical behavior of biological tissue. While medical doctors can only qualitatively assess the stiffness of tissue by touch near to the body’s surface, some elastographic techniques are capable of determining the mechanical properties deep inside the organs. Therefore, Elastography has diagnostic potential for a variety of diseases, such as hepatic fibrosis and neurodegenerative brain diseases. This course is highly interdisciplinary and covers problems related to continuum mechanics, biorheology, MRI and image processing. We will review the theoretical foundations of Elastography and the students will receive an overview of elastographic techniques. The emphasis of this course will be on Magnetic Resonance Elastography (MRE). By the end of this course, the students will understand how mechanical waves are measured using MRI and they will be proficient in processing MRI data for the calculation of viscoelastic material parameters, such as the tissue stiffness.",
        "Theory of acoustics in fluids and solids. Measurement methods. Medical diagnostic & imaging applications: cardiovascular and pulmonary acoustics, ultrasound, dynamic elastography. Students must have graduate standing in an engineering program or permission of the instructor. Must have had differential equations (e.g. Math 220) with grade of B or better.",
        "This course is designed to teach students the fundamentals of key organ systems in the human body from a quantitative perspective such that certain aspects of the systems can be understood at a more intuitive level and be used to predict physiological outcomes for needs in healthcare. Students will also be introduced to cutting edge examples in bioengineering research and development in which physiological principles are being used in academic and industrial settings to design model systems for different applications, such as drug development and regenerative medicine (i.e. cell-based therapies for patients suffering from organ failure). The knowledge gained in this course will be invaluable to make students well-rounded bioengineers in their current degree program but also beyond in the job market. Both graduate students and undergraduate students are welcome to take this course since the instructor will provide adequate guidance and materials to ensure that students with different backgrounds can succeed in the course."
    ],
    "out_links": [
        "https://bioe.uic.edu/",
        "http://uic.edu/",
        "https://bioe.uic.edu/undergraduate/",
        "https://bioe.uic.edu/undergraduate/admissions/",
        "https://bioe.uic.edu/undergraduate/admitted-students/",
        "https://bioe.uic.edu/undergraduate/accreditation/",
        "https://bioe.uic.edu/undergraduate/bioengineering-major/",
        "https://bioe.uic.edu/undergraduate/bioinformatics-major/",
        "https://bioe.uic.edu/undergraduate/bioengineering-minor/",
        "https://bioe.uic.edu/undergraduate/courses-undergraduate/",
        "https://bioe.uic.edu/internships-and-jobs/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://bioe.uic.edu/undergraduate-student-organizations/",
        "https://bioe.uic.edu/undergraduate/undergraduate-student-profiles-bioe/",
        "https://bioe.uic.edu/undergraduate/student-resources-undergraduate/",
        "https://bioe.uic.edu/graduate/",
        "https://bioe.uic.edu/graduate/admissions/",
        "https://bioe.uic.edu/graduate/admitted-students/",
        "https://bioe.uic.edu/graduate/ms-programs/",
        "https://bioe.uic.edu/graduate/phd-programs/",
        "https://bioe.uic.edu/graduate/dissertations/",
        "https://bioe.uic.edu/graduate/post-graduation-outcomes/",
        "https://bioe.uic.edu/graduate/graduate-student-profiles/",
        "https://bioe.uic.edu/graduate/student-resources-graduate/",
        "https://bioe.uic.edu/bioe-research/",
        "https://bioe.uic.edu/bioe-research/research-2/",
        "https://bioe.uic.edu/bioe-research/featured-research/",
        "https://bioe.uic.edu/bioe-research/grants/",
        "https://bioe.uic.edu/bioe-research/labs/",
        "https://bioe.uic.edu/faculty-and-staff/",
        "https://bioe.uic.edu/about-us/",
        "https://bioe.uic.edu/faculty-and-staff/department-head/",
        "https://bioe.uic.edu/faculty-and-staff/faculty/",
        "https://bioe.uic.edu/faculty-and-staff/affiliate-faculty/",
        "https://bioe.uic.edu/faculty-and-staff/emeriti/",
        "https://bioe.uic.edu/faculty-and-staff/staff/",
        "https://bioe.uic.edu/faculty-and-staff/faculty-jobs/",
        "https://bioe.uic.edu/bioe-news/",
        "https://bioe.uic.edu/bioe-news/annual-report/",
        "https://bioe.uic.edu/bioe-news/newsletter/",
        "https://bioe.uic.edu/bioe-news/bioe-news-archive/",
        "https://bioe.uic.edu/bioe-events/",
        "https://bioe.uic.edu/bioe-events/upcoming-events/",
        "https://bioe.uic.edu/bioe-events/calender/",
        "https://bioe.uic.edu/bioe-events/annual-events/",
        "https://bioe.uic.edu/bioe-events/seminar-archive/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "https://medicine.uic.edu/",
        "http://maps.uic.edu/",
        "https://catalog.uic.edu/all-course-descriptions/bioe/",
        "https://admissions.uic.edu/graduate-professional/apply",
        "https://bioe.uic.edu/graduate/admissions/financial-aid-and-funding/",
        "https://forms.uofi.uic.edu/sec/1820274",
        "https://bioe.uic.edu/graduate/admitted-students/grad-faq/",
        "https://bioe.uic.edu/graduate/ms-programs/ms-in-bioengineering/",
        "https://bioe.uic.edu/graduate/ms-programs/ms-in-bioinformatics/",
        "https://bioe.uic.edu/graduate/ms-programs/ms-thesis-guidelines/",
        "https://bioe.uic.edu/graduate/phd-programs/phd-bioengineering/",
        "https://bioe.uic.edu/graduate/phd-programs/phd-bioinformatics/",
        "https://bioe.uic.edu/graduate/phd-programs/annual-phd-evaluation/",
        "https://bioe.uic.edu/graduate/phd-programs/preliminary-exams/",
        "https://bioe.uic.edu/graduate/phd-programs/dissertation-process/",
        "https://bioe.uic.edu/graduate/student-resources-graduate/fellowships-and-awards/",
        "https://bioe.uic.edu/contact/",
        "https://ehso.uic.edu/",
        "https://drc.uic.edu/",
        "https://www.uic.edu/about/visit-directions",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://bioe.uic.edu/bioepay/",
        "https://bioe.uic.edu/hr-procedures/",
        "https://bioe.uic.edu/rooms/",
        "https://bioe.uic.edu/media-resources/",
        "https://bioe.uic.edu/teaching-resources/",
        "https://bioe.uic.edu/teaching-online/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}