{
    "url": "https://bioe.uic.edu/bioe-news/bioe-news-archive/",
    "title": "News Archive | Richard & Loan Hill Department of Bioengineering | University of Illinois at Chicago",
    "text": [
        "Click or tap a year to expand.",
        "2/23 – Associate Professor Tolou Shokuhfar published a paper titled “Nanocomposite materials in orthopedic applications” in the Frontiers of Chemical Science and Engineering Journal.",
        "1/9 – The BiAffect App developed by UIC professor Alex Leow is mentioned in Rolling Stone magazine.",
        "1/7 – The BiAffect App developed by UIC professor Alex Leow is covered in an Associated Press article run by The New York Times.",
        "1/4 – Associate Professor Tolou Shokuhfar published a paper titled “Investigation of the magnetosome biomineralization in magnetotactic bacteria using graphene liquid cell – transmission electron microscopy” in Nanoscale Journal.",
        "1/2 – Richard and Loan Hill Professor Ian Papautsky published a paper titled “Isolation of circulating tumor cells in non-small-cell-lung-cancer (NSCLC) patients using a multi-flow microfluidic channel” in the Microsystems & Nanoengineering Journal.",
        "12/19 – Richard and Loan Hill Professor Ian Papautsky received an MPI/R01 Development Award for his Translational Oncology Program proposal.",
        "12/17 – Richard and Loan Hill Professor Xincheng Yao has a study titled “Miniaturized indirect ophthalmoscopy promises an affordable solution to foster smartphone wide-field fundus photography in telemedicine” featured in Advances in Engineering.",
        "12/3 – Minhaj Alam of Dr. Yao’s Biomedical Optics and Functional Imaging Laboratory received the Provost’s Graduate Research Award.",
        "11/29 – Professor Andreas Linninger has a paper titled “Simulations of blood as a suspension predicts a depth dependent hematocrit in the circulation throughout the cerebral cortex” featured in PLoS Computational Biology.",
        "11/21 – Dr. Jie Liang, Professor at UIC Bioengineering, published a paper titled: Probabilistic control of HIV latency and transactivation by the Tat gene circuit",
        "11/17 – Associate Professor Tolou Shokuhfar published a paper titled “Considerations for imaging thick, low contrast, and beam sensitive samples with liquid cell transmission electron microscopy.”",
        "10/15 – Ramille Shah received an NIH R21 grant.",
        "10/12 – The BiAffect App created by Professor Alex Leow is covered in the Wall Street Journal.",
        "9/12 – Richard and Loan Hill Professor Ian Papautsky developed a finger-prick blood test for toxic metals.",
        "9/6 – UIC is ranked among top 10 ‘Best Value’ universities by the Wall Street Journal and Times Higher Education.",
        "9/1 – Richard and Loan Hill Professor Ian Papautsky and collaborator Erin Haynes from the University of Cincinnati) received a $1.7M NIH R33 grant titled “Validation and Demonstration of Point-of-Care Sensor for Multi-Metal Exposure Assessment.”",
        "8/24 – The UIC Engineering World Health (EWH) team won second place in the EWH Design Competition for their design of a hearing test device.",
        "8/1 – Associate Professor Tolou Shokuhfar was accepted into Crain’s Leadership Academy.",
        "12/1 – Gamze Gursoy of the Liang lab received the Annual Outstanding Thesis and Dissertation Award.",
        "12/1 – Shreyan Majumdar of the Klatt lab received the Chancellor’s Graduate Research Award.",
        "12/1 – Wei Tian of the Liang lab received a Provost Deiss Award.",
        "9/27 – Professor Urmila Diwekar was the keynote speaker at the fifth International Summit on Medical Biology and Bioengineering in Chicago.",
        "9/17 – Professor Urmila Diwekar was a speaker at the Symposium on Global Sustainability at Academy of Hungary in Rome.",
        "9/11 – Shresta Patangay of the Hetling lab received an honorable mention in UIC’s 2017 Image of Research competition.",
        "8/30 – Professor Andreas Linninger received a three-year, $297,000 NSF grant for “Computational platform for predictive magnetohydrodynamic drug targeting.”",
        "8/29 – UIC MIE Professor Reza Shahbazian-Yassar and co-investigator Associate Professor Tolou Shokuhfar received a three-year, $390,000 NSF award for “Fundamental Understanding of Growth and Inhibition of Calcium Oxalate Kidney Stones.”",
        "8/24 – Professor Salman Khetani received a three-year, $300,000 NSF grant for “Collaborative Research: High-throughput microliver platform for drug toxicity screening.” This is a collaborative grant with Assistant Professor David Wood of the University of Minnesota Department of Biomedical Engineering.",
        "8/23 – Professor Jie Liang and Co-I Amy Kenter, PhD, of the UIC Department of Microbiology and Immunology in the UIC College of Medicine, received a two-year, $420,000 NIH R21 grant for “Constructing Ensembles of 3D Structures of Igh Locus and Predicting Novel Chromosomal Interactions.”",
        "8/04 – Professor Andreas Linninger and Co-PI Ali Alaraj, MD, of the UIC Department of Neurosurgery, received a two-year, $420,000 NIH R21 grant for “A vascular tree topology inspired platform to compute intracranial blood flow (tree CFD).”",
        "6/30 – Associate Professor Ao Ma received a three-year, $405,000 NSF grant for “Conformational dynamics, reaction coordinates, and time scale separation in biomolecular systems from the perspective of energy flows.”",
        "6/08 – Associate Professor David Eddington received a $416,000 two-year NIH R21 grant for “Confined Genetic Transformation and Exchange of Antibiotic Resistance Genes in Femtoliter Microdroplets.”",
        "5/25 – Ahmed Metwally, a bioinformatics PhD student in the Yang Dai lab, won second place for his poster “Microbiome Dynamics as Predictors of Lung Transplant Rejection” at the Great Lakes Bioinformatics Conference (GLBIO’17) and the Scientific Excellence Award for first-place poster at the UIC Department of Medicine Scholarly Activities Day.",
        "5/22 – Ahmed Metwally, a bioinformatics PhD student co-advised by Yang Dai and David Perkins, received a CCTS Pre-doctoral Education for Clinical and Translational Scientists (PECTS) Fellowship.",
        "5/17 – UIC News story: East Meets West: Engineering, dentistry collaboration leads to new biomaterials.",
        "5/16 – UIC News story: App that tracks bipolar manic, depressive episodes wins award.",
        "4/12 – Clinical Associate Professor Miiri Kotche received a Fulbright award to study in Finland.",
        "4/1 – Nicholas Marjanovic, Kevin Kerr, Ricardo Aranda, and Hananeh Esmailbeigi, who comprise the BMES Tongue-Computer Interface project team, were awarded a VentureWell E-Team Program grant.",
        "3/14 – A UIC bioengineering student was awarded a Gates Cambridge Scholarship.",
        "2/28 – The Engineering World Health team achieved official Performance Certification for Laminar Airflow Equipment from LabMetrics, Inc.",
        "2/21 – Peter Nelson and Alex Leow led a team that developed an app called BiAffect, ­which can monitor mobile device usage to predict manic and depressive moods in people diagnosed with bipolar disorder.",
        "2/14 – Vidyani Suryadevara and Shreya Ghosh received the fall 2016 Chancellor’s Graduate Research Award.",
        "2/13 – The article “Room temperature TiO2 ALD on collagen membrane from a titanium alkylamide precursor” by Christos G. Takoudis, Arghya K Bishal, and Cortino Sukotjo was featured as editor’s pick in  JVST."