{
    "url": "https://jobs.uic.edu/job-board/job-details?job=lecturer-non-tenure-track-computer-science&jobID=122794",
    "title": "Job Details: Lecturer Non-Tenure Track / Computer Science",
    "text": [
        "",
        "The University of Illinois at Chicago (UIC) is one of the top-ten most diverse universities in the US (US News and World Report), a top-ten best value (Wall Street Journal and Times Higher Education) and an hispanic serving institution. UIC’s hometown of Chicago epitomizes the modern, livable, vibrant city. Located on the shore of Lake Michigan, Chicago offers an outstanding array of cultural and culinary experiences. As the birthplace of the modern skyscraper, Chicago boasts one of the world’s tallest and densest skylines, combined with an 8100-acre park system and extensive public transit and biking networks.",
        "",
        "Minimum qualifications include an MS in Computer Science or a closely related field or appropriate graduate degrees for specific course material (e.g., computer ethics), and either (a) demonstrated evidence of effective teaching, or (b) convincing argument of future dedication and success in the art of teaching. Applications are submitted online at https://jobs.uic.edu/. In the online application include a curriculum vitae, names and addresses of at least three references, a statement providing evidence of effective teaching, a statement describing your past experience in activities that promote diversity and inclusion (or plans to make future contributions), and recent teaching evaluations. For additional information contact Professor Mitch Theys, Committee Chair, mtheys@uic.edu.",
        "",
        "For fullest consideration, please apply by October 15, 2019. We will continue to accept and review applications until the positions are filled.",
        "",
        "The University of Illinois is an Equal Opportunity, Affirmative Action employer. Minorities, women, veterans and individuals with disabilities are encouraged to apply. The University of Illinois conducts background checks on all job candidates upon acceptance of contingent offer of employment. Background checks will be performed in compliance with the Fair Credit Reporting Act.",
        "Teaching",
        "MS in Computer Science or closely related field",
        "",
        "The University of Illinois at Chicago is an Equal Opportunity, Affirmative Action employer. Minorities, women, veterans and individuals with disabilities are encouraged to apply.",
        "",
        "The University of Illinois may conduct background checks on all job candidates upon acceptance of a contingent offer. Background checks will be performed in compliance with the Fair Credit Reporting Act.",
        "Copyright 2016 The Board of Trustees of the University of Illinois | Web Privacy Statement"
    ],
    "out_links": [
        "https://jobs.uic.edu/",
        "https://jobs.uic.edu/civil-service-positions/civil-service-positions-details?jobID=240",
        "https://jobs.uic.edu/help",
        "http://jobs.uic.edu/job-board/default.cfm?per=5000&start=1",
        "https://jobs.uic.edu/Chicago/default.cfm?per=5000&start=1",
        "https://jobs.uic.edu/DSCC/default.cfm?per=5000&start=1",
        "https://jobs.uic.edu/JMLS/default.cfm?per=5000&start=1",
        "https://jobs.uic.edu/Peoria/default.cfm?per=5000&start=1",
        "https://jobs.uic.edu/Rockford/default.cfm?per=5000&start=1",
        "https://jobs.uic.edu/UI_Health/default.cfm?per=5000&start=1",
        "https://jobs.uic.edu/nursing/default.cfm?per=5000&start=1",
        "https://jobs.uic.edu/job-search/default.cfm?per=5000&start=1",
        "https://jobs.uic.edu/job-board",
        "https://clery.uic.edu/"
    ]
}