{
    "url": "https://uic.edu/admissions-aid/",
    "title": "University of Illinois at Chicago",
    "text": [
        "Always Active",
        "Due to the COVID-19 pandemic, we are continuing to accept first-year and transfer applications for Fall 2020.",
        "Discover your potential at Chicago’s only public research university.",
        "University of Illinois at Chicago is Chicago’s largest university and one of the nation’s top 200 research universities. Here you will learn from faculty who make the discoveries that other universities’ faculty teach. With one faculty member for every 19 students, you will receive the support and encouragement you need to succeed.",
        "With 16 colleges and dozens of programs of study, you can explore your potential in life sciences, physical sciences, social sciences, arts, business, law, technology and more. Outside the classroom, there are plenty of activities to indulge your interests and to help you connect with classmates.",
        "Current high school students, as well as high school graduates applying for college for the first time, should apply as first-year students. First-year applications are accepted only for the fall semester. Learn more about requirements and deadlines for first-year applications",
        "Use the transfer application if you are a transfer student, seeking readmission to UIC, applying for a second bachelor’s degree or are applying for non-degree study. Requirements and application deadlines for transfer admission vary depending on which college you choose.",
        "The UIC Honors College provides outstanding students with a more challenging learning environment in a small community setting. Honors College students receive all the benefits of a small college experience while enjoying the opportunities that exist within a major research university. Students learn both inside and outside the classroom, as they explore issues in-depth through special projects and classes designed to enhance academic growth and independence.",
        "UIC offers more than 150 graduate programs in the arts, humanities, social sciences, life sciences, physical sciences, health sciences and engineering. Details on each degree program can be found on each program’s website. Admission requirements and deadlines differ for domestic and international students.",
        "College graduates may also apply to UIC’s graduate-level certificate and non-degree programs. Each requires a different application.",
        "Are you a distance learner? UIC offers online graduate programs in growing fields of health care, education and engineering.",
        "UIC provides international students with opportunities to take advantage of its role as Chicago’s only public Research I university. The city’s largest university welcomes thousands of international students and scholars each year and provides hundreds of students with the opportunity to study abroad. Chicago provides a home to many Global 500 Fortune companies including Google, Boeing, United Airlines and Caterpillar.",
        "UIC also houses a number of internationally recognized and globally engaged research centers in urban studies, architecture, public health, social work, medicine and engineering.",
        "Guaranteed Professional Programs Admission assures qualified first-year students that they can pursue a professional degree at UIC after succeeding in their bachelor’s degree.",
        "“My interaction with faculty through GPPA motivated me to be more proactive in patient care. Pharmacists have the responsibility to educate and empower patients.”",
        "—Joseph Dang, UIC pharmacy student, second year",
        "UIC’s Extended Campus offers workshops, courses and degrees to help life-long learners gain new opportunities in today’s growing fields.",
        "The Tutorium for Intensive English offers English courses to international students, from beginning to advanced. English for International Professionals serves those who speak intermediate to advanced English and want to improve their writing and speaking skills.",
        "Do you attend a different school but want to take a course or two in the summer to offset your workload in the coming year? Then UIC’s Summer Session is for you.",
        "UIC’s convenient downtown location makes it easy to combine your studies with work and fun in the city. More than 300 courses — in nearly 50 subject areas — are available in either a four- or eight-week session, offering the flexibility and options you need."
    ],
    "out_links": [
        "http://maps.uic.edu/",
        "http://www.uic.edu/apps/departments-az/search",
        "https://uic.edu/about/contact-us/",
        "http://library.uic.edu/",
        "http://oge.uic.edu/",
        "https://today.uic.edu/resources/current-students",
        "https://today.uic.edu/resources/faculty-staff",
        "https://uihealth.uic.edu/",
        "https://give.uic.edu/",
        "https://uic.edu/",
        "https://uic.edu/admissions-aid/visit-campus/",
        "https://uic.edu/admissions-aid/paying-for-college/",
        "https://uic.edu/academics/",
        "https://uic.edu/academics/programs-of-study/",
        "https://uic.edu/academics/colleges-schools/",
        "https://uic.edu/academics/student-support/",
        "https://uic.edu/research/",
        "https://uic.edu/research/research-impact/",
        "https://uic.edu/research/research-strengths/",
        "https://uic.edu/research/resources-facilities/",
        "https://uic.edu/research/student-research/",
        "https://uic.edu/life-at-uic/",
        "https://uic.edu/life-at-uic/living-on-around-campus/",
        "https://uic.edu/life-at-uic/campus-resources/",
        "https://uic.edu/chicago/",
        "https://uic.edu/chicago/exploring-chicago/",
        "https://uic.edu/chicago/city-transportation/",
        "https://uic.edu/chicago/essential-chicago/",
        "https://uic.edu/alumni/",
        "https://uic.edu/about/",
        "https://uic.edu/about/visit-directions/",
        "https://uic.edu/about/history/",
        "https://uic.edu/about/leadership/",
        "https://uic.edu/about/public-media-resources/",
        "https://uic.edu/about/job-opportunities/",
        "https://uic.edu/about/acerca/",
        "https://admissions.uic.edu/",
        "http://admissions.uic.edu/visit-us",
        "http://admissions.uic.edu/events",
        "http://admissions.uic.edu/undergraduate/requirements-deadlines/first-year-requirements",
        "http://admissions.uic.edu/apply-now",
        "http://admissions.uic.edu/undergraduate/requirements-deadlines/transfer-requirements",
        "http://admissions.uic.edu/undergraduate",
        "http://admissions.uic.edu/undergraduate/tuition-financial-aid",
        "http://admissions.uic.edu/undergraduate/requirements-deadlines/international-requirements",
        "http://www.uic.edu/honors/",
        "http://catalog.uic.edu/gcat/degree-programs/grad-prof-degree-programs/",
        "http://admissions.uic.edu/graduate-professional/requirements-deadlines",
        "http://admissions.uic.edu/graduate-professional/requirements-deadlines/graduate-certificates",
        "http://admissions.uic.edu/graduate-professional/requirements-deadlines/non-degree-study",
        "http://scs.uic.edu/uiconline/",
        "http://admissions.uic.edu/graduate-professional",
        "http://admissions.uic.edu/graduate-professional/requirements-deadlines/international-requirements",
        "https://gppa.uic.edu/",
        "http://gppa.uic.edu/",
        "https://extendedcampus.uic.edu/",
        "http://www.uic.edu/depts/tie/",
        "http://extendedcampus.uic.edu/",
        "http://summer.uic.edu/",
        "https://accc.uic.edu/service/g-suite",
        "https://my.uic.edu/",
        "https://outlook.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "http://catalog.uic.edu/ucat/academic-calendar/",
        "http://events.uic.edu/",
        "http://today.uic.edu/",
        "http://clery.uic.edu/",
        "http://oae.uic.edu/UnlawfulDiscrimination/index.htm",
        "http://oae.uic.edu/sexual-misconduct/",
        "http://financialaid.uic.edu/consumer-information/department-education-complaint-process/",
        "http://disabilityresources.uic.edu/",
        "http://emergency.uic.edu/",
        "https://maps.uic.edu/",
        "http://www.uic.edu/depts/dos/studentveteranaffairs.shtml",
        "http://admissions.uic.edu/undergraduate/request-information",
        "http://advance.uic.edu/alumni-association/",
        "https://news.uic.edu/social-media-directory"
    ]
}