{
    "url": "https://uic.edu/chicago/",
    "title": "University of Illinois at Chicago",
    "text": [
        "Always Active",
        "Travel the world without leaving Chicago",
        "There are 77 community neighborhoods within the city, made up of people from all ethnicities. Greek, Polish, Hispanic, Chinese, Irish, Italian, Lithuanian and African are just a smattering of cultures that can be found in America’s third-largest city.",
        "You can dine at ethnic restaurants, visit museums to learn about diverse traditions and attend parades featuring various nationalities. Chicago truly is a melting pot.",
        "This is the area that UIC calls home. Lying between the east and west sides of campus and stretching from our north to south, it’s an area that is diverse both ethnically and socioeconomically. Once known as “Hull House neighborhood,” Jane Addams’ original home and the resident’s dining hall still stand as a museum. Other nearby icons include the Christopher Columbus statue and Our Lady of Pompeii church. While University Village bustles with new housing and businesses, Little Italy’s heritage is displayed prominently in the restaurants of Taylor Street.",
        "Located to the south of UIC, Pilsen got its name in the late 19th century from the mostly Czech immigrant population. During the 1960s, there was a large growth in the Latino population in the area and it is now the largest Mexican-American neighborhood in Chicago. The neighborhood celebrates its culture and art with colorful public murals and mosaics, as well as art galleries and museums. The real flavor of the area comes through in the Mexican bakeries, restaurants and groceries that line the active 18th Street corridor.",
        "Once the home of factories, wholesale markets and warehouses, the West Loop is one of Chicago’s fastest growing neighborhoods. Among the rising loft and condo buildings are tech firms, retailers and restaurants. Located at the north end of the UIC campus, also boasts art galleries, dance companies, designers, boutiques and music venues. At the edge of the neighborhood is Greektown, which holds strong to its Greek heritage and celebrates Greek food and traditions even as the rest of the area transforms.",
        "From the lakefront to the Loop, Navy Pier to Soldier Field shines Chicago’s favorite playground for locals and global visitors alike. Navy Pier is now home to amusement rides and sightseeing, but once hosted the World’s Columbian Exposition. It was later used for Navy training then housed UIC’s first campus. Grant, Millennium and Maggie Daley parks offer fun, culture, sights and sounds for all. Farther south is the Museum Campus with three natural science museums: Adler Planetarium, Shedd Aquarium and the Field Museum. Inland, the Loop has everything from tours to shopping to horse carriage rides.",
        "If you take the CTA Blue Line “L” train north from UIC, you’ll find the opportunity to explore the wide-ranging communities of Logan Square, Wicker Park and Bucktown. Logan Square, with its proud working-class history, is home to local, farm-to-table and vegan eateries alongside pizzerias and pubs. The prominent, historical boulevards weave wide grassy medians and tree-lined streets through the neighborhood, connecting a string of parks. Wicker Park and Bucktown are known for their art galleries, local boutiques and bookstores alongside great restaurants, nationally recognized designers and major retailers.",
        "South of UIC and Pilsen are the neighborhoods of Chinatown and Bridgeport. As its name suggests, Chinatown is home to a large population of people of Chinese descent. Chinese culture is reflected throughout the community in the many specialty shops, authentic cultural cuisine and signature landmarks. Home to the Chicago White Sox, Bridgeport has also been the home or birthplace of five Chicago mayors. Once a largely Irish-American neighborhood, the area has become one of the city’s more ethnically diverse communities."
    ],
    "out_links": [
        "http://maps.uic.edu/",
        "http://www.uic.edu/apps/departments-az/search",
        "https://uic.edu/about/contact-us/",
        "http://library.uic.edu/",
        "http://oge.uic.edu/",
        "https://today.uic.edu/resources/current-students",
        "https://today.uic.edu/resources/faculty-staff",
        "https://uihealth.uic.edu/",
        "https://give.uic.edu/",
        "https://uic.edu/",
        "https://uic.edu/admissions-aid/",
        "https://uic.edu/admissions-aid/visit-campus/",
        "https://uic.edu/admissions-aid/paying-for-college/",
        "https://uic.edu/academics/",
        "https://uic.edu/academics/programs-of-study/",
        "https://uic.edu/academics/colleges-schools/",
        "https://uic.edu/academics/student-support/",
        "https://uic.edu/research/",
        "https://uic.edu/research/research-impact/",
        "https://uic.edu/research/research-strengths/",
        "https://uic.edu/research/resources-facilities/",
        "https://uic.edu/research/student-research/",
        "https://uic.edu/life-at-uic/",
        "https://uic.edu/life-at-uic/living-on-around-campus/",
        "https://uic.edu/life-at-uic/campus-resources/",
        "https://uic.edu/chicago/exploring-chicago/",
        "https://uic.edu/chicago/city-transportation/",
        "https://uic.edu/chicago/essential-chicago/",
        "https://uic.edu/alumni/",
        "https://uic.edu/about/",
        "https://uic.edu/about/visit-directions/",
        "https://uic.edu/about/history/",
        "https://uic.edu/about/leadership/",
        "https://uic.edu/about/public-media-resources/",
        "https://uic.edu/about/job-opportunities/",
        "https://uic.edu/about/acerca/",
        "https://accc.uic.edu/service/g-suite",
        "https://my.uic.edu/",
        "https://outlook.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "http://catalog.uic.edu/ucat/academic-calendar/",
        "http://events.uic.edu/",
        "http://today.uic.edu/",
        "http://clery.uic.edu/",
        "http://oae.uic.edu/UnlawfulDiscrimination/index.htm",
        "http://oae.uic.edu/sexual-misconduct/",
        "http://financialaid.uic.edu/consumer-information/department-education-complaint-process/",
        "http://disabilityresources.uic.edu/",
        "http://emergency.uic.edu/",
        "https://maps.uic.edu/",
        "http://www.uic.edu/depts/dos/studentveteranaffairs.shtml",
        "http://admissions.uic.edu/visit-us",
        "http://admissions.uic.edu/undergraduate/request-information",
        "http://admissions.uic.edu/apply-now",
        "http://advance.uic.edu/alumni-association/",
        "https://news.uic.edu/social-media-directory"
    ]
}