{
    "url": "https://dcc.uic.edu/",
    "title": "Disability Cultural Center | University of Illinois at Chicago",
    "text": [
        "(Photo above:) A handpainted mural in the Disability Cultural Center lounge that is a large blue circle with the words “you are not alone” and some birds. It’s been written on by various visitors to the center and has a border of fairy lights. Next to the mural is a lamp and a whiteboard with: “Welcome to the Disability Cultural Center! We’re glad you’re here,” and information about the space. Above the whiteboard is a pennant with fabric flags showing a cross-disability solidarity logo and Harriet Tubman.",
        "The Disability Cultural Center has now completely moved from our physical location on campus to a virtual presence. While this means that our physical Center will be closed, please know that we are here for you. Don’t hesitate to:",
        "As we move to remote and online versions of community, we are leaning on a deep repository of practical wisdom that has been built by disabled and sick communities for years before the current COVID-19 situation. With some changes, we will continue to hold events; offer check-ins and support (about *anything*); connect folks to resources; and continue our collective conversations about disability, ableism, and disability culture.",
        "We have compiled some of this amazing practical wisdom, along with other resources, into a living Google document, “Interdependent UIC: Accessibility Considerations for Remote Access.” Many of these resources are focused on people who are doing the immense and often uncompensated labor of moving things online. If you are teaching or if you help facilitate a student or other organization, we encourage you check it out! The primary goal of this document is to make sure we are thinking about the things that fall through the cracks in public health-focused discourses around COVID-19. Share it! Contribute to it by getting in touch! It’s a living document, so please let us know if we can add any resources–or start digging any up.",
        "Our friends at the other six Centers for Cultural Understanding and Social Change will also continue their important work; in light of UIC’s most recent announcements, all of the Centers’ physical spaces are closed, but we are all available virtually. Check out the “Interdependent UIC” document for those details as they become available.",
        "We will be holding our remote events via Zoom with CART (real-time captioning), and as soon as they’re available, instructions for getting a Zoom link will be added to website event listings as well as our Facebook event listings.",
        "If Zoom is not a super familiar platform for you, please see our How to Connect to Remote UIC DCC Events document for additional information. And as ever, don’t hesitate to reach out with any questions (dcc@uic.edu).",
        "In Chicago, organizer Kelly Hayes and Delia Galindo launched a financial solidarity mutual aid effort called Chicago COVID-19 Hardship and Help. This is a way for financially secure folks to give funds to people facing even more financial insecurity as a result of COVID-19. Make an ask or give what you can on their website, linked above.",
        "Kelly Hayes has also started a Google form to help coordinate neighborhood-centered mutual aid efforts– this could be making grocery runs, helping distribute information from home, offering translation help, legal help, counseling, etc. If you are interested, consider filling out the form to be contacted about joining in to support those most affected in our communities.",
        "https://docs.google.com/forms/d/e/1FAIpQLSd0MK1dnny1BTlzvohuRlnlC6fHqXKqez0hrZJLuZ6F4-qu9w/viewform",
        "Meanwhile we are hoping you’re staying well and staying safe.",
        "Margaret, Lily, Brian, Sylvie, and Jordan",
        "The Disability Cultural Center collaborates with the UIC Libraries to provide resources related to disability culture, history, and identity to the UIC community.  The library guide linked here is intended to connect DCC visitors to resources available at the UIC Libraries."
    ],
    "out_links": [
        "http://uic.edu/",
        "https://dcc.uic.edu/about/",
        "https://dcc.uic.edu/about/definitions-of-disability-culture/",
        "https://dcc.uic.edu/about/meet-our-staff/",
        "https://dcc.uic.edu/programs/",
        "https://dcc.uic.edu/eventlisting/",
        "https://dcc.uic.edu/eventlisting/events-2/",
        "https://dcc.uic.edu/eventlisting/past-events/",
        "https://dcc.uic.edu/eventlisting/community-events-bow/",
        "https://dcc.uic.edu/space/",
        "https://dcc.uic.edu/space/bodies-of-work-exhibit/",
        "https://dcc.uic.edu/contact-us/",
        "http://diversity.uic.edu/",
        "http://maps.uic.edu/",
        "https://researchguides.uic.edu/DCCLibraryGuide",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}