{
    "url": "https://library.uic.edu/about/employment/faculty-support",
    "title": "Forms of Support for Faculty",
    "text": [
        "Support for faculty research and scholarly activity is provided by the University Library both formally and informally in a variety of ways including release time, financial assistance, and peer support. There is also faculty support provided at the campus level.",
        "Research days are granted to library faculty to allow focused time to work on research:",
        "Professional leave for conference attendance and committee obligations is granted with the approval of your supervisor.",
        "The Faculty Development and Allocations Committee (FDAC) provides an annual allocation to each library faculty member to be used as support for professional development including professional memberships and conference attendance.",
        "These funds are made available to support specific research projects and are allocated based on faculty requests and with the approval of the University Librarian.",
        "The library’s mentoring program is a formal arrangement based on the campus mentoring policy. Each faculty member is paired with a more senior library faculty member who has been matched as well as possible with the mentee’s librarianship functions and research interests. The mentor and mentee meet on a regular basis to discuss and provide feedback on the mentee’s progress towards their goals in librarianship and research/scholarship. The mentor may also assist in connecting the mentee with possible service committee assignments within the library and on campus, as well as regional and/or national committees relating to the mentee’s interests.",
        "Also, informal peer-to-peer relationships develop with colleagues, who can be vital channels of information and support.",
        "A more formal onboarding process has been launched for new faculty, incorporating sessions and workshops to develop cohorts of new faculty in their first and second years.",
        "Scholarly Round-Ups are held monthly, with notifications posted on our online calendars. The format includes a 5 to 10-minute discussion by one of our library faculty on a scholarly publication or project, including impetus for the scholarship, methodology, findings, and lessons learned. The rest of the time is used for scholarship and support discussions, dry runs for conferences, and other topics proposed by faculty. Library faculty are encouraged to attend to share their research ideas, hear what others are doing, and provide support and suggestions for colleagues.",
        "The Research Coordinator consults with library faculty to identify topics of interest for workshops, which are presented periodically by various library faculty members. Topics have included developing a research or scholarly agenda, productivity and time management, and designing surveys.",
        "Faculty are encouraged to form manageable size research-focused reading and/or writing groups (pairs or groups of four are suggested). “No meeting” Fridays are an ideal day to set up a block of time for a group to meet. Group members may also want to share goals, ideas, drafts, and feedback as desired.",
        "UIC maintains a membership in the National Center for Faculty Development and Diversity. The NCFDD provides resources for faculty members’ growth and development, including a faculty success program, webinars, writing challenges, and “Monday Motivators” emails. Individual faculty members may create an account to access these resources.",
        "The Statistical Laboratory (Dept. of Mathematics, Statistics, and Computer Science) provides statistical consulting service for faculty, staff, and graduate students. The initial meeting, for the client to describe their research project to the consulting team, is free of charge. Subsequent services are provided at a fee of $50/ hour.",
        "The campus Institutional Review Board (IRB) focuses on the protection of human subjects during research conducted at UIC. Library faculty are expected to complete online training which certifies them for an initial period of two years. The faculty member may subsequently apply to the IRB for vetting and approval of their research project using human subjects (including surveys and interviews). Faculty are required to update their training every three years by completing two continuing education credits, typically by taking an online refresher course.",
        "",
        "Get More Help",
        "",
        "801 S. Morgan",
        "",
        "Chicago,",
        "IL",
        "60607",
        "",
        "1750 W. Polk St.",
        "",
        "Chicago,",
        "IL",
        "60612",
        "",
        "One Illini Drive",
        "",
        "Peoria,",
        "IL",
        "61605",
        "",
        "1601 Parkview Ave.",
        "",
        "Rockford,",
        "IL",
        "61107",
        "",
        "470 Grainger Engineering Library Information Center,",
        "1301 W. Springfield Ave.",
        "",
        "Urbana,",
        "IL",
        "61801",
        "",
        "© 2020 The Board of Trustees of the University of Illinois",
        "Privacy Policy",
        "Federal Depository Library for U.S. Government Documents",
        "GDPR"
    ],
    "out_links": [
        "http://uic.edu/",
        "https://library.uic.edu/",
        "https://library.uic.edu/help",
        "https://library.uic.edu/collections",
        "https://library.uic.edu/collections/articles",
        "https://library.uic.edu/collections/books-media",
        "https://library.uic.edu/collections/digital-images",
        "https://library.uic.edu/collections/digital-images/uic-image-collections",
        "https://library.uic.edu/special-collections-university-archives",
        "https://library.uic.edu/collections/maps-gis",
        "https://library.uic.edu/collections/uic-publications",
        "https://library.uic.edu/libraries",
        "https://library.uic.edu/libraries/daley",
        "https://library.uic.edu/libraries/daley/hours",
        "https://library.uic.edu/libraries/lhs-chicago",
        "https://library.uic.edu/libraries/lhs-chicago/hours",
        "https://library.uic.edu/libraries/lhs-peoria",
        "https://library.uic.edu/libraries/lhs-peoria/hours",
        "https://library.uic.edu/libraries/lhs-rockford",
        "https://library.uic.edu/libraries/lhs-rockford/hours",
        "https://library.uic.edu/libraries/lhs-urbana",
        "https://library.uic.edu/libraries/lhs-urbana/hours",
        "http://library.uic.edu/special-collections-university-archives",
        "https://library.uic.edu/about",
        "https://library.uic.edu/about/events",
        "https://library.uic.edu/about/news",
        "https://library.uic.edu/about/employment",
        "https://library.uic.edu/about/directory",
        "https://library.uic.edu/about/directory/liaisons",
        "https://library.uic.edu/about/directory/faculty",
        "https://library.uic.edu/about/directory/staff",
        "https://library.uic.edu/about/library-departments",
        "https://library.uic.edu/about/digital-scholarship",
        "https://library.uic.edu/about/faculty",
        "https://library.uic.edu/about/faculty/projects",
        "https://library.uic.edu/about/faculty/teaching",
        "https://library.uic.edu/about/policies",
        "https://library.uic.edu/about/policies/privacy-policy",
        "https://library.uic.edu/about/policies/code-of-conduct",
        "https://library.uic.edu/about/policies/service-policy",
        "https://library.uic.edu/about/policies/collection-development-policy",
        "https://library.uic.edu/collections/fy19-collections-changes",
        "https://library.uic.edu/help/article/1901/find-out-when-items-are-due/",
        "https://library.uic.edu/about/policies/daley",
        "https://library.uic.edu/about/policies/classroom-reservations-policy",
        "https://library.uic.edu/about/strategic-plan",
        "https://library.uic.edu/covid-19",
        "https://library.uic.edu/covid-19/covid-student-support",
        "https://library.uic.edu/about-special-collections-university-archives",
        "https://library.uic.edu/finding-aids",
        "https://library.uic.edu/rare-books",
        "http://library.uic.edu/collections/maps-gis",
        "http://library.uic.edu/collections/digital-images",
        "http://library.uic.edu/help/search?q=&t%5B%5D=29",
        "http://researchguides.uic.edu/subject/special-collections-archives",
        "https://library.uic.edu/contact",
        "https://library.uic.edu/accounts",
        "https://library.uic.edu/donate",
        "http://maps.uic.edu/",
        "http://today.uic.edu/",
        "https://www.math.uic.edu/StatLab",
        "https://library.uic.edu/help/article/1891/faculty-services",
        "https://library.uic.edu/help/article/1934/request-course-reserves-as-an-instructor",
        "https://library.uic.edu/help/search?l%5B%5D=386&l%5B%5D=388&l%5B%5D=389&l%5B%5D=390&l%5B%5D=391",
        "https://library.uic.edu/help/article/1873/alumni-services",
        "https://library.uic.edu/help/article/1887/distance-student-services",
        "https://library.uic.edu/help/article/1955/use-accessibility-services",
        "http://researchguides.uic.edu/gov"
    ]
}