{
    "url": "https://cs.uic.edu/news-stories/uic-aims-to-break-through-gender-gap-in-computer-science/",
    "title": "UIC aims to break through gender gap in computer science | Department of Computer Science | University of Illinois at Chicago",
    "text": [
        "The University of Illinois at Chicago will build programs to engage and retain women in its undergraduate computer science program, thanks to a new partnership with Cornell Tech’s Break Through Tech program, a national initiative that propels women into higher education and tech careers and is funded by Pivotal Ventures, a Melinda Gates investment company.",
        "Efforts will include developing educational opportunities for women and other underrepresented groups at UIC and nearby community colleges to learn about computer science. Efforts will also include creating pathways for computer science students to secure paid internship opportunities during freshman or sophomore year.",
        "“We want to see a 12.5% increase in the representation of women graduating from our undergraduate computer science program and we want 100% of those women to have meaningful internships on their resumes when they graduate,” said Robert Sloan, UIC professor and head of computer science.",
        "Sloan says the field of computer science has a diversity problem.",
        "“Computer science is the only one of the STEM fields where the fraction of women graduates has declined over the past few decades,” he said. “Today, women represent less than 20% of computer science graduates nationally, but 35 years ago more than one-third of graduates were women.”",
        "Sloan said women represent 20% of graduates from UIC’s growing undergraduate computer science program, which will spearhead the initiative at UIC. The program is ranked ninth by CSRankings for artificial intelligence and machine learning research among all the nation’s public universities and in the top 25 among all U.S. universities in four other major computer science disciplines: web and information retrieval (7th), economics and computation (12th), logic and verification (17th), and natural language processing (22nd). Over the last 15 years, the UIC computer science department, which is part of the university’s College of Engineering, has grown from 187 undergraduate students to more than 1,400 students.",
        "“This partnership is an opportunity for the UIC College of Engineering to help change the face of computer science and tech in Chicago and nationally,” Sloan said. “Our country and cities need computer science professionals, developers, researchers and educators and, frankly, we all lose if those individuals represent only a narrow segment of the population.”",
        "Sloan said that, contrary to existing stereotypes, teamwork and collaboration are fundamental in computer science. “Diversity in these teams leads to better results,” he said, using the example of improving voice recognition technology to recognize all kinds of voices, not just male voices.",
        "To develop the new educational and internship programs for engaging women and underrepresented groups, the college’s computer science department will receive funding from Break Through Tech. Break Through Tech, which announced its expansion into Chicago today, pioneered a similar program, called WiTNY — for Women in Technology and Entrepreneurship in New York — in New York City with City University of New York.",
        "“We are proud that UIC was selected as the first university for the national expansion of Break Through Tech,” said Peter Nelson, UIC dean of the College of Engineering. “We look forward to working with Cornell Tech and building a successful program here in Chicago. The Cornell Tech grant to support our efforts is one of the largest grants the UIC College of Engineering has ever received.”",
        "Educational opportunities will include new introductory computer science courses and workshops that teach students how to code and emphasize real-world applications of technology.",
        "Unlike many internship programs, the new opportunities for UIC students will be held during the university’s winter break. “Winternships” will provide students with chances to build their resumes with real-world experiences that increase their chances of landing coveted summer tech internships, which are key experiences that tech recruiters look for when evaluating graduates for full-time employment.",
        "“Break Through Tech is thrilled to partner with the computer science department at UIC and build upon their successes of the last several years,” said Judith Spitz, executive director of Break Through Tech. “Our experience in New York has shown us that a deep partnership with a public university that has both scale and diversity, the delivery of a continuity of programming that supports women and other underrepresented groups throughout their college journey and innovative partnerships with the industry players within the city is a formula that delivers transformation results for both the students and the tech ecosystem.”",
        "New introductory courses and workshops will be held beginning in May 2020 and the first cohort of students in the winternship program are expected to start as early as December 2020.",
        "Students seeking more information about the program at UIC can email btt@uic.edu.",
        "This story first appeared on UIC Today"
    ],
    "out_links": [
        "https://cs.uic.edu/",
        "http://uic.edu/",
        "https://cs.uic.edu/undergraduate/",
        "https://cs.uic.edu/undergraduate/admitted-students/",
        "http://engineering.uic.edu/undergraduate-admissions/",
        "https://cs.uic.edu/undergraduate/abet-accreditation/",
        "https://cs.uic.edu/undergraduate/cs-major/",
        "https://cs.uic.edu/undergraduate/cs-minor/",
        "https://cs.uic.edu/undergraduate/undergrad-courses/",
        "https://cs.uic.edu/undergraduate/internships-and-jobs/",
        "https://cs.uic.edu/undergraduate/student-organizations/",
        "https://cs.uic.edu/undergraduate/student-profiles/",
        "https://cs.uic.edu/undergraduate/student-resources/",
        "https://cs.uic.edu/undergraduate/women/",
        "https://cs.uic.edu/graduate/",
        "https://cs.uic.edu/graduate/admitted-students/",
        "https://cs.uic.edu/graduate/admissions/",
        "https://cs.uic.edu/graduate/graduate-courses/",
        "https://cs.uic.edu/graduate/ms-program/",
        "https://cs.uic.edu/graduate/phd/",
        "https://cs.uic.edu/graduate/cs-dissertations/",
        "https://cs.uic.edu/graduate/post-grad-outcomes/",
        "https://cs.uic.edu/graduate/student-profiles/",
        "https://cs.uic.edu/graduate/graduate-student-resources/",
        "https://cs.uic.edu/cs-research/",
        "https://cs.uic.edu/cs-research/research-areas-2/",
        "https://cs.uic.edu/cs-research/labs/",
        "https://cs.uic.edu/cs-research/lectures-seminars/",
        "https://cs.uic.edu/cs-research/reus/",
        "https://cs.uic.edu/faculty-staff/",
        "https://cs.uic.edu/faculty-staff/department-head/",
        "https://cs.uic.edu/faculty-staff/faculty/",
        "https://cs.uic.edu/faculty-staff/emeritus-faculty/",
        "https://cs.uic.edu/faculty-staff/adjunct-faculty/",
        "https://cs.uic.edu/faculty-staff/staff/",
        "https://cs.uic.edu/faculty-staff/faculty-resources/",
        "https://cs.uic.edu/faculty-staff/open-positions/",
        "https://cs.uic.edu/cs-news/",
        "https://cs.uic.edu/cs-news/all-news/",
        "https://cs.uic.edu/cs-news/press-mentions/",
        "https://cs.uic.edu/cs-events/",
        "https://cs.uic.edu/cs-events/calendar/",
        "https://cs.uic.edu/cs-events/student-opportunities/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://today.uic.edu/uic-aims-to-break-through-gender-gap-in-computer-science?utm_campaign=uic-aims-to-break-through-gender-gap-in-computer-science_456&utm_medium=email&utm_source=mailpoet",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}