{
    "url": "https://cs.uic.edu/news-stories/computer-science-professor-barbara-di-eugenio-receives-2019-2020-uic-award-for-excellence-in-teaching/",
    "title": "Computer Science Professor Barbara Di Eugenio receives 2019-2020 UIC Award for Excellence in Teaching | Department of Computer Science | University of Illinois at Chicago",
    "text": [
        "Barbara Di Eugenio, professor and director of graduate studies in Computer Science, has received a UIC Award for Excellence in Teaching for the 2019-2020 academic year.",
        "Winners of the UIC Award for Excellence in Teaching (AET) are faculty members who have taught at UIC for at least 10 years, and are nominated by their department. At most, five AET awards are given university wide each year. Each department’s faculty advisory committee is able to nominate one person for the award each year. The Office of the Provost and Vice Chancellor for Academic Affairs then chooses the AET winners from among the nominations. Di Eugenio, who has been with the computer science department for 20 years, said she received word from Department Head Robert Sloan that she had been nominated.",
        "“I was thrilled to see another computer science faculty member win this very exclusive, prestigious campus teaching award. Several previous computer science winners have been tremendous teachers and innovators in undergraduate education. It was particularly nice to see Prof. Di Eugenio win primarily for her many excellent efforts in graduate education, since both graduate and undergraduate education are vitally important to us,” said Robert Sloan, department head of Computer Science.",
        "Di Eugenio has taught a variety of courses at UIC, most at the graduate level, in artificial intelligence (AI) and natural language processing (NLP).",
        "“I consider it my teaching mission to form professionals that are versed in modeling the problem (computational thinking), in using current tools and methods (programming and machine learning), and in evaluating not only the results, but also the broader societal outcomes of current developments,” Di Eugenio said. “To achieve my mission, through my twenty years at UIC, I have worked on course offerings, on mentoring and advising graduate students, and on outreach, particularly to women students.”",
        "In the early 2000s, well before Alexa and Siri were household names, Di Eugenio created two classes on NLP for the Computer Science curriculum, one offered at the undergraduate level. Di Eugenio said she strives to conduct interactive classes, engaging students by presenting real data, be it a complex Turkish word or a newspaper article, which motivates the algorithms. As AI and NLP are advancing at a prodigious pace, these classes need to be continually updated. Di Eugenio adapts her curriculum to the latest advances, by assigning class projects that even if simple, are representative of the state-of-the-art.",
        "A second passion of Di Eugenio’s is to mentor graduate students, both those that work with her and those she provides general advising for. Di Eugenio has graduated 11 PhD and 31 Master’s students. Of those 42 graduates, 16 are women, far higher than the national average of CS graduate degrees granted to women. Presently, she has eight total graduate students working with her, and also advises some undergraduate students.",
        "“One facet of teaching that I find particularly rewarding is to individually, and collectively, mentor students. I mentor undergraduate students in several ways, from advising my own twenty-plus advisees every semester to mentoring Honors College students,” Di Eugenio said.",
        "One of the courses she teaches is a class she introduced at UIC, and one that is taught every year, Research Methods in Computer Science. The class is a now a requirement for all PhD students in the department.",
        "“The course is an introduction for students to all the things nobody ever tells you, but are requirements to be a good PhD student—how to conduct research, how to find an advisor, how to review papers, how to do a good bibliographical search. We cover ethics and requirements for human subject experiments. I also invite some colleagues to give an overview of the methods they use, to explain how they go about doing research in their areas,” Di Eugenio said.",
        "She said some students are a bit skeptical at the beginning of the course, but said it creates a comradery among students from various labs, and provides them with valuable insights. Di Eugenio said as part of the course, she asks colleagues to provide examples of papers that got rejected on first submissions, and to share the comments they received and how they changed the papers as a result of that feedback.",
        "“I think often one looks at people who are successful and only sees the successes. They don’t see all the work that went into it, and all the failures,” Di Eugenio said.",
        "The awards ceremony honoring the AET recipients will be held October 30.",
        "Learn more about Di Eugenio and her work."
    ],
    "out_links": [
        "https://cs.uic.edu/",
        "http://uic.edu/",
        "https://cs.uic.edu/undergraduate/",
        "https://cs.uic.edu/undergraduate/admitted-students/",
        "http://engineering.uic.edu/undergraduate-admissions/",
        "https://cs.uic.edu/undergraduate/abet-accreditation/",
        "https://cs.uic.edu/undergraduate/cs-major/",
        "https://cs.uic.edu/undergraduate/cs-minor/",
        "https://cs.uic.edu/undergraduate/undergrad-courses/",
        "https://cs.uic.edu/undergraduate/internships-and-jobs/",
        "https://cs.uic.edu/undergraduate/student-organizations/",
        "https://cs.uic.edu/undergraduate/student-profiles/",
        "https://cs.uic.edu/undergraduate/student-resources/",
        "https://cs.uic.edu/undergraduate/women/",
        "https://cs.uic.edu/graduate/",
        "https://cs.uic.edu/graduate/admitted-students/",
        "https://cs.uic.edu/graduate/admissions/",
        "https://cs.uic.edu/graduate/graduate-courses/",
        "https://cs.uic.edu/graduate/ms-program/",
        "https://cs.uic.edu/graduate/phd/",
        "https://cs.uic.edu/graduate/cs-dissertations/",
        "https://cs.uic.edu/graduate/post-grad-outcomes/",
        "https://cs.uic.edu/graduate/student-profiles/",
        "https://cs.uic.edu/graduate/graduate-student-resources/",
        "https://cs.uic.edu/cs-research/",
        "https://cs.uic.edu/cs-research/research-areas-2/",
        "https://cs.uic.edu/cs-research/labs/",
        "https://cs.uic.edu/cs-research/lectures-seminars/",
        "https://cs.uic.edu/cs-research/reus/",
        "https://cs.uic.edu/faculty-staff/",
        "https://cs.uic.edu/faculty-staff/department-head/",
        "https://cs.uic.edu/faculty-staff/faculty/",
        "https://cs.uic.edu/faculty-staff/emeritus-faculty/",
        "https://cs.uic.edu/faculty-staff/adjunct-faculty/",
        "https://cs.uic.edu/faculty-staff/staff/",
        "https://cs.uic.edu/faculty-staff/faculty-resources/",
        "https://cs.uic.edu/faculty-staff/open-positions/",
        "https://cs.uic.edu/cs-news/",
        "https://cs.uic.edu/cs-news/all-news/",
        "https://cs.uic.edu/cs-news/press-mentions/",
        "https://cs.uic.edu/cs-events/",
        "https://cs.uic.edu/cs-events/calendar/",
        "https://cs.uic.edu/cs-events/student-opportunities/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://www.cs.uic.edu/DiEugenio",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}