{
    "url": "https://cs.uic.edu/news-stories/nsf-awards-uic-1-5m-for-new-data-science-institute/",
    "title": "NSF awards UIC $1.5M for new data science institute | Department of Computer Science | University of Illinois at Chicago",
    "text": [
        "December 16, 2019",
        "A multidisciplinary team of University of Illinois at Chicago researchers received a three-year, $1.5 million grant from the National Science Foundation to form a new data science institute.",
        "The UIC Foundations of Data Science Institute is intended to establish a place on campus that will focus on the theory of data science. The institute will concentrate on three themes: the representation and structure of data, machine learning and complexity, and robustness and privacy. These themes will link theory with the application of data science to create new ways to apply data to research. The institute will further develop the data science curriculum at UIC, promote interdisciplinary collaborations on and off-campus, and train the next generation of data scientists.",
        "The institute is part of the NSF Harnessing the Data Revolution (HDR) Big Idea initiative, and it will be jointly led by UIC faculty researchers from the College of Engineering and the College of Liberal Arts and Science.",
        "The researchers say data science takes a different approach to answering “how” and “why” questions across fields and results, so far, have been revolutionary.",
        "Science has always been data-driven, but the scale and resolution of questions are changing, according to Lev Reyzin, co-principal investigator and UIC associate professor of mathematics, statistics, and computer science at the College of Liberal Arts and Sciences. “Data science enables decision-making in a very different way. We take advantage of vast data sets to form new methods and develop realistic models that answer scientific questions.”",
        "“While traditional scientific models, which are explanatory or analytical models, help us understand various phenomena, many of these models do not survive contact with large data,” said Tanya Berger-Wolf, co-principal investigator and UIC professor of computer science at the College of Engineering. “Data science allows the study of phenomena through the lens of data — it helps form new models and decide what computational or mathematical approaches are appropriate in the context of that phenomenon to find an answer.”",
        "The researchers say that UIC’s location in Chicago is an advantage.",
        "“I think one of the reasons we received this award is because we have a strong collaborative infrastructure,” Reyzin said. “Internally, each department has very strong groups studying the foundational and theoretical areas of data science that come together. We also have collaborated with many schools across the Chicagoland area and with local government. We want to leverage resources with academic, government and industry partners and to foster new collaborations.”",
        "The new institute also will focus on training the next generation of data scientists. Berger-Wolf said that data science is an interdisciplinary field that attracts more underrepresented groups and women than other associated fields, such as math, computer science and electrical engineering.",
        "“As a public and urban institution, UIC provides the opportunity to train diverse student bodies and perform innovative research,” Berger-Wolf said. “Using training programs supported by each one of the participating departments, we hope this institute will be an opportunity for more underrepresented groups to study data science.”",
        "Co-principal investigators also include Natasha Devroye, associate professor of electrical and computer engineering, and Anastasios Sidiropoulos, associate professor of computer science, at the College of Engineering; and Will Perkins, assistant professor of mathematics, statistics and computer science at the College of Liberal Arts and Sciences.",
        "Other investigators at the UIC Foundations of Data Science Institute include Gonzalo Bello Lander, Isabel Cruz, Bhaskar DasGupta, Ian Kash, Bing Liu, Xinhua Zhang, Elena Zheleva and Brian Ziebart from the department of computer science at the College of Engineering; Shuo Han, Daniela Tuninetti and Milos Zefran from the department of electrical and computer engineering at the College of Engineering; and Yichao Wu and Ping-Shou Zhong from the department of mathematics, statistics and computer science at the College of Liberal Arts and Sciences.",
        "This story first appeared on UIC Today"
    ],
    "out_links": [
        "https://cs.uic.edu/",
        "http://uic.edu/",
        "https://cs.uic.edu/undergraduate/",
        "https://cs.uic.edu/undergraduate/admitted-students/",
        "http://engineering.uic.edu/undergraduate-admissions/",
        "https://cs.uic.edu/undergraduate/abet-accreditation/",
        "https://cs.uic.edu/undergraduate/cs-major/",
        "https://cs.uic.edu/undergraduate/cs-minor/",
        "https://cs.uic.edu/undergraduate/undergrad-courses/",
        "https://cs.uic.edu/undergraduate/internships-and-jobs/",
        "https://cs.uic.edu/undergraduate/student-organizations/",
        "https://cs.uic.edu/undergraduate/student-profiles/",
        "https://cs.uic.edu/undergraduate/student-resources/",
        "https://cs.uic.edu/undergraduate/women/",
        "https://cs.uic.edu/graduate/",
        "https://cs.uic.edu/graduate/admitted-students/",
        "https://cs.uic.edu/graduate/admissions/",
        "https://cs.uic.edu/graduate/graduate-courses/",
        "https://cs.uic.edu/graduate/ms-program/",
        "https://cs.uic.edu/graduate/phd/",
        "https://cs.uic.edu/graduate/cs-dissertations/",
        "https://cs.uic.edu/graduate/post-grad-outcomes/",
        "https://cs.uic.edu/graduate/student-profiles/",
        "https://cs.uic.edu/graduate/graduate-student-resources/",
        "https://cs.uic.edu/cs-research/",
        "https://cs.uic.edu/cs-research/research-areas-2/",
        "https://cs.uic.edu/cs-research/labs/",
        "https://cs.uic.edu/cs-research/lectures-seminars/",
        "https://cs.uic.edu/cs-research/reus/",
        "https://cs.uic.edu/faculty-staff/",
        "https://cs.uic.edu/faculty-staff/department-head/",
        "https://cs.uic.edu/faculty-staff/faculty/",
        "https://cs.uic.edu/faculty-staff/emeritus-faculty/",
        "https://cs.uic.edu/faculty-staff/adjunct-faculty/",
        "https://cs.uic.edu/faculty-staff/staff/",
        "https://cs.uic.edu/faculty-staff/faculty-resources/",
        "https://cs.uic.edu/faculty-staff/open-positions/",
        "https://cs.uic.edu/cs-news/",
        "https://cs.uic.edu/cs-news/all-news/",
        "https://cs.uic.edu/cs-news/press-mentions/",
        "https://cs.uic.edu/cs-events/",
        "https://cs.uic.edu/cs-events/calendar/",
        "https://cs.uic.edu/cs-events/student-opportunities/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://today.uic.edu/nsf-awards-uic-1-5m-for-new-data-science-institute",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}