{
    "url": "https://cs.uic.edu/news-stories/andres-tapia-receives-scholarships-to-attend-tapia-conference-great-minds-in-stem-conference/",
    "title": "Andres Tapia receives scholarships to attend Tapia Conference, Great Minds in STEM Conference | Department of Computer Science | University of Illinois at Chicago",
    "text": [
        "UIC sophomore Andres Tapia received a scholarship from the Richard Tapia Foundation to attend the 2019 Tapia Conference, a conference that celebrates the diversity in computing. Tapia, no relation to the conference’s namesake, Richard A. Tapia, is thrilled to join roughly 1,400 attendees from more than 250 schools at the event, which will be held September 18 through 21 in San Diego. The Tapia Conference is designed to connect students with others with common backgrounds, including ethnicities, disabilities, and gender to create communities that extend beyond the conference.",
        "“I am very excited to attend the conference, and humbled to have been selected to receive a scholarship,” Tapia said. “This is the first time I will attend this conference, and judging by the keynote speakers and other sessions, I will be exposed to many areas within the computer science field.”",
        "Tapia heard about the scholarship in a Computer Science Department email in the spring, and also from Professor and Department Head Robert Sloan, who was his Program Design I instructor. The application consisted of an essay, resume, reference letters, demographic information, and academic transcripts. The scholarship includes the cost of registration, hotel accommodations, and $500 toward travel expenses.",
        "“As a Hispanic student and a person with disabilities, in a field where we do not have large representation, conferences like the Richard Tapia provide a platform for us to appreciate the accomplishments of many students and faculty like me, who can serve as role models and mentors. This conference can provide a network and inspire me to broaden my ideas of what I can do with a degree in Computer Science,” Tapia said in his application.",
        "UIC will also fund the cost of other students who are attending the Tapia conference, through money received through the BRAID program. The BRAID program, which stands for Building, Recruiting, And Inclusion for Diversity, involves 15 universities working to address specific issues. These include modifying computer science courses to make them less intimidating and more appealing to underrepresented students, leading outreach efforts for high school students and teachers to build a diverse pipeline of students, build confidence and community among underrepresented students, and promoting joint majors in areas like computer science and biology. UIC has participated in the program since its inception in 2014.",
        "The first week of the fall semester, Tapia was notified that he received another scholarship, from the Great Minds in STEM organization, to attend their conference September 26 through 28 in Orlando, Florida. Tapia’s scholarship was funded by Oracle Academy. Great Minds in STEM’s mission is to “Be a national leader in keeping America technologically strong by promoting Science, Technology, Engineering and Math careers especially in underserved communities.”",
        "“My main intention was to start networking for potential internships and jobs after graduation,” Tapia explained.",
        "“Andres is exactly the kind of student who makes me really happy and proud to be a UIC Computer Science professor,” Sloan said. “I was delighted to hear that he had won these two awards.”"
    ],
    "out_links": [
        "https://cs.uic.edu/",
        "http://uic.edu/",
        "https://cs.uic.edu/undergraduate/",
        "https://cs.uic.edu/undergraduate/admitted-students/",
        "http://engineering.uic.edu/undergraduate-admissions/",
        "https://cs.uic.edu/undergraduate/abet-accreditation/",
        "https://cs.uic.edu/undergraduate/cs-major/",
        "https://cs.uic.edu/undergraduate/cs-minor/",
        "https://cs.uic.edu/undergraduate/undergrad-courses/",
        "https://cs.uic.edu/undergraduate/internships-and-jobs/",
        "https://cs.uic.edu/undergraduate/student-organizations/",
        "https://cs.uic.edu/undergraduate/student-profiles/",
        "https://cs.uic.edu/undergraduate/student-resources/",
        "https://cs.uic.edu/undergraduate/women/",
        "https://cs.uic.edu/graduate/",
        "https://cs.uic.edu/graduate/admitted-students/",
        "https://cs.uic.edu/graduate/admissions/",
        "https://cs.uic.edu/graduate/graduate-courses/",
        "https://cs.uic.edu/graduate/ms-program/",
        "https://cs.uic.edu/graduate/phd/",
        "https://cs.uic.edu/graduate/cs-dissertations/",
        "https://cs.uic.edu/graduate/post-grad-outcomes/",
        "https://cs.uic.edu/graduate/student-profiles/",
        "https://cs.uic.edu/graduate/graduate-student-resources/",
        "https://cs.uic.edu/cs-research/",
        "https://cs.uic.edu/cs-research/research-areas-2/",
        "https://cs.uic.edu/cs-research/labs/",
        "https://cs.uic.edu/cs-research/lectures-seminars/",
        "https://cs.uic.edu/cs-research/reus/",
        "https://cs.uic.edu/faculty-staff/",
        "https://cs.uic.edu/faculty-staff/department-head/",
        "https://cs.uic.edu/faculty-staff/faculty/",
        "https://cs.uic.edu/faculty-staff/emeritus-faculty/",
        "https://cs.uic.edu/faculty-staff/adjunct-faculty/",
        "https://cs.uic.edu/faculty-staff/staff/",
        "https://cs.uic.edu/faculty-staff/faculty-resources/",
        "https://cs.uic.edu/faculty-staff/open-positions/",
        "https://cs.uic.edu/cs-news/",
        "https://cs.uic.edu/cs-news/all-news/",
        "https://cs.uic.edu/cs-news/press-mentions/",
        "https://cs.uic.edu/cs-events/",
        "https://cs.uic.edu/cs-events/calendar/",
        "https://cs.uic.edu/cs-events/student-opportunities/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}