{
    "url": "https://cs.uic.edu/news-stories/computer-science-distinguished-professor-bing-liu-works-to-improve-sentiment-analysis-with-lifelong-machine-learning/",
    "title": "Computer Science Distinguished Professor Bing Liu works to improve sentiment analysis with lifelong machine learning | Department of Computer Science | University of Illinois at Chicago",
    "text": [
        "What if researchers could create algorithms to help a computer learn over time from what it processes? Using a new machine learning paradigm, UIC Distinguished Professor Bing Liu is developing algorithms that can transfer past knowledge to a current task in order to improve the performance of sentiment analysis, a tool that extracts and classifies people’s opinions, emotions, and sentiments expressed on social media and elsewhere online.",
        "The idea of tracking and analyzing what people say about your product, or how they view a particular company or service has been around for a long time. With the advent of natural language processing and the use of more sophisticated sentiment tracking tools, the mining of this type of data has exploded in recent years. Still, accuracy remains low.",
        "“Natural language is just incredibly hard for computers to understand. Put very bluntly, now a computer does not ‘understand’ anything we say; the only thing it does is statistical analysis, and word association, Liu said. “Humans have patterns when we say something, so we’re trying to catch those types of patterns.”",
        "Sentiment analysis is key to helping individuals and businesses improve their decision-making process: a business can quickly analyze how a consumer feels about its product, or a consumer can ferret out what product to buy, based on the opinions of other consumers, without slogging through pages of reviews, or relying on outdated information.",
        "A pioneer in the field of sentiment analysis, Liu’s past work uncovered the prevalence of four- and five- star reviews on commerce platforms such as Amazon, sounding the alarm that many of these reviews are fake.",
        "Liu’s current work investigates lifelong learning algorithms that help the computer “learn” over time from what it processes. His model imitates human learning, and transfers accumulated knowledge to help with a current task. The resulting algorithms will be incorporated into a holistic model to improve accuracy of sentiment analysis.",
        "“In traditional learning you get a bunch of data, run an algorithm on that data to produce a model, and then apply the model to perform sentiment analysis,” Liu said. “With lifelong learning, we read the data continuously, it’s not just fixed data.”",
        "Improvements to sentiment analysis will provide an ever-growing level of uses for the tool. Currently, some companies are employing the technology to reduce employee turnover and improve engagement and productivity by interpreting feedback to uncover factors that drive down morale. Sentiment analysis may also be used to forecast market movement based on news and social media sentiment, and as accuracy improves, in text analysis.",
        "“Everyone is interested in opinions. But there are also a lot of other potential applications,” Liu said.",
        "Liu’s research interests include lifelong machine learning, data mining, sentiment analysis, and opinion mining. He received a grant from the National Science Foundation worth just under $500,000, “III: Small: A Holistic Approach to Sentiment Analysis.” The grant runs from August 2019 to September 2022 and will fund two PhD students.",
        "Liu has published several books on lifelong machine learning and sentiment analysis. To learn more, visit his website."
    ],
    "out_links": [
        "https://cs.uic.edu/",
        "http://uic.edu/",
        "https://cs.uic.edu/undergraduate/",
        "https://cs.uic.edu/undergraduate/admitted-students/",
        "http://engineering.uic.edu/undergraduate-admissions/",
        "https://cs.uic.edu/undergraduate/abet-accreditation/",
        "https://cs.uic.edu/undergraduate/cs-major/",
        "https://cs.uic.edu/undergraduate/cs-minor/",
        "https://cs.uic.edu/undergraduate/undergrad-courses/",
        "https://cs.uic.edu/undergraduate/internships-and-jobs/",
        "https://cs.uic.edu/undergraduate/student-organizations/",
        "https://cs.uic.edu/undergraduate/student-profiles/",
        "https://cs.uic.edu/undergraduate/student-resources/",
        "https://cs.uic.edu/undergraduate/women/",
        "https://cs.uic.edu/graduate/",
        "https://cs.uic.edu/graduate/admitted-students/",
        "https://cs.uic.edu/graduate/admissions/",
        "https://cs.uic.edu/graduate/graduate-courses/",
        "https://cs.uic.edu/graduate/ms-program/",
        "https://cs.uic.edu/graduate/phd/",
        "https://cs.uic.edu/graduate/cs-dissertations/",
        "https://cs.uic.edu/graduate/post-grad-outcomes/",
        "https://cs.uic.edu/graduate/student-profiles/",
        "https://cs.uic.edu/graduate/graduate-student-resources/",
        "https://cs.uic.edu/cs-research/",
        "https://cs.uic.edu/cs-research/research-areas-2/",
        "https://cs.uic.edu/cs-research/labs/",
        "https://cs.uic.edu/cs-research/lectures-seminars/",
        "https://cs.uic.edu/cs-research/reus/",
        "https://cs.uic.edu/faculty-staff/",
        "https://cs.uic.edu/faculty-staff/department-head/",
        "https://cs.uic.edu/faculty-staff/faculty/",
        "https://cs.uic.edu/faculty-staff/emeritus-faculty/",
        "https://cs.uic.edu/faculty-staff/adjunct-faculty/",
        "https://cs.uic.edu/faculty-staff/staff/",
        "https://cs.uic.edu/faculty-staff/faculty-resources/",
        "https://cs.uic.edu/faculty-staff/open-positions/",
        "https://cs.uic.edu/cs-news/",
        "https://cs.uic.edu/cs-news/all-news/",
        "https://cs.uic.edu/cs-news/press-mentions/",
        "https://cs.uic.edu/cs-events/",
        "https://cs.uic.edu/cs-events/calendar/",
        "https://cs.uic.edu/cs-events/student-opportunities/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://www.cs.uic.edu/~liub/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}