{
    "url": "https://cs.uic.edu/news-stories/uic-computer-science-faculty-become-temporary-googlers-to-help-students-learn-needed-tech-industry-skills/",
    "title": "UIC Computer Science faculty become temporary ‘Googlers’  to help students learn needed tech industry skills | Department of Computer Science | University of Illinois at Chicago",
    "text": [
        "Two faculty members from the University of Illinois at Chicago’s Computer Science Department spent a month at Google’s Mountain View headquarters, part of the technology company’s Faculty in Residence program. Clinical Assistant Professors Gonzalo Bello and Shanon Reckinger participated in hands-on, project-based learning workshops, discussed industry expectations, learned more about the technical interviewing process at Google, and immersed themselves in Google’s engineering culture.",
        "“I can only say positive things about the experience,” said Reckinger. “I could really see what it is like to work at Google.”",
        "Reckinger and Bello were part of the third cohort of the Faculty in Residence program, which included 21 computer science faculty from 19 institutions that serve underrepresented students. The program provides faculty with the opportunity to learn from Google and collaborate with one another, and create learning materials that can be incorporated into their classrooms. Google, in turn, says the program provides valuable insights into advancing their commitment to diversity and inclusion for its employees and users.",
        "“Google is reaching out to universities like UIC that it hasn’t traditionally recruited from. They are trying to get their workforce in tech, the engineers, to be representative of the people they serve,” said Reckinger.",
        "The Faculty in Residence cohort went through the company’s interview process, and gained a clear understanding of the skills Google wants their prospective employees to possess.",
        "“Learning about Google’s hiring practices, and even going through a technical interview myself, will allow me to better guide and advise students through their job search,” said Bello.",
        "Bello is working on a syllabus for a class he teaches that will be more projects-based, incorporating hands-on activities, and discussions about practical applications to help students develop the professional skills needed to succeed in the workplace. Some of these skills include using version control systems such as GitHub; and application programming interfaces (APIs) for building software applications.",
        "“Sometimes we take for granted that students are learning these things on their own, but it’s helpful to have that as an actual objective in our classrooms,” Bello said.",
        "All of Google’s Faculty in Residence program participants came with their own goal to work on, and for Reckinger it was retooling projects for the CS 251 course, Data Structures.",
        "Google shared what they called their workflow, based on how their engineers work on problems, where every piece of code is reviewed by multiple people, and each engineer has to review each other’s codes. Reckinger says she hopes to mimic this approach, adapting it for the realities of the classroom.",
        "Both Reckinger and Bello appreciated the attention paid to the hiring process. At tech companies, this often includes an online candidate prescreen, a phone screen, problem solving over the phone, then multiples of these phone technical interviews before in-person interviews take place. At in-person interviews, candidates must solve coding challenges at a white board, while explaining their approach as they go along. Preparation is key.",
        "“A big goal of the program is to understand the process and give students resources they didn’t have to prepare for them. We spent the whole month brainstorming how we can do some of this in the classroom,” Reckinger said.",
        "Bello and Reckinger intend to work with the Engineering Career Center on sharing what they’ve learned, and they will be at events when Google is on campus. They hope to conduct interview sessions for students. Reckinger will also be working with UIC’s Women in Computer Science group on technical interview training.",
        "Applications for roles at Google are accepted on a rolling basis, so Bello advises students interested in internships or jobs to act as soon as possible—even if the deadline is distant, the earlier you apply, the better. He said applications open in September.",
        "“I think that one of the biggest takeaways is that anybody can work at Google if they prepare for that job interview. In the past when I spoke with some of my students their feeling was that maybe they were not going to be considered by Google,” said Bello. “That it is certainly not true.”"
    ],
    "out_links": [
        "https://cs.uic.edu/",
        "http://uic.edu/",
        "https://cs.uic.edu/undergraduate/",
        "https://cs.uic.edu/undergraduate/admitted-students/",
        "http://engineering.uic.edu/undergraduate-admissions/",
        "https://cs.uic.edu/undergraduate/abet-accreditation/",
        "https://cs.uic.edu/undergraduate/cs-major/",
        "https://cs.uic.edu/undergraduate/cs-minor/",
        "https://cs.uic.edu/undergraduate/undergrad-courses/",
        "https://cs.uic.edu/undergraduate/internships-and-jobs/",
        "https://cs.uic.edu/undergraduate/student-organizations/",
        "https://cs.uic.edu/undergraduate/student-profiles/",
        "https://cs.uic.edu/undergraduate/student-resources/",
        "https://cs.uic.edu/undergraduate/women/",
        "https://cs.uic.edu/graduate/",
        "https://cs.uic.edu/graduate/admitted-students/",
        "https://cs.uic.edu/graduate/admissions/",
        "https://cs.uic.edu/graduate/graduate-courses/",
        "https://cs.uic.edu/graduate/ms-program/",
        "https://cs.uic.edu/graduate/phd/",
        "https://cs.uic.edu/graduate/cs-dissertations/",
        "https://cs.uic.edu/graduate/post-grad-outcomes/",
        "https://cs.uic.edu/graduate/student-profiles/",
        "https://cs.uic.edu/graduate/graduate-student-resources/",
        "https://cs.uic.edu/cs-research/",
        "https://cs.uic.edu/cs-research/research-areas-2/",
        "https://cs.uic.edu/cs-research/labs/",
        "https://cs.uic.edu/cs-research/lectures-seminars/",
        "https://cs.uic.edu/cs-research/reus/",
        "https://cs.uic.edu/faculty-staff/",
        "https://cs.uic.edu/faculty-staff/department-head/",
        "https://cs.uic.edu/faculty-staff/faculty/",
        "https://cs.uic.edu/faculty-staff/emeritus-faculty/",
        "https://cs.uic.edu/faculty-staff/adjunct-faculty/",
        "https://cs.uic.edu/faculty-staff/staff/",
        "https://cs.uic.edu/faculty-staff/faculty-resources/",
        "https://cs.uic.edu/faculty-staff/open-positions/",
        "https://cs.uic.edu/cs-news/",
        "https://cs.uic.edu/cs-news/all-news/",
        "https://cs.uic.edu/cs-news/press-mentions/",
        "https://cs.uic.edu/cs-events/",
        "https://cs.uic.edu/cs-events/calendar/",
        "https://cs.uic.edu/cs-events/student-opportunities/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://ecc.uic.edu/",
        "https://wics.students.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}