{
    "url": "https://cs.uic.edu/news-stories/professor-venkatakrishnan-secures-new-3-million-computer-security-grant-from-darpa/",
    "title": "UIC to lead $3M initiative to develop system to identify, patch software security holes | Department of Computer Science | University of Illinois at Chicago",
    "text": [
        "The University of Illinois at Chicago will lead a $3 million project funded by the Defense Advanced Research Projects Agency to design, develop and evaluate a system that will identify security vulnerabilities in web software. UIC will receive $1.4 million of the funding, and the rest will support co-investigators at the University of Texas at Dallas and The Johns Hopkins University. The system will spot security weaknesses in the millions – sometimes billions – of lines of code that run websites including banking and online shopping which are attractive to hackers.",
        "Once identified by the system, called GAMEPLAY (for Graph Analysis for Mechanized Exploit-generation and vulnerability Patching Leveraging human Assistance for improved Yield), the vulnerabilities will be automatically probed to determine whether they really could be leveraged by hackers. GAMEPLAY will then generate patches for these vulnerabilities, known as “exploits” to computer scientists.",
        "“GAMEPLAY addresses a pressing need in both government and industry for more rapid vulnerability identification and patching response strategies that can scale with the increasing speed and scope of modern cyber-warfare campaigns that target networked software,” said Venkat Venkatakrishnan, professor of computer science in the UIC College of Engineering and principal investigator on the grant.",
        "“GAMEPLAY is intended to be used by cybersecurity analysts, software developers and other professionals interested in identifying ‘exploits’ in software. It will run, for the most part, on its own but when an issue arises where a decision needs to be made, then a human will provide input to guide the system.”",
        "Venkatakrishnan says that systems to scan and analyze code exist, but they can be expensive and may not provide total assurance because code is exceedingly complex and scanning it thoroughly presents a huge computational problem. GAMEPLAY will get around these issues by allowing for human input as the system runs.",
        "“We want to create a system that allows software developers and security experts to be proactive by building a tool that will let them scan for potential problems in code that could provide an opening for hackers before the hackers have a chance to find the weaknesses themselves,” Venkatakrishnan said.",
        "The system will be designed to be able to evaluate software written in several computer languages, including C, Python and JavaScript.",
        "“GAMEPLAY will be built on a language-agnostic platform extensible to multiple computer languages,” Venkatakrishnan said.",
        "The UIC team will be joined by computer scientists from Johns Hopkins and the University of Texas at Dallas to develop GAMEPLAY for these different computer languages.",
        "The project will also include students at the graduate and undergraduate level who will have a chance to take part in constructing GAMEPLAY while learning about state-of-the-art digital security tools.",
        "“The GAMEPLAY project will be rolled into several student classes on code analysis and vulnerability identification,” said Rigel Gjomemo, research assistant professor of computer science and associate director of UIC’s Electronic Security and Privacy: Technological, Human, Enterprise and Legal Considerations program. “Students may also participate in hacking competitions using what they’ve learned in these classes, giving them experience that they can bring to their future employers in the cybersecurity field.”"
    ],
    "out_links": [
        "https://cs.uic.edu/",
        "http://uic.edu/",
        "https://cs.uic.edu/undergraduate/",
        "https://cs.uic.edu/undergraduate/admitted-students/",
        "http://engineering.uic.edu/undergraduate-admissions/",
        "https://cs.uic.edu/undergraduate/abet-accreditation/",
        "https://cs.uic.edu/undergraduate/cs-major/",
        "https://cs.uic.edu/undergraduate/cs-minor/",
        "https://cs.uic.edu/undergraduate/undergrad-courses/",
        "https://cs.uic.edu/undergraduate/internships-and-jobs/",
        "https://cs.uic.edu/undergraduate/student-organizations/",
        "https://cs.uic.edu/undergraduate/student-profiles/",
        "https://cs.uic.edu/undergraduate/student-resources/",
        "https://cs.uic.edu/undergraduate/women/",
        "https://cs.uic.edu/graduate/",
        "https://cs.uic.edu/graduate/admitted-students/",
        "https://cs.uic.edu/graduate/admissions/",
        "https://cs.uic.edu/graduate/graduate-courses/",
        "https://cs.uic.edu/graduate/ms-program/",
        "https://cs.uic.edu/graduate/phd/",
        "https://cs.uic.edu/graduate/cs-dissertations/",
        "https://cs.uic.edu/graduate/post-grad-outcomes/",
        "https://cs.uic.edu/graduate/student-profiles/",
        "https://cs.uic.edu/graduate/graduate-student-resources/",
        "https://cs.uic.edu/cs-research/",
        "https://cs.uic.edu/cs-research/research-areas-2/",
        "https://cs.uic.edu/cs-research/labs/",
        "https://cs.uic.edu/cs-research/lectures-seminars/",
        "https://cs.uic.edu/cs-research/reus/",
        "https://cs.uic.edu/faculty-staff/",
        "https://cs.uic.edu/faculty-staff/department-head/",
        "https://cs.uic.edu/faculty-staff/faculty/",
        "https://cs.uic.edu/faculty-staff/emeritus-faculty/",
        "https://cs.uic.edu/faculty-staff/adjunct-faculty/",
        "https://cs.uic.edu/faculty-staff/staff/",
        "https://cs.uic.edu/faculty-staff/faculty-resources/",
        "https://cs.uic.edu/faculty-staff/open-positions/",
        "https://cs.uic.edu/cs-news/",
        "https://cs.uic.edu/cs-news/all-news/",
        "https://cs.uic.edu/cs-news/press-mentions/",
        "https://cs.uic.edu/cs-events/",
        "https://cs.uic.edu/cs-events/calendar/",
        "https://cs.uic.edu/cs-events/student-opportunities/",
        "https://engineering.uic.edu/support/",
        "http://engineeringalumni.uic.edu/",
        "http://engineering.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}