{
    "url": "https://uihealth.uic.edu/research-2/",
    "title": "Research & Clinical Trials | UI Health | University of Illinois at Chicago",
    "text": [
        "A Public Research Institution for Public Benefit",
        "UIC is proud to be one of four institutions, along with Northwestern, the University of Chicago and our sister institution, the University of Illinois Urbana-Champaign, to have the highest classification for research by the Carnegie Foundation - also known as a Carnegie Foundation Research 1 University. UIC is the ONLY PUBLIC Research 1 institution in Chicago.",
        "Of UIC's $327.6M total research awards in FY17, UI Health research funding was $241.6M - approximately 74%",
        "Research awards broken down by health sciences colleges:",
        "Medicine = $160M ~ 50% UIC Total",
        "Public Health = $38.1M",
        "Pharmacy = $13.3M",
        "Applied Health Sciences =$13.4M",
        "Nursing = $7M",
        "Dentistry = $4.4M",
        "Social Work = $5.4M",
        "(Source: UIC Office of the Vice Chancellor for Research, FY17 Facts & Figures)",
        "As defined by the National Institutes of Health (NIH), Clinical Trials are a type of clinical study in which participants are assigned to groups that receive one or more intervention/treatment (or no intervention) so that researchers can evaluate the effects of the interventions on biomedical or health-related outcomes. The assignments are determined by the study’s protocol. Participants may receive diagnostic, therapeutic, or other types of interventions.",
        "Clinical Trials at UI Health are conducted across the health sciences colleges. More information about some clinical trails is listed below. Please contact the individual departments or colleges for more specific questions about participating in clinical trails research.",
        "The most successful cancer treatments today are based on what we have learned from clinical trials. As a result, people with cancer are living longer, with a better quality of life. Participating in clinical trials at the University of Illinois Cancer Center may not only benefit you, but it could also help future patients through the development of newer, safer treatments.",
        "Click here for a listing of UI Cancer Center clinical studies currently enrolling participants.  Click on the dropdown menu to filter the list by the site of your disease.  If you are interested in participating in a trial listed, please email cancertrials@uic.edu or call 312-355-5112.",
        "As defined by the National Institutes of Health (NIH), clinical research studies (or observational studies) are a type of clinical study in which participants are identified as belonging to study groups and are assessed for biomedical or health outcomes. Participants may receive diagnostic, therapeutic, or other types of interventions, but the investigator does not assign participants to a specific interventions/treatment. A patient registry is a type of observational study.",
        "Various Research Studies at UI Health are conducted across the health sciences colleges. More information about some of these studies are listed below. Please contact the individual departments or colleges for more specific questions about participating in research studies.",
        "The UIC Center for Clinical and Translational Science (CCTS) is a central resource on campus to provide support and services to clinical investigators and patients interested in participating in studies. More information about the CCTS can be found online here."
    ],
    "out_links": [
        "https://uihealth.uic.edu/",
        "http://uihealth.uic.edu/",
        "https://uihealth.uic.edu/about-us/",
        "https://uihealth.uic.edu/health-sciences/",
        "https://uihealth.uic.edu/healthcare/",
        "https://uihealth.uic.edu/community/",
        "https://give.uic.edu/",
        "http://uic.edu/",
        "http://maps.uic.edu/",
        "http://www.ccts.uic.edu/content/getting-involved-health-research-uic",
        "http://ahs.uic.edu/",
        "https://dentistry.uic.edu/",
        "https://medicine.uic.edu/",
        "https://nursing.uic.edu/",
        "https://pharmacy.uic.edu/",
        "http://publichealth.uic.edu/",
        "https://socialwork.uic.edu/",
        "https://uihealth.uic.edu/health-sciences/sample-page/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}