{
    "url": "https://uihealth.uic.edu/healthcare/",
    "title": "Healthcare | UI Health | University of Illinois at Chicago",
    "text": [
        "Providing Comprehensive Patient Care for Illinois & Beyond",
        "In addition to the seven UIC health sciences colleges, UI Health is comprised of a robust healthcare delivery enterprise that serves individuals and families in Illinois and across the globe. UI Health provides diverse clinical services through primary and specialty care at the University of Illinois Hospital & Clinics, the Mile Square Health Center network and many other health sciences college faculty practice clinics.",
        "The University of Illinois Hospital & Clinics",
        "The University of Illinois Hospital & Clinics is the State of Illinois' only public general hospital, consisting of a 465-bed hospital; the Children's Hospital University of Illinois (CHUI) - which includes a 101-bed specialty pediatric hospital with a 55-bed NICU; and an Outpatient Care Center that houses 21 primary and specialty care clinics. With nearly 140,000 unique patients and 500,000 annual clinic visits (in FY18) the University of Illinois Hospital & Clinics is committed to the pursuit of health equity ensuring that safe, high-quality, and cost-effective care for our patients is our foremost responsibility.",
        "The Mile Square Health Center (MSHC) Network",
        "Established in 1967, The Mile Square Health Center network is among the first Federally Qualified Health Centers in the nation. Employing a community-based practice model, MSHC operates 11 locations - 6 primary locations and 5 school-based health and wellness centers - across the Chicagoland region.",
        "Faculty Practice Clinics",
        "The academic experts in the 7 UIC Health Sciences Colleges bring leading-edge research and innovation into their clinics. With numerous clinics in the medical district and across the state, UI Health faculty offer services through the UIC College of Dentistry, the UIC College of Applied Health Sciences, and more."
    ],
    "out_links": [
        "https://uihealth.uic.edu/",
        "http://uihealth.uic.edu/",
        "https://uihealth.uic.edu/about-us/",
        "https://uihealth.uic.edu/health-sciences/",
        "https://uihealth.uic.edu/research-2/",
        "https://uihealth.uic.edu/community/",
        "https://give.uic.edu/",
        "http://uic.edu/",
        "http://maps.uic.edu/",
        "https://dentistry.uic.edu/patients",
        "http://ahs.uic.edu/physical-therapy-faculty-practice/",
        "http://ahs.uic.edu/",
        "https://dentistry.uic.edu/",
        "https://medicine.uic.edu/",
        "https://nursing.uic.edu/",
        "https://pharmacy.uic.edu/",
        "http://publichealth.uic.edu/",
        "https://socialwork.uic.edu/",
        "https://uihealth.uic.edu/health-sciences/sample-page/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}