{
    "url": "https://today.uic.edu/south-shore-clinic-expands-covid-19-testing",
    "title": "South Shore clinic expands COVID-19 testing | UIC Today",
    "text": [
        "Previously, only established or new Mile Square patients with symptoms were able to get a test. Now, any person in the community who meets testing criteria, such as having symptoms of fever, cough, shortness of breath and diarrhea, can make an appointment to get tested. Test results will be available in one to two days.",
        "“We are proud to respond to the needs of the South Shore community and to play an active role in addressing COVID-19 disparities,” said Dr. Ian Jasenof, chief medical officer of UI Health Mile Square Health Center.",
        "“Mile Square has a long history of bringing health care to communities regardless of individuals’ income, insurance status or ability to pay for care — expanding our COVID-19 testing capacity on Chicago’s South Side is an extension of our promise to put the health and well-being of all communities at the center of all we do,” said Henry Taylor, executive director of the UI Health Mile Square network.",
        "The South Shore clinic began testing a limited number of patients today but will test patients by appointment, 10 a.m to 3 p.m., Monday through Friday, starting tomorrow. The clinic is prepared to provide up to 30 tests a day.",
        "As part of its expanded testing program, Mile Square has formalized a home monitoring program for individuals who test positive.",
        "“Follow up and monitoring COVID-19 progression is just",
        "as important as testing,” Jasenof said. “We still do not know why some",
        "people with COVID-19 have mild illness while others have severe and",
        "life-threatening illness. This monitoring process was developed to make sure",
        "that if people do become severely ill, they have resources in place to get help",
        "quickly.”",
        "The South Shore clinic occupies space owned and operated by the Chicago Child Care Society, in Chicago’s 5th Ward.",
        "“I welcome Mile Square’s capacity to start testing in Shore Shore, which is one of the communities hardest hit by the pandemic. While 30 tests per day are a good first start, I hope the staff will have the resources to increase the number of daily tests,” said 5th Ward Ald. Leslie Hairston. “We know the key to flattening the curve is treatment, testing and tracking.”",
        "Dara Munson, CEO of the Chicago Child Care Society, said, “Chicago Child Care Society has a long-standing commitment to the South Shore neighborhood and is a proud partner with UI Mile Square Health Center. We are saddened but not surprised by the disparities that COVID-19 is illuminating. CCCS is committed to doing our part to serve this and all communities during this pandemic and beyond.”",
        "The South Shore clinic is the third official testing site in the University of Illinois Hospital and Health Sciences System. The UI Health Mile Square drive-up testing center, located at 1220 S. Wood St., tested its first patient on March 25, and the Pilsen COVID-19 evaluation clinic, located at 1713 S. Ashland Ave., began evaluating and testing patients on March 30.",
        "Combined, these three UI Health testing centers can process around",
        "150 tests each day.",
        "At this time, all testing centers are by appointment only and only for patients who meet testing criteria.",
        "Patients should call 866-600-2273 to speak with a nurse to make an appointment or visit hospital.uillinois.edu for more information.",
        "Mile Square plans to expand its COVID-19 testing program to other locations as well. Next up is its clinic in Cicero, located at 4745–51 W. Cermak Road. Testing at this clinic is expected to start in early May.",
        "",
        "",
        "Contact",
        "",
        "Jacqueline Carey",
        "312-996-8277",
        "jmcarey@uic.edu",
        "twitter.com/JCareyUIC",
        "",
        "",
        "",
        "",
        "Jacqueline Carey",
        "312-996-8277",
        "jmcarey@uic.edu",
        "twitter.com/JCareyUIC",
        "",
        "Categories",
        "",
        "Coronavirus, Health Sciences Colleges, Patient Care, UI Hospital",
        "Topics",
        "coronavirus, COVID-19, Mile Square Health Center, novel coronavirus"
    ],
    "out_links": [
        "http://uic.edu/",
        "https://today.uic.edu/",
        "https://today.uic.edu/campus-news",
        "https://today.uic.edu/academics-research",
        "https://today.uic.edu/events",
        "https://today.uic.edu/resources",
        "https://today.uic.edu/resources/current-students",
        "https://today.uic.edu/resources/faculty-staff",
        "https://today.uic.edu/resources/photo-video-policies",
        "https://today.uic.edu/resources/social-media-inquiry-form",
        "https://today.uic.edu/uic-social-media-guidelines-and-best-practices",
        "https://today.uic.edu/coronavirus",
        "https://today.uic.edu/frequently-asked-questions",
        "https://today.uic.edu/what-you-need-to-know-about-covid-19",
        "https://today.uic.edu/support-for-the-uic-community",
        "https://today.uic.edu/teaching-learning-and-working-resources",
        "https://today.uic.edu/in-the-news-covid-19",
        "https://today.uic.edu/contact",
        "https://today.uic.edu/contact/communicating-on-campus",
        "https://today.uic.edu/contact/communicating-on-campus/sending-massmails-dddh",
        "https://today.uic.edu/contact/social-media-directory",
        "https://today.uic.edu/author/jmcarey",
        "https://today.uic.edu/category/official/covid19",
        "https://today.uic.edu/category/hsc",
        "https://today.uic.edu/category/category-patient-care",
        "https://today.uic.edu/category/category-ui-hospital",
        "https://today.uic.edu/tag/coronavirus",
        "https://today.uic.edu/tag/covid-19",
        "https://today.uic.edu/tag/mile-square-health-center",
        "https://today.uic.edu/tag/novel-coronavirus",
        "https://today.uic.edu/campus-news/campus-newspaper/subscribe-to-uic-today",
        "https://today.uic.edu/news-release/news-release/",
        "https://today.uic.edu/experts-guide",
        "https://today.uic.edu/contact/communicating-on-campus/submit-announcements",
        "https://today.uic.edu/submit-an-event",
        "http://catalog.uic.edu/ucat/academic-calendar/",
        "http://www.uic.edu/apps/departments-az/search",
        "http://disabilityresources.uic.edu/",
        "http://emergency.uic.edu/",
        "http://events.uic.edu/",
        "http://uic.edu/about/job-opportunities",
        "http://library.uic.edu/",
        "http://maps.uic.edu/",
        "http://dos.uic.edu/studentveteranaffairs.shtml"
    ]
}