{
    "url": "https://uihealth.uic.edu/covid-19-information-resources/",
    "title": "COVID-19 Information & Resources | UI Health | University of Illinois at Chicago",
    "text": [
        "Officials at the University of Illinois at Chicago, the University of Illinois System and public health officials locally and nationally, are closely monitoring an outbreak of respiratory illness caused by a novel (new) coronavirus, named COVID-19.",
        "UIC has created a central webpage to bring the latest news and information about COVID-19 to the campus community. Use this link below to stay informed.",
        "As UIC’s academic health enterprise, UI Health continues to collaborate and monitor the developing public health crisis of COVID-19. Many dimensions of our enterprise are directly impacted by this crisis and we aim to connect you to the most up-to-date information as possible. Below you will find information and resources to guide you to answer your questions about our clinical, academic and research operations during this time.",
        "As a healthcare provider, UI Health continues to monitor and respond to the care needs of our patients and community. Please visit the UI Health Hospital & Clinics page here for updated patient information.",
        "Here is some quick information about clinical operations (Updated 3/18/20):",
        "The Health Sciences Colleges at UIC remain committed to training the future leaders of health and medicine – especially during the time of a public health crisis. To ensure the health and wellness of our students, many colleges have been making adjustments to their instruction and clinical engagements.",
        "Links below will provide current information and processes relevant to each college:",
        "The Office of the Vice Chancellor for Research (OVCR) will continue to provide services and support during the immediate future. It is recommend that health and safety guidelines are followed to ensure that all research at UIC is conducted or modified in a manner that minimizes risk to research personnel and any research participants during the COVID-19 pandemic.",
        "As our academic health community grapples with the the evolving COVID-19 pandemic across the state and the nation, there are various opportunities for individuals and students to get involved to assist with various needs. Check back often for additional information.",
        "As the number of cases of COVID-19 increases across the state of Illinois and the country, individuals often seek guidance and resources for how to keep healthy and safe. Below you will find updated resources. (as of 3/20/20)"
    ],
    "out_links": [
        "https://uihealth.uic.edu/",
        "http://uihealth.uic.edu/",
        "https://uihealth.uic.edu/about-us/",
        "https://uihealth.uic.edu/health-sciences/",
        "https://uihealth.uic.edu/healthcare/",
        "https://uihealth.uic.edu/research-2/",
        "https://uihealth.uic.edu/community/",
        "https://give.uic.edu/",
        "http://uic.edu/",
        "http://maps.uic.edu/",
        "https://uihealth.uic.edu/help-during-the-covid-19-pandemic/",
        "https://today.uic.edu/coronavirus",
        "https://dentistry.uic.edu/patients",
        "http://ahs.uic.edu/",
        "http://ahs.uic.edu/inside-ahs/inside-ahs-news?category=4688",
        "https://dentistry.uic.edu/",
        "https://medicine.uic.edu/",
        "https://medicine.uic.edu/coronavirus/",
        "https://nursing.uic.edu/",
        "https://nursing.uic.edu/faqs-for-students-covid-19-response/",
        "https://pharmacy.uic.edu/",
        "https://pharmacy.uic.edu/covid19/",
        "https://publichealth.uic.edu/",
        "https://publichealth.uic.edu/about/novel-coronavirus-information/",
        "https://socialwork.uic.edu/",
        "https://socialwork.uic.edu/about-us/message-from-the-dean/coronavirus-update-from-dean/",
        "https://today.uic.edu/covid-19-guidance-for-research-activities?utm_campaign=covid-19-guidance-for-research-activities_526&utm_medium=email&utm_source=mailpoet",
        "https://research.uic.edu/news-stories/covid-19/",
        "https://emails.uofi.uic.edu/newsletter/747649.html",
        "https://publichealth.uic.edu/about/novel-coronavirus-information/covid-19-volunteer-opportunities/",
        "https://today.uic.edu/what-you-need-to-know-about-covid-19",
        "https://today.uic.edu/frequently-asked-questions",
        "http://publichealth.uic.edu/",
        "https://uihealth.uic.edu/health-sciences/sample-page/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}