{
    "url": "https://uihealth.uic.edu/health-sciences/sample-page/",
    "title": "Health Professions Admissions | UI Health | University of Illinois at Chicago",
    "text": [
        "Interested in learning more about health professions at UIC?",
        "As UIC’s academic health enterprise, UI Health uniquely integrates the seven UIC health sciences colleges among the healthcare delivery system. The incorporation of the educational curriculum of the health professions at UIC with the clinical delivery system offers real-world experience in a health system and compliments the student learning experience.",
        "With an aim to train the healthcare leaders of the future, UI Health fosters an environment of interprofessional education and collaborative practice that promotes interdisciplinary participation in the healthcare delivery for patients and families across Illinois and beyond.",
        "More information about degrees and programs and how to pursue a health professions education at UIC that matches your passion can be found here. Click below to navigate directly to admissions requirements and processes for a particular program.",
        "",
        "",
        "The College of Applied Health Sciences is a socially conscious, research-intensive academic community whose mission is to broaden understanding of applied health sciences and disability. We strive to identify and meet the health needs of our society and pursue our mission by:",
        "We offer academic programs in the following disciplines:",
        "Apply now on-line here: http://ahs.uic.edu/applying",
        "The College of Dentistry offers training for both the Doctor of Dental Medicine and Doctor of Dental Medicine Advanced Standing programs. Admission to both programs is highly competitive.",
        "The DMD program is designed to graduate oral health professionals with strong competencies in health promotion and disease prevention, diagnosis, evidence-based practice, communication, collaboration, and community engagement. This is a full time, year round four-year program with a fall term start. The DAT exam is required in addition to a central application, coursework and letters of recommendation.  Further information about how to apply can be found here.",
        "The DMDAS program is an Advanced Standing Program for Foreign Trained Dentists designed for graduates of a recognized foreign dental school who want to practice dentistry in the United States. This is a full time year round    28-month program with a spring start.  Upon the successful completion of the program the participant is awarded a Doctor of Dental Medicine (DMD) degree. In addition to a central application, the TOEFL, National Board Exams part 1 and part 2 and letters of recommendation are required.   Further information about how to apply can be found here.",
        "The College of Nursing has programs for future and current nursing at every level of their career. Aspiring Registered Nurses (RN) are trained through our bachelor of science in nursing (BSN) or our advanced generalist master’s program- graduate entry program. Our master of science (AGMS) and certificateprograms prepare current nurses to be clinical leaders within their unit and specialization.  And our doctor of philosophy and doctor of nursing practice degrees prepare current nurses in research (PhD) and clinical areas of focus (DNP).",
        "All of our high-quality programs are contemporary and evidence-based, often incorporating new knowledge generated by our own distinguished faculty. Students studying at any of our six campuses experience a dynamic, student-centered school recognized as a leader in nursing education, research and practice.",
        "The College’s MD programs prepare students for the practice of medicine with an outstanding science education and extensive clinical experience. Students are assigned to either the Chicago campus, the Peoria campus, or the Rockford campus for the duration of the program.",
        "In order to apply to the standard track MD Program, please follow the directions given on the application process website.",
        "The MD/PhD Degree is offered through the Chicago Campus’s Medical Scientist Training Program (MSTP). The program makes recommendations to the admissions committee for acceptance, in most cases prior to initial matriculation.",
        "A breadth of study areas & depth of faculty expertise, allowing students to both explore & specialize.",
        "Whether you’re earning a PharmD or pursuing one of our master’s or doctorate degrees, you can count on being taught by award-winning faculty whose work is shaping the future of the field. You can also count on gaining valuable hands-on experience, building a powerful professional network, and knowing that you have what it takes to refine an expertise and dive into your career.",
        "Our diverse student body has two things in common: a passion for learning and a drive to make a difference. Sound like a good fit?",
        "The UIC School of Public Health is dedicated to excellence in protecting and improving the health and well-being of the people of the metropolitan Chicago area, the State of Illinois, the nation, and of others throughout the world. As the only Council on Education for Public Health (CEPH) accredited school of public health in Illinois, we are a leader in educating public health professionals. From our degree and certificate programs to providing the option to take classes as a non-degree seeking student, we offer a wide array of academic options for those at any stage of their public health career. This website will provide you detailed information on the application processes for our various programs. To learn more specific information about the programs themselves, please visit the Academics section of our website.",
        "The UIC School of Public Health seeks well-rounded, qualified persons with a commitment to public health and service to diverse communities. UIC and the School of Public Health are committed to equality of educational opportunity and do not discriminate against applicants or students based on race, ethnicity, national origin, religion, gender, age, sexual orientation, or disability. For the UIC Nondiscrimination Policy, please click here.",
        "For any questions concerning Admissions, please contact Brandon Sieglaff, Assistant Director of Admissions & Recruitment, at (312) 996-6628 or sieglaff@uic.edu.",
        "The Jane Addams College of Social Work is dedicated to providing outstanding academic programs that prepare competent and effective social work professionals committed to practice with poor and oppressed populations, and who will work to alleviate poverty, oppression, and discrimination. The College offers the Master of Social Work (MSW) degree, a Master of Social Work and Master of Public Health (MSW/MPH) joint degree program, a Certificate in Evidence-Based Mental Health Practice with Children, and the Doctor of Philosophy in Social Work (PhD) degree. The College also offers a non-degree Post-MSW Professional Educator’s License (PEL) for School Social Workers.",
        "The MSW program prepares students for advanced social work practice in four specializations: mental health, child and family services, organization and community practice, and school social work practice. The MSW/MPH Joint degree program provides students with integrated formal study in social work and public health. The doctoral program is designed for individuals planning careers in social work education, research, or administration. The Post-MSW PEL School Social Worker non-degree program prepares individuals who have already obtained an MSW to become eligible for the Illinois State Board of Education Professional Educator’s License “School Social Worker Endorsement” application process.",
        "https://socialwork.uic.edu/"
    ],
    "out_links": [
        "https://uihealth.uic.edu/",
        "http://uihealth.uic.edu/",
        "https://uihealth.uic.edu/about-us/",
        "https://uihealth.uic.edu/health-sciences/",
        "https://uihealth.uic.edu/healthcare/",
        "https://uihealth.uic.edu/research-2/",
        "https://uihealth.uic.edu/community/",
        "https://give.uic.edu/",
        "http://uic.edu/",
        "http://maps.uic.edu/",
        "http://ahs.uic.edu/applying",
        "https://dentistry.uic.edu/programs/doctor-dental-medicine-dmd/requirements",
        "https://dentistry.uic.edu/programs/doctor-dental-medicine-dmd/how-to-apply-to-dmd-program",
        "https://dentistry.uic.edu/programs/doctor-dental-medicine-advanced-standing-dmd-as",
        "https://dentistry.uic.edu/programs/doctor-dental-medicine-advanced-specialty-dmd-as/how-to-apply-to-dmd-as-program",
        "https://nursing.uic.edu/programs/",
        "https://nursing.uic.edu/programs/bachelor-science-nursing/",
        "https://nursing.uic.edu/programs/graduate-entry-master-science/",
        "https://nursing.uic.edu/programs/certificate-programs/",
        "https://nursing.uic.edu/programs/phd/",
        "https://nursing.uic.edu/programs/doctor-nursing-practice/",
        "http://medicine.uic.edu/education/md-admissions/application-process/",
        "http://pharmacy.uic.edu/programs/pharmd-professional-program/rpharm/how-to-apply",
        "http://pharmacy.uic.edu/programs/pharmd-professional-program/upharm/how-to-apply",
        "http://pharmacy.uic.edu/programs/pharmd-professional-program/applying-new",
        "http://pharmacy.uic.edu/about/contact",
        "http://pharmacy.uic.edu/about/rockford-campus",
        "http://pharmacy.uic.edu/about/chicago-campus",
        "http://publichealth.uic.edu/academics",
        "http://grad.uic.edu/cms/?pid=1000048",
        "https://socialwork.uic.edu/",
        "http://ahs.uic.edu/",
        "https://dentistry.uic.edu/",
        "https://medicine.uic.edu/",
        "https://nursing.uic.edu/",
        "https://pharmacy.uic.edu/",
        "http://publichealth.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}