{
    "url": "https://vcha.uic.edu/units/ovcha-communications/healthcare-simulation-week-2019/",
    "title": "Healthcare Simulation Week 2019 | Office of the Vice Chancellor for Health Affairs | University of Illinois at Chicago",
    "text": [
        "Join the celebration - September 16-20",
        "As leaders in health care delivery, translational research and education across multiple diverse disciplines, UI Health | UIC is committed to training the health care leaders of the future. One element of modern education for practitioners and students today is through medical simulation techniques.",
        "UIC is the home to seven health sciences colleges that educate and train future health care professionals. In these professions, education that provides safe opportunities for students to gain hands on experiences is considered the gold standard. These colleges have pioneered the use of simulation labs as part of core curricula for students.",
        "For the second year, UIC's healthcare delivery enterprise is joining the national celebration of Healthcare Simulation Week on September 16-20. This campaign is focused on bringing greater awareness to the extraordinary simulation assets that exist across UI Health | UIC.",
        "Participate in the conversation on social media and share your simulation experience or point of pride by using #UIC, #HcSimWeek19 and @HcSimWeek in your posts.",
        "Explore the arenas below where simulation is making a difference in the training and experience of our students and clinical experts.",
        "Faculty across the departments of the College of Applied Health Sciences integrate simulation experiences throughout their curriculum. In AHS, simulation is an important educational tool that is employed in many different environments – not necessarily in a simulation center – including natural environments such as hospitals and clinics where students use standardized patients in case-relevant role play activities.",
        "Since AHS does not house a simulation facility, it collaborates closely with other health sciences colleges such as the College of Nursing and the College of Medicine to share resources rather than duplicate experiences on campus. Among these collaborations, AHS brings to the table a model apartment used in occupational therapy and is a national leader in the use of computer-based simulation in biomedical visualization.",
        "The UIC College of Dentistry integrates simulated experiences for students in preparation for clinical experiences in their 3rd and 4th years. During the first two years of the DMD program, students gain comprehensive, in-depth understanding of dental biomedical and clinical sciences covering several biomedical topics and compliment this educational approach with rigorous training and simulation experiences to apply those concepts in pre-patient clinics to gain hands-on knowledge, under close supervision of expert faculty.",
        "The Graham Clinical Performance Center at the College of Medicine was established in 1987 and is one of the first performance assessment centers in the United States.",
        "For nearly 30 years, they have served thousands of medical students with simulation training featuring standardized patients and dedicated mannequin simulation suite with additional procedural skills lab. The GCPC offers powerful tools for instruction, assessment and patient safety, as well as groundbreaking research.",
        "The College of Nursing Clinical Learning Resource Center provides support services for graduate and undergraduate nursing students and other health professionals through simulation-based instruction, clinical laboratory experiences, and student services. The center offers state-of-the-art facilities where learners can apply knowledge, skills and attitudes in a safe simulated environment.",
        "The M. Christine Schwartz Experiential Learning Laboratory was opened in August 2014.  The center is designed to give students hands-on clinical experience utilizing a variety of simulation activities including high and low fidelity mannequins, task trainers and standardized patients.",
        "The College of Nursing also recently received a $5M philanthropic gift to expand its current simulation lab.  The new simulation lab will open in 2019.",
        "The College of Medicine’s OB/GYN Women of Steel Simulation Lab provides improved outcomes for pregnancies and neonates through the exemplary professional education, program implementation, and quality monitoring. A part of the Perinatal Program, the Simulation lab strives for continued advancements and academic excellence.",
        "The Robotic Surgical Training Laboratory in the College of Medicine is a state-of-the-art facility that includes a DaVinci robotic system and a robotic surgery simulator. This is the ideal setting to develop the first basic skills in robotic surgery, and also practice and develop skills in advanced applications of the robotic system.",
        "This lab was designed to give surgical residents, fellows and attendings additional training in human anatomy and to enable them to perfect surgical procedures for operating room use. It also affords the medical faculty the opportunity to test and perfect biomedical technology.",
        "The Jump Trading Simulation & Education Center is a collaboration between the University of Illinois College of Medicine Peoria and OSF Healthcare located in Peoria, Illinois. Jump Simulation was created to improve outcomes and lower health care costs through innovative simulation training of medical professionals.",
        "An accredited program by the Society for Simulation in Healthcare, Jump Simulation is a 168,000 square foot center that houses state-of-the-art simulation experiences for a variety of encounters. It also features a virtual reality lab that explores the opportunity for simulated clinical intervention and educational training models. Additional simulation labs at Jump include Anatomical Skills, Innovation Lab, Regional Transport Center, Skills Lab and Virtual Hospital.",
        "The benefits of simulation go beyond medical education—it can also benefit researchers undertaking complex studies. The success of clinical trials rests on researchers’ ability to design studies that can be carried out at scale, recruit participants, and retain participants for the duration of the study.",
        "In collaboration with researchers from across the country, the Program for Healthcare Delivery Design uses design methods (such as real-time remote observation) to simulate + evaluate the real-world experience of a study protocol. These pilot studies help researchers quickly identify strategies to enhance the study experience for participants, save time during study visits, and ensure accurate data collection—before problems arise.",
        "To learn more about the Program for Healthcare Delivery Design (located at the main campus site of the Mile Square Health Center) contact Associate Director, Hugh Musick, at hmusick@UIC.EDU.",
        "The University of Illinois College of Medicine has a long-standing legacy of leadership in health care simulation and medical education. The Graham Clinical Performance Center at UIC has served medical students with simulation training using standardized patients, mannequin simulation and procedural skills labs. The team at the GCPC reflects upon their own experiences and the benefits that simulation brings to students and clinicians alike."
    ],
    "out_links": [
        "https://vcha.uic.edu/",
        "http://uic.edu/",
        "https://vcha.uic.edu/about/",
        "https://vcha.uic.edu/about/leadership/",
        "https://vcha.uic.edu/about/health-affairs-policies/",
        "https://vcha.uic.edu/units/",
        "https://vcha.uic.edu/units/business-development/",
        "https://vcha.uic.edu/units/ovcha-communications/",
        "https://vcha.uic.edu/units/health-policy-strategy/",
        "https://vcha.uic.edu/units/interprofessional-education-ipe/",
        "https://vcha.uic.edu/opioid-epidemic-2-2/",
        "https://vcha.uic.edu/units/population-health-sciences-program-phsp/",
        "https://vcha.uic.edu/units/quality-patient-safety/",
        "https://vcha.uic.edu/health_science_colleges/",
        "https://vcha.uic.edu/health-care/",
        "https://vcha.uic.edu/research-2/",
        "https://vcha.uic.edu/contact/",
        "http://maps.uic.edu/",
        "https://today.uic.edu/uic-celebrates-second-annual-healthcare-simulation-week",
        "https://today.uic.edu/sharper-view-of-eye-surgery",
        "https://today.uic.edu/5m-gift-to-expand-nursing-schools-simulation-lab",
        "https://dentistry.uic.edu/academics/teaching-and-learning",
        "https://chicago.medicine.uic.edu/graham-clinical-performance-center/",
        "https://www.nursing.uic.edu/about-us/clinical-learning-resource-center",
        "https://www.nursing.uic.edu/news/5m-gift-expand-nursing-schools-simulation-lab",
        "https://www.nursing.uic.edu/simulation-lab/lab-highlights",
        "https://chicago.medicine.uic.edu/departments/academic-departments/obstetrics-and-gynecology/divisions/perinatal-center/",
        "https://chicago.medicine.uic.edu/departments/academic-departments/surgery/education-training/training-laboratories/",
        "https://healthcaredeliverydesign.vcha.uic.edu/",
        "https://vcha.uic.edu/units/interprofessional-education-ipe/strategic-plan/",
        "https://vcha.uic.edu/units/interprofessional-education-ipe/ipe-steering-committee/",
        "https://vcha.uic.edu/units/interprofessional-education-ipe/ipe-steering-committee/group-1/",
        "https://vcha.uic.edu/units/interprofessional-education-ipe/ipe-steering-committee/group-2/",
        "https://vcha.uic.edu/units/interprofessional-education-ipe/ipe-steering-committee/group-3/",
        "https://vcha.uic.edu/units/interprofessional-education-ipe/ipe-steering-committee/group-4/",
        "https://vcha.uic.edu/units/interprofessional-education-ipe/ipe-steering-committee/group-5/",
        "https://vcha.uic.edu/units/interprofessional-education-ipe/ipe-steering-committee/group-6/",
        "https://vcha.uic.edu/units/interprofessional-education-ipe/resources/",
        "https://vcha.uic.edu/units/interprofessional-education-ipe/resources/ipe-funding-application/",
        "https://vcha.uic.edu/units/interprofessional-education-ipe/ipe-curriculum/",
        "https://vcha.uic.edu/units/interprofessional-education-ipe/resources/interprofessional-education-learning-experiences/",
        "https://vcha.uic.edu/units/interprofessional-education-ipe/ipe-curriculum/ipe-immersion-days/",
        "https://vcha.uic.edu/units/interprofessional-education-ipe/ipe-curriculum/interprofessional-education-collaborative-ipec-core-competencies/",
        "https://vcha.uic.edu/units/interprofessional-education-ipe/interprofessional-education-ipe-and-collaboration-for-students/",
        "https://vcha.uic.edu/units/interprofessional-education-ipe/institute-for-healthcare-improvement-open-school-chapter/",
        "https://vcha.uic.edu/units/interprofessional-education-ipe/interprofessional-education-ipe-and-collaboration-for-students/uic-2020-clarion-interprofessional-case-competition/",
        "https://vcha.uic.edu/units/interprofessional-education-ipe/ipe-icp-accreditation-standards/",
        "https://vcha.uic.edu/units/interprofessional-education-ipe/scholarship/",
        "https://vcha.uic.edu/units/interprofessional-education-ipe/contact-ipe/",
        "https://vcha.uic.edu/units/population-health-sciences-program-phsp/our-team/",
        "https://vcha.uic.edu/units/population-health-sciences-program-phsp/collaborate/",
        "https://vcha.uic.edu/units/population-health-sciences-program-phsp/2020-distinguished-scholar-series/",
        "https://vcha.uic.edu/units/population-health-sciences-program-phsp/careers/",
        "https://vcha.uic.edu/units/population-health-sciences-program-phsp/contact-us/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}