{
    "url": "https://grad.uic.edu/assistantships/",
    "title": "Assistantships | Graduate College | University of Illinois at Chicago",
    "text": [
        "Colleges, graduate programs, administrative offices, and research centers appoint graduate students as teaching (TA), research (RA), or graduate assistants (GA). Students apply for and obtain most assistantships through their graduate programs. The Human Resources Job Board has listings for assistantships that are open to the general graduate student population (see listings towards bottom of the above link).",
        "Comprehensive information about assistantships is found at the UIC 101 Graduate Assistants page.  That page includes a Graduate Assistantship HR Resource Guide.",
        "",
        "At UIC, teaching assistantships, research assistantships and graduate assistantships are available. For information on available assistantships, contact the Director of Graduate Studies in the academic program.",
        "",
        "The weekly clock hours of service are based on a forty-hour work-week. Thus, a half-time (50% FTE) appointment requires twenty hours weekly; a 25% appointment requires ten hours weekly; etc. Federal law restricts international employee appointments to 50% FTE (twenty hours per week) during the academic term, regardless of the number of positions held, e.g., a 25% RA can also hold a 25% TA. International students can exceed twenty hours weekly during academic breaks. And, work authorization is impacted by the graduation date.",
        "",
        "Minimum stipend amounts are established through collective bargaining. Departments may offer higher than the minimum. See Salary for Graduate Assistantships (includes eligibility criteria for the appointment to be qualified for a waiver of tuition and certain fees) for the current year. Specifications for upcoming years may be viewed in the contract – see the link in the Teaching (TA) and Graduate (GA) Assistantship Labor Agreement section below. Even though Research Assistantship (RA) appointments are not under the contract, the minimum stipend applies to those positions as well.",
        "",
        "Verify with the unit or academic program from which you are seeking an appointment if they require the Application for Graduate Appointment form. Many units and academic programs use their own form.",
        "",
        "Tuition and some fees are waived for assistants if the appointment is between 25 and 67 percent for at least three-quarters of the term (91 calendar days in fall or spring semester, 41 calendar days during the summer session). To determine if an appointment meets the calendar-day requirement, see appointment duration ranges.  The waiver does not cover any tuition differential that may be assessed, except for students registered in the following programs: Biological Sciences, Chemistry, Earth & Environmental Sciences, Physics, and Psychology.",
        "See the tuition schedule for information on specific tuition rates. Graduate students who hold academic appointments as assistants for the spring semester and for whom tuition and service fees were waived in the spring are entitled to a waiver for the summer term immediately following if they do not hold a summer assistantship, provided they are registered for at least three hours during that summer term. Graduate students holding a summer assistantship must satisfy eligibility requirements for a waiver, as described in the previous paragraph, as well as the registration requirements specified below. Assistantship waivers cover the following charges:",
        "Assistantship waivers do not cover the following charges:",
        "For a complete tuition and fee schedule, please refer to the Office of Registration and Records.",
        "Dental and vision benefits are provided by the University for all assistantship recipients with at least a 25% appointment. See the Grad Assistant Dental and Vision Benefits page on the UIC HR website for full details about eligibility and enrollment in these plans. In addition, Assistants who utilize CampusCare  should consult the “Benefits” tab on the top of the CampusCare site).",
        "",
        "",
        "For more information:",
        "Registration requirements vary depending on the full-time equivalency (FTE) of the appointment and the term of registration. Some programs may require registration for more than eight hours per term and/or summer registration. Although the Graduate College does not require summer registration to hold a summer assistantship, a minimum of three hours registration is required to receive a summer tuition and partial fee waiver.  Students receiving an assistantship must maintain a minimum registration through the end of the term in order to retain the waiver. A minimum of eight (8) hours in fall and spring is required to hold a waiver attached to a 50% FTE assistantship; however, nine (9) credit hours are required to be eligible for a CTA pass. Summer registration is optional for students with summer appointments, but a minimum three (3) hours in summer is required to receive the waiver. International students may have additional registration requirements. Generally:",
        "Summer registration is not required (see above). International students should confer with the Office of International Services for additional information.",
        "",
        "Assistantship Offer Letter Templates:  Hiring units must follow the assistantship offer letter template provided by HR for the offer letters sent to teaching assistants (TAs), research assistants (RAs); and graduate assistants (GAs).  Note that there are separate templates within the Word document for TAs and GAs, and the templates are by academic year (must be followed, as the tuition differential listings change by academic year). RAs are not part of the GEO union, so information about the union should not be included in the RA offer letter.",
        "Effective August 16, 2006, Teaching and Graduate Assistants at UIC have entered into an agreement by and between the Board of Trustees of the University of Illinois and the Graduate Employees’ Organization (GEO).  Administration of the agreement is handled by Office of Human Resources.  Please refer to the current agreement (August 16, 2018 – August 15, 2021) to learn more about the rights and responsibilities contained therein.  Please refer to the Human Resources web site for contact information.",
        "",
        "An assistantship plus any loan or federal work-study eligibility cannot exceed the cost of attendance for the academic year. If applying for loans and/or work-study a Free Application for Federal Student Aid (FAFSA) must be completed.  Consult the Office of Student Financial Aid website for more information, or make an appointment to speak with a Financial Aid Counselor.",
        "",
        "Graduate Assistants may contribute to the 403(b) and/or 457 Deferred Compensation plans using traditional pre-tax and/or Roth contributions. Contributions to the optional retirement plans may be started, changed, or stopped at any time during employment. Minimum annual contribution: $200 (or $16.67 per month).",
        "The Graduate College does not handle waivers attached to employment; however, here are some suggestions. First, are you registered for the correct number of hours? If yes: Did your department’s HR person enter your appointment correctly? If yes: Contact Financial Aid. Please note that summer “roll-over” waivers must be entered manually and may not post until the second week of the Summer 2 session."
    ],
    "out_links": [
        "https://grad.uic.edu/",
        "http://uic.edu/",
        "https://grad.uic.edu/admissions/",
        "https://grad.uic.edu/admissions/degree-admission/",
        "https://grad.uic.edu/admissions/deadlines/",
        "https://grad.uic.edu/funding-awards/",
        "https://grad.uic.edu/funding-awards/graduate-funding-overview/",
        "https://grad.uic.edu/funding-awards/graduate-college-fellowships/",
        "https://grad.uic.edu/funding-awards/other-funding/",
        "https://grad.uic.edu/programs/",
        "https://grad.uic.edu/programs/graduate-college-courses/",
        "https://grad.uic.edu/programs/graduate-program-in-neuroscience/",
        "https://grad.uic.edu/diversity/",
        "https://grad.uic.edu/diversity/recruitment/",
        "https://grad.uic.edu/diversity/fellows-mentoring-support-initiative/",
        "https://grad.uic.edu/diversity/dfi-program/",
        "https://grad.uic.edu/funding-awards/graduate-college-fellowships/pif/",
        "https://grad.uic.edu/diversity/pbrc-prep/",
        "https://grad.uic.edu/diversity/srop-program/",
        "https://grad.uic.edu/academic-support/",
        "https://grad.uic.edu/academic-support/academic-dates-events/",
        "https://grad.uic.edu/academic-support/registration-information/",
        "https://grad.uic.edu/academic-support/thesis/",
        "https://grad.uic.edu/academic-support/exams-defense/",
        "https://grad.uic.edu/academic-support/graduate-college-policies/",
        "https://grad.uic.edu/academic-support/ta-enrichment/",
        "https://grad.uic.edu/academic-support/graduation-information/",
        "https://grad.uic.edu/academic-support/student-resources/graduate-student-forms/",
        "https://grad.uic.edu/academic-support/student-resources/",
        "https://grad.uic.edu/about/",
        "https://grad.uic.edu/about/graduate-college-directory/",
        "https://grad.uic.edu/about/faculty-listings/",
        "https://grad.uic.edu/about/gc-newsletters/",
        "https://grad.uic.edu/about/contact-us/",
        "https://grad.uic.edu/faculty-staff-resources/",
        "https://grad.uic.edu/alumni/",
        "https://grad.uic.edu/about/giving/",
        "http://maps.uic.edu/",
        "https://jobs.uic.edu/job-board",
        "https://jobs.uic.edu/job-board/",
        "https://hr.uic.edu/employees/new-employees/uic-101/graduate-assistants/",
        "http://grad.red.uic.edu/funding-awards/assistantships-faqs/",
        "https://grad.uic.edu/funding-awards/assistantships-faqs/",
        "https://hr.uic.edu/hr-staff-managers/compensation/minima-for-graduate-appointments/",
        "https://hr.uic.edu/hr-staff-managers/hiring/grad-assistants/",
        "https://admissions.uic.edu/graduate-professional/tuition-fees",
        "https://campuscare.uic.edu/",
        "http://www.uic.edu/depts/oar/grad/tuition_grad.html",
        "https://grad.uic.edu/waiver-taxation-faqs/",
        "https://www.ois.uic.edu/",
        "https://hr.uic.edu/hr-staff-managers/resources/template-letters/",
        "https://hr.uic.edu/hr-staff-managers/labor-employee-relations/labor-agreements/",
        "https://www.hr.uic.edu/hr_services_and_support/contact/",
        "https://financialaid.uic.edu/",
        "https://www.hr.uic.edu/cms/One.aspx?pageId=182928&portalId=2800",
        "https://grad.uic.edu/funding-awards/acceptance-of-offer-of-financial-support-april-15/",
        "https://grad.uic.edu/funding-awards/assistantships/",
        "https://grad.uic.edu/funding-awards/fellowship-office-info/",
        "https://grad.uic.edu/funding-awards/graduate-college-waivers/",
        "https://grad.uic.edu/funding-awards/graduate-college-fellowships/psp/",
        "https://grad.uic.edu/funding-awards/graduate-college-fellowships/emergency-grants/",
        "https://grad.uic.edu/funding-awards/other-funding/online-funding-resources/",
        "https://grad.uic.edu/funding-awards/other-funding/natl-internatl-opps/",
        "http://catalog.uic.edu/ucat/academic-calendar/",
        "http://today.uic.edu/",
        "http://events.uic.edu/",
        "http://uic.edu/about/visit-directions",
        "http://clery.uic.edu/",
        "http://oae.uic.edu/UnlawfulDiscrimination/index.htm",
        "http://oae.uic.edu/sexual-misconduct/",
        "http://financialaid.uic.edu/consumer-information/department-education-complaint-process/",
        "https://my.uic.edu/",
        "https://outlook.uic.edu/",
        "https://accc.uic.edu/service/g-suite",
        "https://grad.uic.edu/wp-admin",
        "https://wellnesscenter.uic.edu/",
        "https://writingcenter.uic.edu/",
        "https://wellnesscenter.uic.edu/resources-and-services/pop-up-pantry/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}