{
    "url": "https://business.uic.edu/graduate-programs/graduate-degrees/master-business-administration/",
    "title": "Master of Business Administration | UIC Business | University of Illinois at Chicago",
    "text": [
        "Accelerate your career with an MBA from the UIC Business Liautaud Graduate School.",
        "An MBA from UIC Business Liautaud Graduate School offers you the flexibility to pursue your MBA in a format that best suits your needs. You’ll earn a degree that is tailored to your specific interests and gain the hard and soft skills that will set you apart. The program is ranked #65 by U.S. News & World Report.",
        "Full-Time, Accelerated MBA",
        "Weekend MBA",
        "Flexible MBA Program",
        "Using improvisational theatre techniques taught in workshop exercise of graduating difficulty, this course creates a safe laboratory for students to experiment with the elements of their own executive presence.",
        "This course will introduce students to the fundamentals of web analytics, including metrics like web traffic and how long customers spend at pages. Students will learn to use Google’s online and offline software tools.",
        "The aim of this course is to study “the triple bottom line.” Social enterprises utilize the business itself to serve as a vehicle for social change. As business leaders, social entrepreneurs want to improve the common good and solve a social problem.",
        "“The Liautaud experience has been phenomenal. As a part of the Accelerated Cohort MBA program, I appreciate the connections I’m developing with my classmates, laying down a solid foundation for my career network.”",
        "Learn more about our MBA Program.",
        "The MBA program is 54 credits in length composed of 26 credits of core courses and 28 credits of electives. Your core courses introduce the fundamental concepts needed to understand the many facets of a complex organization and provide a foundation for further, more in-depth functional business study.",
        "The core curriculum consists of the following seven courses:",
        "UIC Business is part of a public research university, so tuition and fees vary by residency. Also, because our programs offer flexible options, our tuition varies based on the number of classes you are taking each semester. To calculate your tuition and fees, please visit the Tuition Information page.",
        "Don’t forget, UIC Business offers graduate assistantships, scholarships and partial tuition waivers. Ask an admissions representative about the many options we offer to help you afford your education.",
        "Accounting is the language of business. With this concentration, you’ll learn how to maintain the financial health of an organization.",
        "Sample of courses:",
        "This concentration trains students in the use of data and models for business decisions, and how to leverage ‘big’ data and analytics for competitive advantage. MBA students with the Business Analytics concentration are prepared to meet demand in one of the most rapidly expanding fields in business.",
        "Sample of courses:",
        "Economics gives you an in-depth look at what drives businesses and consumers. This concentration focuses on applied economics with a focus on health, education and urban issues.",
        "Sample of courses:",
        "With this concentration, you’ll learn how to evaluate the risks and rewards of a new venture, skills which can be applied to both new and existing businesses.",
        "Sample of courses:",
        "Students will gain a better understanding of financial assets and how to manage risks and investments.",
        "Sample of courses:",
        "Get a closer look at the global business environment. If you are looking to work abroad or for a large multinational company, these courses will deepen your understanding of business on a global scale.",
        "Sample of courses:",
        "This concentration will equip the knowledge to lead people and organizations with an understanding of human resource management, strategic management, leadership, managerial skills and logistics.",
        "Sample of courses:",
        "With a concentration in MIS, you’ll learn how to design and manage information and IT systems in ways that have a direct impact on strategy and operational decisions.",
        "Sample of courses:",
        "Students in this concentration develop a strong understanding of the entire marketing process in business from research and product development to communications planning and measurement.",
        "Sample of courses:",
        "MBA students in this concentration study the strategic management and operation of global supply chains, the flow of goods and services and complex business processes.",
        "Sample of Courses",
        "Combining economics, finance, and urban planning students gain a full perspective of the field of real estate with an emphasis in urban real estate markets using metropolitan Chicago as a working laboratory.",
        "Sample of Courses",
        "If the other concentrations don’t fit the career path you are building, work with an adviser to develop one.",
        "Interested in studying outside of the United States? UIC Business offers several opportunities to study abroad.",
        "Doing Business in Brazil is a two-week course in Sao Paulo, Brazil, at the Fundacao Getulio Vargas, considered one of the top business schools in South America. This English-language course covers Brazilian and South American business issues, the political and social climate, national culture, consumer marketing and Mercosur. MBA students receive four elective credits for participating in the program.",
        "Know Europe is a four-week course, through the ESC Normandy. Study is organized in Brussels, Belgium; Haarlem, Amsterdam; Paris, Le Havre and Caen, France; and Barcelona, Spain. Professors are drawn from Europe, the United Kingdom and Australia. The program includes meetings with local businesses, field visits to seats of European government and presentations on major aspects of European administration and culture. MBA students receive six elective credits for participating in the program.",
        "The Weekend MBA Program and the Accelerated MBA start in the fall semester only. Students in the flexible program can start in the summer, fall or spring.",
        "Online courses are often very different than traditional on-campus courses in terms of how the material is presented, the nature of the interaction among class members and the overall learning experience. However, the course load is at the same level as the face-to-face version; the only amount of time saved is your commute time to and from campus. Our online courses use the Blackboard software. Select courses are offered online, and offerings vary each semester.",
        "UIC does not offer an exclusively online MBA degree. Online coursework is offered for five of the 14 courses required to complete an MBA (remaining courses typically have evening and weekend offering times to make it convenient for working professionals). Our campus-based MBA delivers deep and interactive class discussions that encourage critical thinking and problem solving, and promotes networking, team projects and campus involvement.",
        "MBA applicants are expected to have at least two years of business related work experience after the completion of a 4-year bachelor’s degree. Historically, our typical admitted student had more than this level of experience prior to applying to the UIC Business MBA program.",
        "Applicants may apply to a joint degree program during the initial application process, or they may apply to their second program upon gaining admission and enrolling in their first program.",
        "First time applicants to UIC wishing to enroll in a joint degree program are required to apply separately to both programs, making sure to follow the application procedures/requirements for each program.",
        "Current UIC graduate students interested in applying to a joint degree program should work closely with academic advisers in both programs and visit Business Connnect for additional instruction.",
        "An undergraduate degree in business administration is not required. In fact, our Accelerated MBA Program is designed specifically for those with an undergraduate background in a non-business field. Approximately 50% of our student body does not have an undergraduate business background. We do recommend that students have had a class in statistics. If they have not, they can take one during their first semester.",
        "You may be admitted to the Liautaud MBA Program on a non-degree basis only in the following two cases:",
        "1. If you have already completed an MBA or other approved management degree from an AACSB accredited institution and wish to pursue further course work, you may enroll in MBA classes on a space-available basis as long as you maintain good academic standing. The application for admission and proof of MBA degree (a photocopy of your transcript or diploma showing a completed MBA degree) must be submitted by the application deadline for the desired term of study.",
        "2. If you are currently enrolled in an MBA program at another AACSB institution and wish to take courses that will be accepted by your university as transfer courses, you may enroll in MBA courses to the extent approved by your MBA program and by the MBA Program. The MBA application for admission, application fee, proof of baccalaureate degree and letter from the director of your MBA program indicating that you are in good academic standing and list the courses approved to be transferred must be submitted by the application deadline for the desired term of study. You may also be asked by the admissions committee to provide additional information regarding your academic credentials."
    ],
    "out_links": [
        "https://business.uic.edu/",
        "http://uic.edu/",
        "https://business.uic.edu/undergraduate-programs/",
        "https://business.uic.edu/undergraduate-programs/undergraduate-admissions/",
        "https://business.uic.edu/undergraduate-programs/undergraduate-degrees/",
        "https://business.uic.edu/undergraduate-programs/uic-business-scholars/",
        "https://business.uic.edu/undergraduate-programs/pre-college-programs/",
        "https://business.uic.edu/undergraduate-programs/student-life-uic-business/",
        "https://business.uic.edu/undergraduate-programs/business-career-center/",
        "https://business.uic.edu/undergraduate-programs/ilead-professional-development-program/",
        "https://business.uic.edu/graduate-programs/",
        "https://business.uic.edu/graduate-programs/graduate-admissions/",
        "https://business.uic.edu/graduate-programs/graduate-degrees/",
        "https://business.uic.edu/graduate-programs/guaranteed-and-preferred-admissions/",
        "https://business.uic.edu/graduate-programs/graduate-career-services/",
        "https://business.uic.edu/doctoral-programs/",
        "https://business.uic.edu/doctoral-programs/degrees/",
        "https://business.uic.edu/doctoral-programs/uic-doctoral-students/",
        "https://business.uic.edu/alumni-and-community/",
        "https://business.uic.edu/alumni-and-community/give-to-uic-business/",
        "https://business.uic.edu/alumni-and-community/why-give/",
        "https://business.uic.edu/alumni-and-community/donor-recognition-society/",
        "https://business.uic.edu/alumni-and-community/student-scholarship-support/",
        "https://business.uic.edu/alumni-and-community/ways-get-involved/",
        "https://business.uic.edu/alumni-and-community/alumni-leadership-academy/",
        "https://business.uic.edu/alumni-and-community/contact-office-advancement/",
        "https://business.uic.edu/recruiters-and-companies/",
        "https://business.uic.edu/recruiters-and-companies/center-for-applied-analytics/",
        "https://business.uic.edu/faculty-and-research/",
        "https://business.uic.edu/faculty-and-research/faculty/",
        "https://business.uic.edu/faculty-and-research/research-2/",
        "https://business.uic.edu/faculty-and-research/international-center-futures-derivatives/",
        "https://business.uic.edu/faculty-and-research/ilead-institute-leadership-excellence-development/",
        "https://business.uic.edu/faculty-and-research/uic-entrepreneurial-support-program/",
        "https://business.uic.edu/faculty-and-research/for-the-media/",
        "https://business.uic.edu/faculty-and-research/faculty/faculty-recruitment/",
        "http://blog.business.uic.edu/",
        "http://businessconnect.uic.edu/",
        "https://business.uic.edu/about-uic-business/",
        "http://maps.uic.edu/",
        "https://applygrad.uic.edu/register/?id=7aba2f49-dec8-4266-9e74-da8033e045ca",
        "https://business.uic.edu/graduate-programs/graduate-events/",
        "https://admissions.uic.edu/graduate-professional/apply",
        "https://business.uic.edu/events/summer-domestic-admissions-deadline/",
        "https://business.uic.edu/events/round-one-fall-applications/",
        "https://business.uic.edu/events/round-two-fall-applications/",
        "https://business.uic.edu/events/round-three-fall-domestic-applications/",
        "https://business.uic.edu/events/round-three-fall-domestic-applications-2/",
        "https://business.uic.edu/events/international-applications/",
        "https://business.uic.edu/events/domestic-applications/",
        "https://registrar.uic.edu/tuition/grad/graduate-tuition-fall-2019-spring-2020",
        "https://catalog.uic.edu/gcat/colleges-schools/business-administration/actg/mba-ms-actg/",
        "https://catalog.uic.edu/gcat/colleges-schools/business-administration/mis/mba-ms-mis/",
        "https://medicine.uic.edu/education/md-curriculum/curricular-programs",
        "https://pharmacy.uic.edu/programs/joint-degree-programs",
        "http://publichealth.uic.edu/academics/joint-degrees",
        "https://catalog.uic.edu/gcat/colleges-schools/business-administration/bus-anal/ms-mba/",
        "https://catalog.uic.edu/gcat/colleges-schools/business-administration/supply-chain-operations-mgmt/joint-ms-mba/",
        "https://business.uic.edu/profiles/sudhakar-sid-balachandran/",
        "https://business.uic.edu/profiles/christopher-barlow/",
        "https://business.uic.edu/profiles/gib-bassett/",
        "https://business.uic.edu/profiles/bondarenko-oleg/",
        "https://business.uic.edu/profiles/brickson-shelley/",
        "https://business.uic.edu/profiles/chandrasekaran-ranganathan/",
        "https://business.uic.edu/profiles/hsiu-lang-chen/",
        "https://business.uic.edu/profiles/anna-cui/",
        "https://business.uic.edu/profiles/somnath-das/",
        "https://business.uic.edu/profiles/ellen-engel/",
        "https://business.uic.edu/profiles/david-gal/",
        "https://business.uic.edu/profiles/eliane-karsaklian/",
        "https://business.uic.edu/profiles/michael-kirschenheiter/",
        "https://business.uic.edu/profiles/matt-liotine/",
        "https://business.uic.edu/profiles/alan-malter/",
        "https://business.uic.edu/profiles/abagail-mcwilliams/",
        "https://business.uic.edu/profiles/john-miller/",
        "https://business.uic.edu/profiles/kim-moon/",
        "https://business.uic.edu/profiles/selva-nadarajah/",
        "https://business.uic.edu/profiles/unsal-ozdogru/",
        "https://business.uic.edu/profiles/susan-perkins/",
        "https://business.uic.edu/profiles/popowits-michael/",
        "https://business.uic.edu/profiles/ramakrishnan-ram/",
        "https://business.uic.edu/profiles/steve-sauerwald/",
        "https://business.uic.edu/profiles/george-scully/",
        "https://business.uic.edu/profiles/mark-shanley/",
        "https://business.uic.edu/profiles/john-sparks/",
        "https://business.uic.edu/profiles/ali-tafti/",
        "https://business.uic.edu/profiles/j-christopher-westland/",
        "https://businessconnect.uic.edu/graduate/current-grad-students/",
        "https://business.uic.edu/graduate-programs/graduate-degrees/master-science-accounting/",
        "https://business.uic.edu/graduate-programs/graduate-degrees/master-science-business-analytics/",
        "https://business.uic.edu/graduate-programs/graduate-degrees/master-science-finance/",
        "https://business.uic.edu/graduate-programs/graduate-degrees/master-science-management-information-systems/",
        "https://business.uic.edu/graduate-programs/graduate-degrees/master-science-marketing/",
        "https://business.uic.edu/graduate-programs/graduate-degrees/master-of-science-in-supply-chain-and-operations-management/",
        "https://business.uic.edu/events-2/",
        "https://business.uic.edu/news-2/",
        "https://business.uic.edu/cmba/",
        "http://www.uic.edu/",
        "http://www.uic.edu/admissions-aid/visit-campus",
        "http://accc.uic.edu/service/directory",
        "https://business.uic.edu/contact-uic-business/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}