{
    "url": "https://housing.uic.edu/academics/",
    "title": "Academic Support | Campus Housing | University of Illinois at Chicago",
    "text": [
        "We believe that a student's learning process is ongoing and we work to create academic opportunities outside of the classroom. These opportunities are intentionally developed and part of the educational advantage students receive when they choose to live on-campus.",
        "The Faculty in Residence Program offers the opportunity for selected faculty and their families to live in a residential community with students. It is a unique experience that encourages a crucial link between students and faculty. The Resident Faculty work closely with the Residence Life staff to create programs for the residents.",
        "Peer Mentors are the heart of our academic services effort. These students of sophomore standing or higher that have great leadership skills and proven academic success guide first-year students through the many different adjustments from the high school to the college experience, and encourage experienced students to become more involved in their academic community. Peer Mentors provide tutoring in our Learning Resource Centers and facilitate study sessions for first-year students. Peer Mentors also provide academic workshops, First Year Experience programming to help new students adapt to college, and individual follow up, referral to resources, and support for students needing additional help.",
        "Campus Housing facilities a wide range of programs and events for residents. These programs not only allow our residents to develop a community with their neighbors and classmates living on-campus, but also demonstrate the educational advantage to living on-campus.",
        "Through the Campus Housing Learning Areas, residents will:",
        "",
        "Our Living and Learning Communities (LLC) attract high-achieving students and provide specialized attention for an enriched educational experience. They offer a sense of community through programs, conversations, and faculty interaction centered on members’ interests.",
        "Learning Resource Centers (LRC) are purposeful locations for one-on-one and group tutoring, as well as study twenty-four hours a day. Peer Mentors offer tutoring in the LRCs most evenings in a range of subjects.",
        "LRC’s can be found on the east, south, and west sides of campus in Courtyard second floor, JST second floor, and PSR second floor, respectively."
    ],
    "out_links": [
        "https://housing.uic.edu/",
        "http://uic.edu/",
        "https://housing.uic.edu/apply/",
        "https://housing.uic.edu/apply/moveinfall/",
        "https://housing.uic.edu/rates/",
        "https://housing.uic.edu/halls/",
        "https://housing.uic.edu/services/",
        "https://housing.uic.edu/liveuic/",
        "https://housing.uic.edu/applyagain/",
        "https://housing.uic.edu/move-out/",
        "https://housing.uic.edu/summer/",
        "https://housing.uic.edu/reapp/",
        "https://housing.uic.edu/housing-during-breaks/",
        "https://housing.uic.edu/getinvolved/",
        "https://housing.uic.edu/handbook/",
        "https://housing.uic.edu/affiliate/",
        "https://housing.uic.edu/affiliate/guesthousing/",
        "https://housing.uic.edu/affiliate/medical/",
        "https://housing.uic.edu/affiliate/intern/",
        "https://housing.uic.edu/affiliate/conference/",
        "https://housing.uic.edu/workwithus/",
        "https://housing.uic.edu/workwithus/recruitment/",
        "https://housing.uic.edu/workwithus/jobs/",
        "https://housing.uic.edu/dates-to-know/",
        "https://housing.uic.edu/contact/",
        "https://apps.housing.uic.edu/dock/",
        "https://portal.housing.uic.edu/webpatron/",
        "http://connect.uic.edu/",
        "http://studentaffairs.uic.edu/",
        "http://maps.uic.edu/",
        "https://housing.uic.edu/learningareas/",
        "https://housing.uic.edu/llc/",
        "http://housing.uic.edu/residence-halls/courtyard/",
        "http://housing.uic.edu/residence-halls/james-stukel-towers/",
        "https://housing.uic.edu/halls/psr/",
        "http://go.uic.edu/dock",
        "http://go.uic.edu/mycontract",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}