{
    "url": "https://admissions.uic.edu/graduate-professional/requirements-deadlines/international-requirements",
    "title": "International Requirements | UIC Admissions",
    "text": [
        "Note that while official credentials are referenced, only a scanned photocopy of the documents is required to be uploaded to the application system for the purposes of application review. Official, attested and sealed credentials will be requested only from admitted students.",
        "The University of Illinois at Chicago reserves the right to request official credentials at any time during the application process if deemed necessary, and rescind any offer of admission made if discrepancies between unofficial and official credentials are found.",
        "Country:",
        "Academic Credentials Required:",
        "Academic Qualifications:",
        "English Proficiency Required?",
        "Review the requirements above for your country/territory to determine whether you meet qualifications for study at the Graduate level. An International Credential Evaluation Fee is assessed for the evaluation of international coursework. See the Academic Credentials section below for complete details.",
        "Required documentation:",
        "International applicants with U.S. coursework should refer to the Credentials section on the Domestic Requirements page.",
        "Review English proficiency requirements above for your country/territory to determine whether English proficiency requirements apply. See the English Proficiency section below for complete details.",
        "These are determined by program. See the program's website for complete details. Program requirements may include (but are not limited to) items such as:",
        "Please refer to the requirements per country/territory above to determine which credentials are needed in your case. For the purposes of application review, only a PDF copy of the credentials should be submitted online. Official, sealed credentials will be requested only from admitted applicants intending to enroll.",
        "A mandatory, non-refundable $50 International Credential Evaluation Fee is assessed for all graduate and professional degree-seeking applicants who have post-secondary coursework taken outside the United States.",
        "International applicants who have only U.S. coursework are not required to submit this fee. Study abroad coursework by U.S. students is excluded from this policy. The fee is assessed once per application term. Payment of the fee will be requested online through the application system.",
        "We understand that from the viewpoint of many countries, the word “transcript” is an American term. When the Office of Admissions asks you for transcripts, we are actually asking for a copy of your academic record which includes courses taken, course descriptions, credits earned or hours completed, and posted grades. The following academic records are always acceptable as “transcripts”:",
        "Some institutions (such as those in India, Pakistan, Bangladesh and Sri Lanka) provide a separate sheet for each year or semester which details the classes taken and marks achieved by a student. The following criteria are applied when the Office of Admissions reviews these credentials:",
        "The Office of Admissions requires proof of all degrees that a student has earned. This should be a copy of your diploma or degree award certificate. It should state the type of degree you were awarded, the fact that it was granted to you, and the date of conferment. See below for information on types of certificates accepted as proof of degree.",
        "The Office of Admissions requires literal, certified translations for all documents issued in a language other than English.",
        "When not officially provided by your prior university, we accept translations from the following:",
        "Translations should be on a translator’s letterhead and should be literal (not an interpretation or a paraphrasing).",
        "Plain translations, notarized translations, and translations done by someone other than a certified translator are not acceptable. Evaluations performed by agencies such as WES and ECE will not be used in place of certified translations.",
        "The supplement provides a description of the nature, level, context and status of the studies a student pursued and successfully completed.",
        "Applicants may be required to submit a syllabus or course descriptions if an academic credential does not provide enough detail about the courses taken. These items will usually provide a key for understanding the courses you have taken and will provide the highlights of that course's curriculum. These will be requested on a case-by-case basis.",
        "Valid English proficiency test scores must be submitted if required, based on the country or territory in which an applicant previously studied. Refer to the requirements for your country/territory above.",
        "The following are the only tests accepted at UIC as evidence of English proficiency. The Graduate College minimum scores* are indicated for each.",
        "*Note that departments may set higher minimums for consideration of admission to certain programs. Please refer to the program's requirements for additional information.",
        "Applicants with scores below the published minimums are not automatically denied. If recommended for admission by the program, these cases are referred to the Graduate College for additional approval.",
        "English proficiency test scores are considered valid for two years following the test date and must be valid at the time of application.",
        "*Note that it can take up to two weeks from the process/ship date for reported scores to be reflected as received within our application system.",
        "The English proficiency test requirement may be waived under the following circumstances, if the conditions have occurred within the last five years:",
        "English proficiency requirements are not waived based upon the medium of instruction at a previously attended institution. This includes attendance at a branch or campus of a US or UK institution which is physically located in a country or territory from which an English proficiency test is required.",
        "In certain cases where an applicant presents a strong academic profile but has sub-standard English proficiency test scores, the admitting program can offer the opportunity to enroll in an intensive English program prior to beginning study in the degree program. This is known as the Tutorium in Intensive English program (TIE). Note that this option is offered at the discretion of the admitting program. Programs may choose not to offer admission to the TIE.",
        "Applicants must still follow the standard application procedure and submit all requirements, including valid English proficiency test scores. UIC does not offer the option to defer submission of valid English proficiency test scores.",
        "The Tutorium in Intensive English (TIE) coordinates UIC’s intensive English instruction. Students enrolled in only intensive English instruction pay UIC fees and assessments for campus services and TIE tuition. As students transition to UIC standard instruction, students pay UIC tuition proportionate to the credit hours taken in standard UIC classes.",
        "UIC has a separate policy and English language assessment for admitted students who are offered assistantships. Under the Graduate College, the International Teaching Assistant Program (ITAP) administers the Oral Certification Interview (OCI) for prospective Teaching Assistants. Click here for information about the Illinois state law and UIC's policy on the spoken English requirements for non-native English-speaking Teaching Assistants.",
        "Department awards and financial assistance in the form Teaching Assistantships, Research Assistantships and Fellowships are awarded by the program.",
        "More information on financial support can be found on the Graduate College website.",
        "Contact your intended program to see what funding opportunities are available and whether you are being offered funding.",
        "Financial documents for visa processing are requested by the Office of International Services. Applicants may begin submitting OIS-requested documents online through the application system checklist during the application period, however, they do not need to be submitted until after an admission decision is made.",
        "OIS document requests and visa processing do not affect application review or admission decisions.",
        "Please see the website of the Office of International Services for additional details and contact them with inquiries about OIS document requests or financial documents you've submitted.",
        "If English translations were required, the original translations should also be submitted.",
        "From foreign institutions, copies of original credentials which have been attested by the university or college authority and sealed by the same individual will be considered as official. We understand that many universities only issue one set of final, original credentials. Please do not send originals to UIC, as received documents cannot be returned.",
        "Attestation:",
        "The university may issue the official credentials directly to UIC or to the student. As long as the seal is not broken, the credentials will be considered official.",
        "Documents may be considered unofficial for any of the following reasons:",
        "The University of Illinois at Chicago is pleased to share the Annual Security & Fire Safety Report with all prospective students. The report contains information regarding campus security and personal safety including topics such as: crime prevention, public safety authority, crime reporting policies, fire safety, disciplinary procedures, and fire statistics in UIC residential facilities and crime statistics for the three previous calendar years.  The full text of this report is available online at ready.uic.edu. If you would like to receive a copy on paper, visit the Office of Preparedness & Response, located at 1140 South Paulina Street, Suite 109, Chicago, IL 60612.",
        "1200 West Harrison Street",
        "Chicago, IL 60607-7161",
        "Phone: (312) 996-4350Contact UIC Admissions",
        "1220 West Harrison Street",
        "Chicago, IL 60607-7161",
        "Phone: (312) 413-1726",
        "Office of Undergraduate Admissions (MC 018)",
        "University of Illinois at Chicago",
        "1200 West Harrison Street, Suite 1100",
        "Chicago, IL 60607-7161 Contact Undergraduate Admissions",
        "",
        "The graduate and professional application process is paperless. Please do not mail materials unless expressly requested.Contact Graduate and Professional Admissions",
        "Copyright © 2020 The Board of Trustees of the University of Illinois"
    ],
    "out_links": [
        "https://admissions.uic.edu/",
        "https://admissions.uic.edu/explore-uic",
        "https://nexus.admissions.uic.edu/",
        "https://admissions.uic.edu/apply-now",
        "https://admissions.uic.edu/graduate-professional",
        "https://admissions.uic.edu/graduate-professional/requirements-deadlines",
        "https://admissions.uic.edu/graduate-professional/deadlines",
        "https://admissions.uic.edu/graduate-professional/apply",
        "https://admissions.uic.edu/graduate-professional/application-process/application-fee-waivers",
        "https://admissions.uic.edu/graduate-professional/requirements-deadlines/domestic-requirements",
        "https://catalog.uic.edu/gcat/degree-programs/grad-prof-degree-programs/",
        "https://tie.uic.edu/",
        "https://registrar.uic.edu/tuition/",
        "https://tie.uic.edu/apply/tuition-fees/",
        "https://ita.grad.uic.edu/oral-english-proficiency-testing/oral-english-proficiency-testing-process/",
        "https://ita.grad.uic.edu/oral-english-proficiency-testing/illinois-state-law-and-uics-policy/",
        "https://grad.uic.edu/funding-awards/",
        "https://www.ois.uic.edu/students/prospective/obtaining_an_initial_i-20__d_s-2019/",
        "https://admissions.uic.edu/graduate-professional/application-status",
        "https://www.ois.uic.edu/",
        "https://housing.uic.edu/halls/",
        "https://catalog.uic.edu/gcat/academic-calendar/",
        "https://go.uic.edu/CleryReport",
        "https://ready.uic.edu/",
        "https://admissions.uic.edu/undergraduate",
        "https://admissions.uic.edu/contact-admissions",
        "https://admissions.uic.edu/undergraduate/contact-undergraduate-admissions",
        "https://admissions.uic.edu/graduate-professional/contact-graduate-and-professional-admissions",
        "http://www.uic.edu/",
        "http://uic.edu/",
        "https://policies.uic.edu/uic-policy-library/access-and-equity/nondiscrimination-policy-statement/",
        "https://admissions.uic.edu/sitemap",
        "https://disabilityresources.uic.edu/",
        "https://admissions.uic.edu/Shibboleth.sso/Login?target=https%3A%2F%2Fadmissions.uic.edu%2F%3Fq%3Dshib_login%2Fnode%2F5",
        "http://disabilityresources.uic.edu/"
    ]
}