{
    "url": "https://cif.uic.edu/",
    "title": "UIC Chancellor's Innovation Fund",
    "text": [
        "The upcoming Fall 2019 Phase I CIF POC Awards Program will accept Pre-Proposal submissions between  Friday, July 12th and Friday, August 23rd at 5 p.m. CDT. The Pre-Proposal Review Committee will then review and select finalists from the pool of applicants. Finalists will meet with members of Illinois Ventures and the Office of Technology Management for a project planning meeting and mock pitches as they prepare for the full proposal submission in PowerPoint presentation format due Monday,  November 15th, 2019. Finally, the Phase I Program will culminate in a slide presentation to a panel of venture capitalists, business leaders, and industry experts on the Final Pitch Day where the awardees will be selected for funding. Awardees will be notified of the final decision in early December.",
        "UIC Chancellor's Innovation Fund Proof of Concept Awards Program Pre-Proposal Application Form",
        "Instructions for UIC Chancellor's Innovation Fund POC Awards Program Pre-Proposal",
        "August 23rd, 2019 -  Pre-Proposals Due",
        "Week of October 6th, 2019- POC Finalists Announced",
        "Week of December 8th, 2019 - Final Pitch Day",
        "Week of December 15th, 2019 - POC Winners Announced",
        "",
        "",
        "University of Illinois-Chicago announces $400K in grants from the UIC Chancellor’s Innovation Fund",
        "",
        "",
        "Awards brings research closer to commercialization",
        "",
        "",
        "University of Illinois At Chicago, IllinoisVentures Launches New $10M POC/Seed Funds",
        "",
        "",
        "University Of Illinois At Chicago (UIC) Writes Big Check For Startup Entrepreneurs",
        "",
        "UIC launches $10M seed fund to advance startups",
        "© Copyright 2018 UIC Chancellor's Innovation Fund",
        ""
    ],
    "out_links": [
        "https://cif.uic.edu/projects.html",
        "https://cif.uic.edu/contacts.html",
        "https://news.uic.edu/awards-put-research-a-step-closer-to-commercialization",
        "http://www.uic.edu/index.html/Chancellor/",
        "http://otm.uic.edu/"
    ]
}