{
    "url": "https://today.uic.edu/uic-gets-12m-to-continue-largest-study-of-latinos",
    "title": "UIC gets $12M to continue largest study of Latinos | UIC Today",
    "text": [
        "“This study is crucial because Hispanics/Latinos now comprise the largest minority population in the United States, and we need to know more about their unique health risks so that we can educate the community and prevent cardiovascular and other chronic diseases in this population as it ages,” said Dr. Martha Daviglus, director of UIC’s Institute for Minority Health Research and principal investigator for the HCHS/SOL Chicago field center.",
        "The multi-site study, which started in 2008, collected information on health issues, risk factors and lifestyle habits from 16,415 adults ages 18-74 living in Chicago, San Diego, Miami and the Bronx. Participants self-identified as being of Central American, Cuban, Dominican, Mexican, Puerto Rican, South American or “other” Hispanic/Latino background. Data was collected from 4,136 participants from Chicago during phase I of the study, which lasted from 2008 to 2011.",
        "En Espanol.",
        "In the first phase of the study, participants underwent an extensive seven- to eight-hour baseline exam and answered questionnaires about their health and lifestyle factors. Phase I of the study revealed the sizeable burden of risk factors experienced by this diverse population: for example, about 17 percent of Hispanic/Latino men and women had diabetes, and about 37 percent of men and 43 percent of women were obese. About 80 percent of men and 71 percent of women had at least one risk factor for cardiovascular disease.",
        "In the study’s second phase, which ended in 2018, researchers reexamined 11,621 of the participants and collected data on chronic diseases that are prevalent in Hispanics/Latinos, including heart disease, diabetes, asthma, chronic obstructive pulmonary disease and gestational diabetes. Participants completed questionnaires on demographic, sociocultural and lifestyle factors. Genetic analysis was also performed.",
        "The new funding will support phase III of the study, which will last through 2025. Researchers are aiming to bring back at least 80 percent of surviving participants for a two-hour follow-up examination that will assess changes in lifestyle factors such as smoking, diet, and exercise; identify any new risk factors or diagnoses; and ascertain the influence of acculturation to American society. Researchers will use the follow-up data to identify associations between lifestyle and other characteristics at baseline with the development of cardiovascular disease and other health outcomes.",
        "With the data that are collected during phase III, detailed health information will be available on Hispanic/Latino participants going back more than 10 years. This will allow researchers to look at changes in health risks over time and in relation to changes in lifestyle factors. Daviglus explained that the information collected could help shed light on the “Hispanic paradox” — for example, the observation that Hispanic/Latino individuals in the U.S. tend to live longer than whites despite their overall low socioeconomic status and high rates of obesity and diabetes.",
        "“With phase III, we believe that enough time will have passed since we first examined some of these participants, that data will emerge indicating whether the ‘Hispanic paradox’ really exists and if so, what are the factors driving it,” Daviglus said.",
        "At the Chicago site, two additional NIH-funded studies involving HCHS/SOL participants will be conducted during phase III. One study will examine whether physical activity habits predict peripheral artery disease, a circulatory condition in which narrowed blood vessels reduce blood flow to the limbs. This affects approximately 10 million adults in the U.S. and can increase the risk of death and leg amputation. Participants will be recruited to undergo evaluation of lower extremity blood vessels and fitness tests and will be given accelerometers (devices that measure motion and are often worn as bracelets) to measure activity over the course of several days.",
        "The other study aims to identify modifiable risk factors that contribute to Alzheimer’s disease and dementia. Previous studies have linked stiffening of the arteries with alterations in the brain that contribute to cognitive impairment, but these did not include Hispanics/Latinos. During the phase III follow-up visit, HCHS/SOL participants will be evaluated for stiffening of the arteries and will undergo cognitive testing designed to detect impairment or Alzheimer’s disease.",
        "Dr. James Lash is a co-principal investigator at the HCHS/SOL Chicago field center. Maria Argos, Dr. Mayank Kansal, Dr. Fernando Testai at UIC are co-investigators. Ramon Durazo-Arvizu, Dr. Richard Cooper and Dr. Majid Afshar are consultants on the project.",
        "",
        "",
        "Contact",
        "",
        "Sharon Parmet",
        "312-413-2695",
        "sparmet@uic.edu",
        "",
        "",
        "",
        "Categories",
        "",
        "Featured Academic Research, Health Sciences Colleges, Research",
        "",
        "",
        "Sharon Parmet",
        "312-413-2695",
        "sparmet@uic.edu",
        "",
        "Categories",
        "",
        "Featured Academic Research, Health Sciences Colleges, Research",
        "Topics",
        "HCHS/SOL, Hispanic Health, Hispanic Health Study"
    ],
    "out_links": [
        "http://uic.edu/",
        "https://today.uic.edu/",
        "https://today.uic.edu/campus-news",
        "https://today.uic.edu/academics-research",
        "https://today.uic.edu/events",
        "https://today.uic.edu/resources",
        "https://today.uic.edu/resources/current-students",
        "https://today.uic.edu/resources/faculty-staff",
        "https://today.uic.edu/resources/photo-video-policies",
        "https://today.uic.edu/resources/social-media-inquiry-form",
        "https://today.uic.edu/uic-social-media-guidelines-and-best-practices",
        "https://today.uic.edu/coronavirus",
        "https://today.uic.edu/frequently-asked-questions",
        "https://today.uic.edu/what-you-need-to-know-about-covid-19",
        "https://today.uic.edu/support-for-the-uic-community",
        "https://today.uic.edu/teaching-learning-and-working-resources",
        "https://today.uic.edu/in-the-news-covid-19",
        "https://today.uic.edu/contact",
        "https://today.uic.edu/contact/communicating-on-campus",
        "https://today.uic.edu/contact/communicating-on-campus/sending-massmails-dddh",
        "https://today.uic.edu/contact/social-media-directory",
        "https://today.uic.edu/?p=72940&preview=true&preview_id=72940",
        "https://today.uic.edu/author/sparmet",
        "https://today.uic.edu/category/featured-acadresearch",
        "https://today.uic.edu/category/hsc",
        "https://today.uic.edu/category/category-research",
        "https://today.uic.edu/tag/hchs-sol",
        "https://today.uic.edu/tag/hispanic-health",
        "https://today.uic.edu/tag/hispanic-health-study",
        "https://today.uic.edu/campus-news/campus-newspaper/subscribe-to-uic-today",
        "https://today.uic.edu/news-release/news-release/",
        "https://today.uic.edu/experts-guide",
        "https://today.uic.edu/contact/communicating-on-campus/submit-announcements",
        "https://today.uic.edu/submit-an-event",
        "http://catalog.uic.edu/ucat/academic-calendar/",
        "http://www.uic.edu/apps/departments-az/search",
        "http://disabilityresources.uic.edu/",
        "http://emergency.uic.edu/",
        "http://events.uic.edu/",
        "http://uic.edu/about/job-opportunities",
        "http://library.uic.edu/",
        "http://maps.uic.edu/",
        "http://dos.uic.edu/studentveteranaffairs.shtml"
    ]
}