{
    "url": "https://cpsj.uic.edu/",
    "title": "Center for Public Safety and Justice (CPSJ) | University of Illinois at Chicago",
    "text": [
        "The Center for Public Safety and Justice (CPSJ) at UIC has transferred operations to the University of Illinois at Springfield.",
        "CPSJ was founded in 1997 as one of the original Regional Community Policing Institutes created through the establishment of the Office of Community Oriented Policing Services within the U.S. Department of Justice. The original charge of CPSJ was to expand the understanding and application of community policing and problem-solving techniques used by law enforcement agencies and the communities they serve. CPSJ honored its origins in community policing through its portfolio of training, services and research projects to further this mission. For more than two decades its staff brought unique insight into the culture of law enforcement, including operations and organizational structure. CPSJ fostered organizational change and transformation through quality training, technical assistance, and the use of innovative approaches to problem-solving to create safe and livable communities.",
        "For questions regarding the work, projects, or research of CPSJ, please contact Charlene Moe at cedmi1@uis.edu. Additionally, state and federal agencies can be contacted directly for access to the many training programs, publications and projects completed by CPSJ on their behalf."
    ],
    "out_links": [
        "http://uic.edu/",
        "https://cpsj.uic.edu/resources/",
        "http://cuppa.uic.edu/",
        "http://maps.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}