{
    "url": "https://careerservices.uic.edu/students/jobs/",
    "title": "Jobs | Career Services | University of Illinois at Chicago",
    "text": [
        "",
        "There is no magic date or time for when an individual should start their job search, but it may take recent graduates at least a few months and many hours to land a job. Most individuals have to apply to many positions and build their professional networks to land a great job.  In addition, take note of the industry to which you are applying because particular industries may do more hiring during certain times of the year.",
        "Get ideas and resources for your job search.",
        "Determine the type of organization you want to work at and what type of role within the organization you want to explore. You will be much more successful if you are targeted in your search versus applying to every job you see.",
        "Applicants should never rely ONLY on the Internet to find a position. It should be a part of your job searching strategy, not your only strategy.  Visit the Connect with Employers section on this page for additional ways to find job opportunities.",
        "Use your network of friends, professors, family members, high school teachers and anyone else you know to discover organizations in your field and potential contacts within them. Read more about how to strengthen your networking skills by visiting the Networking page. You can also network and look for opportunities at upcoming career events where employers often have both internship and full-time opportunities.",
        "Both are important tools to communicate your strengths and how you will be an asset to a potential employer.  Visit the Resumes, CVs, and Cover Letters page for tips and resources.",
        "Make an appointment or stop in at Career Services drop-in hours with a Career Services advisor in our office to discuss your career goals, narrow your options, and/or help you polish your resume/cover letter. If your college has a career center, you can visit it to learn more about jobs related to your field of study and obtain other help.",
        "MyVisaJobs.com assists international students in identifying employers who are offering sponsorship opportunities and applying directly for positions with those employers.  Based on a user’s profile and settings, MyVisaJobs.com recommends positions.  Note:  This is an external resource and not affiliated with UIC.",
        "For questions or concerns, please contact MyVisaJobs.com.",
        "Attending career fairs is a great way to meet a variety of recruiters actively seeking candidates for open positions at their companies and organizations. Students have the opportunity to briefly introduce themselves and share how they might fit a position, as well as learn more about prospective employers.  Read our tips (including a few short videos) to learn how to navigate Career Fairs.",
        "Many employers choose to interview UIC students on campus for various positions. You can view and sign up for upcoming interviews that you qualify for by logging into UICcareers.com, then under Shortcuts click on Campus Interviews I Qualify For.",
        "UIC students can attend an employer information session to learn about a particular employer in depth and the positions the employer is seeking to fill.",
        "Information Sessions generally take place in a lecture room at Student Center East and you can RSVP to an information session by logging into UICcareers.com, clicking on Events/ Info Sessions/ Workshops, and selecting Informational Sessions.",
        "Some employers host information tables at Student Center East and are often advertised in the Announcements section of UICcareers.com.  Information tables are an opportunity for students to meet recruiters face-to-face and learn more about employers as well as job opportunities.",
        "You should carefully consider the offer and take your time to think through whether the job is a good fit for you. If you accept the offer then the employer will expect you to honor the acceptance and take the position.",
        "Questions you may want to consider:",
        "At any time if you would like to discuss a job offer, please make an appointment to meet with or speak to a Career Advisor.",
        "Before you decide if you should negotiate the salary offer, you should research the average salary for similar positions, degree, industry, geographic region, and size of the employer. Many factors play a role when salaries are determined. Helpful salary resources are listed below.",
        "Some job offers are not negotiable, and given the competitive job market and your field, it may not be wise to ask about negotiating. However, if you feel that you need to negotiate, consult with a Career Services Advisor.",
        "When accepting an offer, it is crucial to accept an offer in writing—restating your interest and the job offer.  Any offer – verbal or written – should only be given if you plan to honor the acceptance.",
        "Recommended Actions:",
        "Recommended Actions:",
        "If you feel you need additional time to decide whether to accept an offer, you can consider asking the employer for additional time.  Generally, employers will not withdraw an offer when applicants request additional time, but it is crucial to let the employer know how interested you are, and to be prepared to explain why you need additional time to make a decision. It is possible that some employers may not be willing to extend the deadline and you may need to make a decision.",
        "There are several self-study online modules available to current UIC students on Blackboard.  Each online module takes less than 10 minutes to complete.  Note:  Students will need to register for the Career Readiness 101 online course on Blackboard to access the course (non-credit)."
    ],
    "out_links": [
        "https://careerservices.uic.edu/",
        "http://uic.edu/",
        "https://careerservices.uic.edu/about-us/",
        "https://careerservices.uic.edu/about-us/hours/",
        "https://careerservices.uic.edu/about-us/our-services/",
        "https://careerservices.uic.edu/about-us/hours/contact-us/",
        "https://careerservices.uic.edu/about-us/staff-directory-2/",
        "https://careerservices.uic.edu/about-us/other-career-centers/",
        "https://careerservices.uic.edu/about-us/newsletters/",
        "https://careerservices.uic.edu/about-us/frequently-asked-questions/",
        "https://careerservices.uic.edu/students/",
        "https://careerservices.uic.edu/students/career-programs-events/",
        "https://careerservices.uic.edu/students/career-advising/",
        "https://careerservices.uic.edu/students/career-exploration/",
        "https://careerservices.uic.edu/students/resumes-cvs-cover-letters/",
        "https://careerservices.uic.edu/students/interviews/",
        "https://careerservices.uic.edu/students/internships/",
        "https://careerservices.uic.edu/students/networking/",
        "https://careerservices.uic.edu/students/student-success-stories/",
        "https://careerservices.uic.edu/employers/",
        "https://careerservices.uic.edu/employers/post-a-position/",
        "https://careerservices.uic.edu/career-job-fairs-information-employers/",
        "https://careerservices.uic.edu/employers/on-campus-interviews-2/",
        "https://careerservices.uic.edu/employers/information-tables-sessions/",
        "https://careerservices.uic.edu/employers/employer-partner-program-2/",
        "https://careerservices.uic.edu/employers/additional-outreach-student-engagement-opportunities/",
        "https://careerservices.uic.edu/employers/directions-hotels/",
        "https://careerservices.uic.edu/campus-partners/",
        "https://careerservices.uic.edu/campus-partners/career-services-workshoppresentation-request-form/",
        "https://careerservices.uic.edu/alumni/",
        "https://careerservices.uic.edu/most-popular/",
        "https://careerservices.uic.edu/students/career-education-resources/",
        "http://studentemployment.uic.edu/",
        "http://connect.uic.edu/",
        "http://studentaffairs.uic.edu/",
        "http://maps.uic.edu/",
        "https://studentemployment.uic.edu/",
        "https://careerservices.uic.edu/upcoming-career-events-2/",
        "https://careerservices.uic.edu/most-popular/career-fair-tips/",
        "http://careerservices.uic.edu/students/networking/",
        "https://careerservices.uic.edu/upcoming-career-events/",
        "http://careerservices.uic.edu/about-us/hours/",
        "https://careerservices.uic.edu/students/student-success-stories/graduate-outcomes/",
        "https://careerservices.uic.edu/students/student-success-stories/journey-success-nomination-form/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}