{
    "url": "https://today.uic.edu/loluic-brings-laughs-to-uic-forum",
    "title": "LOL@UIC brings laughs to UIC Forum | UIC Today",
    "text": [
        "With no network suits or pestering TMZ journalists lurking, comedian Leslie Jones told the UIC community she felt free during her “LOL@UIC” performance Jan. 26.",
        "Jones, a “Saturday Night Live” cast member and writer, demonstrated that liberation with an hour-long stand-up routine that featured everything from a hilariously uncomfortable Prince encounter to playing matchmaker with students. The result: a memorable show that had the crowd rolling.",
        "“The highlight of the show in my opinion was just hearing all the laughter throughout,” event lead Sunil Dommaraju said. “It was refreshing to hear such a loud roar every time a great joke was made.”",
        "“Saturday Night Live” comedian Leslie Jones performs at the UIC Forum. (Photo: Troy Heinzeroth)",
        "“LOL@UIC,” presented by UIC’s Student Activities Board, offered students, faculty and staff an opportunity to see first-rate comedy for free. They took advantage by packing the UIC Forum to see a smoothly run presentation.",
        "“I think it went really well,” Dommaraju said. “The show started on time. The artists transitioned nicely. The show was hilarious. A lot of people came to the event as well, which is always great.”",
        "Jones received the loudest chuckles when talking about her own promiscuous lifestyle and venturing into the crowd to tease certain audience members. It was all in good spirit, as the 49-year-old comedian seemed genuinely elated to return to stand-up comedy.",
        "“Without a doubt, my favorite part of the event was when Leslie Jones came down from the stage and started walking through the crowd and interacting with UIC students,” said Almasa Pecanin, president of UIC’s Student Activities Board. “There were students standing up from their seats to see who she was speaking to and if it was someone they know. There were also students trying to get Leslie’s attention so they can be the next ones she talked to.",
        "“I thought that was so funny, and must have been such a crazy experience for the students who had a chance to interact with her.”",
        "The event wasn’t all about Jones, though. Opener Jon Laster did more than just warm up the crowd. Laster questioned the audience on majors, class status and partying habits, then built brilliantly humorous responses off their answers. He also put a unique spin on racial quips, accentuating tendencies of white women to overly rely on their fathers.",
        "“I didn’t expect to laugh as much as I did,” said David Pisanski, a senior in computer engineering. “I thought Jon Laster’s opening act was hilarious, especially his girls and their dads bit.”",
        "At the end of the show, Pisanski and other students in attendance left with a wide grin.",
        "“This was my first time going to LOL,” Pisanski said. “I’m happy they were able to organize such a fun and free event for students. Looking back, I wish I went to the ones I missed.”",
        "“I think during difficult times, it’s important to find a positive outlet to release your tension and anxieties,” Pecanin added. “Leslie addressed issues in society, college life, and other things in a comedic tone, so students would be able to laugh about them rather than letting them consume their thoughts.”",
        "",
        "",
        "Contact",
        "",
        "Tim Goldrick",
        "",
        "tgoldr2@uic.edu",
        "",
        "",
        "",
        "Categories",
        "",
        "Campus",
        "",
        "",
        "Tim Goldrick",
        "",
        "tgoldr2@uic.edu",
        "",
        "Categories",
        "",
        "Campus",
        "Topics",
        "LOL, LOL@UIC, Student Activities Board"
    ],
    "out_links": [
        "http://uic.edu/",
        "https://today.uic.edu/",
        "https://today.uic.edu/campus-news",
        "https://today.uic.edu/academics-research",
        "https://today.uic.edu/events",
        "https://today.uic.edu/resources",
        "https://today.uic.edu/resources/current-students",
        "https://today.uic.edu/resources/faculty-staff",
        "https://today.uic.edu/resources/photo-video-policies",
        "https://today.uic.edu/resources/social-media-inquiry-form",
        "https://today.uic.edu/uic-social-media-guidelines-and-best-practices",
        "https://today.uic.edu/coronavirus",
        "https://today.uic.edu/frequently-asked-questions",
        "https://today.uic.edu/what-you-need-to-know-about-covid-19",
        "https://today.uic.edu/support-for-the-uic-community",
        "https://today.uic.edu/teaching-learning-and-working-resources",
        "https://today.uic.edu/in-the-news-covid-19",
        "https://today.uic.edu/contact",
        "https://today.uic.edu/contact/communicating-on-campus",
        "https://today.uic.edu/contact/communicating-on-campus/sending-massmails-dddh",
        "https://today.uic.edu/contact/social-media-directory",
        "https://today.uic.edu/author/tgoldr2",
        "https://today.uic.edu/category/category-campus",
        "https://today.uic.edu/tag/lol",
        "https://today.uic.edu/tag/loluic",
        "https://today.uic.edu/tag/student-activities-board",
        "https://today.uic.edu/campus-news/campus-newspaper/subscribe-to-uic-today",
        "https://today.uic.edu/news-release/news-release/",
        "https://today.uic.edu/experts-guide",
        "https://today.uic.edu/contact/communicating-on-campus/submit-announcements",
        "https://today.uic.edu/submit-an-event",
        "http://catalog.uic.edu/ucat/academic-calendar/",
        "http://www.uic.edu/apps/departments-az/search",
        "http://disabilityresources.uic.edu/",
        "http://emergency.uic.edu/",
        "http://events.uic.edu/",
        "http://uic.edu/about/job-opportunities",
        "http://library.uic.edu/",
        "http://maps.uic.edu/",
        "http://dos.uic.edu/studentveteranaffairs.shtml"
    ]
}