{
    "url": "https://www.uic.edu/chicago/city-transportation/",
    "title": "University of Illinois at Chicago",
    "text": [
        "Always Active",
        "UIC is easy to reach from virtually anywhere",
        "Campus is readily accessible by car, train, plane, bus, bike or on foot. Located just west of the Loop, University of Illinois at Chicago provides access to a vast network of expressways, parking, public transit and other transportation options. Take advantage of the CTA, Metra, bike and car sharing programs to save money and reduce stress.",
        "Chicago is accessible via several major interstates and highways including I-90 (Kennedy Expressway), I-94 (Dan Ryan Expressway), I-55 (Stevenson Expressway), I-290 (Eisenhower Expressway), and I-294 (Tri-State Tollway).",
        "",
        "UIC is served by both CTA buses and trains, with “L” train Blue Line (UIC-Halsted and Racine stops) and the Pink Line (Polk stop), connecting the campus with downtown Chicago, O’Hare International Airport, Midway International Airport, the historic neighborhoods of Chicago, and the western suburbs.",
        "The CTA Ventra U-PASS is available to eligible students during enrolled terms and provides unlimited use of CTA trains and buses during the semester. Distribution for new students is conducted in the Student Services Building.",
        "Pace Suburban Bus transports commuters throughout the suburbs and operates an express route (Route 755 Plainfield – IMD Express) between Plainfield, Bolingbrook and the UIC campus and Illinois Medical District during weekday rush hours.",
        "Metra is the commuter rail agency serving Cook, DuPage, Will, Lake, Kane and McHenry counties in the Chicago area. It is the sister agency to the CTA, which provides mass transit rail (the “L”) and bus service to Chicago and some suburbs, and Pace, which provides bus service primarily in the suburbs.",
        "For convenient commuting, Metra serves more than 100 communities with 241 stations on 11 lines running from Chicago’s downtown. Click the online system map to see route and station locations. Trains run frequently during weekday rush hours and about every hour during off-peak times. They also operate on weekends on most lines. Click the maps & schedules link for more information.",
        "UIC’s location puts it well within the city’s ever-expanding bike infrastructure. Our campus is recognized as a Bike Friendly University by the League of American Bicyclists. The BFU program acknowledges institutions of higher education for promoting and providing a more bikeable campus for students, staff, and visitors.",
        "Don’t have a bike?  No problem! Divvy is a bike sharing system that offers Chicagoans and visitors more options for getting around the city. The Divvy bike share system has thousands of bikes available and more than 580 stations across the region, and provides yet another transportation option for getting around town. UIC students, faculty and staff are eligible for a discount off annual membership costs!",
        "To make cycling even more convenient, the CTA welcomes bicycles on trains and buses throughout the year.",
        "Campus Parking Services provides safe, convenient and affordable parking options for vehicles on campus:",
        "",
        "Zipcar and Enterprise CarShare carsharing services provide a convenient, affordable and reliable transportation alternative without owning a car.",
        "These are membership systems in which users set up on-demand, short-term car rentals based on a set rate. That rate includes all transportation costs such as fuel, insurance and overnight parking fees.",
        "UIC students, staff and faculty can become members at a special discounted rate, and take advantage of Zipcar vehicles parked on the campus. Zipcars are available throughout Chicago.",
        "Enterprise CarShare (formerly I-GO Car Sharing) is a car-sharing service based in Chicago. The UIC community is also eligible for a discount, and many Enterprise CarShare vehicles are on or near the UIC campus.",
        "If you drive your own car, there are ways to share your car through carpooling and app-based car share technologies.",
        "Getaround.com is a free on demand peer-to-peer carsharing service that connects car owners with car renters allowing others to pay you to use your car when you are not.",
        "Pace RideShare is a free carpool and vanpool matching service for the greater Chicagoland area.",
        "Taxis are plentiful and offer a convenient way to get around the city. Credit cards are accepted in all cabs by city mandate. Taxi service to UIC is available from both airports.",
        "Uber and Lyft connect riders to drivers through apps, which make cities more accessible, opening up more possibilities for riders.",
        "For affordable connections between Chicago’s top tourist destinations, Chicago Water Taxi and Shoreline Water Taxi are a convenient transportation.",
        "Greyhound is the largest provider of intercity bus transportation serving more than 3,800 destinations across North America. The Chicago Greyhound station is on Harrison Street just two blocks east of the campus.",
        "Two major airports serve the Chicago area, O’Hare International Airport, one of the largest airports in the world, and Midway International Airport. O’Hare is located northwest of Chicago, and Midway is located on the South Side of Chicago.",
        "There are several ways to reach campus from either airport.  You may opt to take a taxi, bus, or train (also known as the “L”), GO Airport Express, or rental car.",
        "GO Airport Express provides shared ride services to all downtown/suburban hotels and many businesses.",
        "Many major car rental companies have facilities at the O’Hare and Midway Airports. Visit specific rental company websites for details."
    ],
    "out_links": [
        "http://maps.uic.edu/",
        "http://www.uic.edu/apps/departments-az/search",
        "https://www.uic.edu/about/contact-us/",
        "http://library.uic.edu/",
        "http://oge.uic.edu/",
        "https://today.uic.edu/resources/current-students",
        "https://today.uic.edu/resources/faculty-staff",
        "https://uihealth.uic.edu/",
        "https://give.uic.edu/",
        "https://www.uic.edu/",
        "https://www.uic.edu/admissions-aid/",
        "https://www.uic.edu/admissions-aid/visit-campus/",
        "https://www.uic.edu/admissions-aid/paying-for-college/",
        "https://www.uic.edu/academics/",
        "https://www.uic.edu/academics/programs-of-study/",
        "https://www.uic.edu/academics/colleges-schools/",
        "https://www.uic.edu/academics/student-support/",
        "https://www.uic.edu/research/",
        "https://www.uic.edu/research/research-impact/",
        "https://www.uic.edu/research/research-strengths/",
        "https://www.uic.edu/research/resources-facilities/",
        "https://www.uic.edu/research/student-research/",
        "https://www.uic.edu/life-at-uic/",
        "https://www.uic.edu/life-at-uic/living-on-around-campus/",
        "https://www.uic.edu/life-at-uic/campus-resources/",
        "https://www.uic.edu/chicago/",
        "https://www.uic.edu/chicago/exploring-chicago/",
        "https://www.uic.edu/chicago/essential-chicago/",
        "https://www.uic.edu/alumni/",
        "https://www.uic.edu/about/",
        "https://www.uic.edu/about/visit-directions/",
        "https://www.uic.edu/about/history/",
        "https://www.uic.edu/about/leadership/",
        "https://www.uic.edu/about/public-media-resources/",
        "https://www.uic.edu/about/job-opportunities/",
        "https://www.uic.edu/about/acerca/",
        "https://www.uic.edu/chicago",
        "https://www.uic.edu/chicago/city-transportation",
        "https://idcenter.uic.edu/cta-u-pass/about-u-pass/",
        "https://sustainability.uic.edu/green-campus/bikes/",
        "http://sustainability.uic.edu/campus-resources/transportation/bicycling/",
        "https://parking.uic.edu/",
        "https://parking.uic.edu/application/",
        "https://parking.uic.edu/facilities/",
        "https://accc.uic.edu/service/g-suite",
        "https://my.uic.edu/",
        "https://outlook.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "http://catalog.uic.edu/ucat/academic-calendar/",
        "http://events.uic.edu/",
        "http://today.uic.edu/",
        "http://clery.uic.edu/",
        "http://oae.uic.edu/UnlawfulDiscrimination/index.htm",
        "http://oae.uic.edu/sexual-misconduct/",
        "http://financialaid.uic.edu/consumer-information/department-education-complaint-process/",
        "http://disabilityresources.uic.edu/",
        "http://emergency.uic.edu/",
        "https://maps.uic.edu/",
        "http://www.uic.edu/depts/dos/studentveteranaffairs.shtml",
        "http://admissions.uic.edu/visit-us",
        "http://admissions.uic.edu/undergraduate/request-information",
        "http://admissions.uic.edu/apply-now",
        "http://advance.uic.edu/alumni-association/",
        "https://news.uic.edu/social-media-directory"
    ]
}