{
    "url": "https://today.uic.edu/support-for-the-uic-community",
    "title": "Support for the UIC community (COVID-19) | UIC Today",
    "text": [
        "Campus Advocacy Network at the Women’s Leadership and Resource Center",
        "The Campus Advocacy Network will continue to serve UIC students, faculty, and staff. The center’s confidential advocate is available for virtual appointments. To schedule a meeting or request more information, please email can-appointment@uic.edu or call (312) 413-8206. For more details and resources, visit the center’s website.",
        "Counseling Center/Managing Anxiety and Fear about the Coronavirus",
        "The Counseling Center is no longer open for face-to-face appointments and is now functioning entirely remotely. You may still call the center at (312) 996-3490 during current business hours (9 a.m. – 5 p.m.) to schedule an appointment or to contact a counselor. If calling after hours, press 2 to be connected to a crisis counselor. Please refer to the center’s website for resources and updates.",
        "The Counseling Center staff has compiled both general ideas",
        "for coping with stress related to COVID-19, as well as situation-specific",
        "suggestions. These tips are available online.",
        "",
        "Dean of Students Office",
        "The Office of the Dean of Students and its staff remain available to assist you via phone and internet. To arrange a virtual meeting, call (312) 996-4857 or email dos@uic.edu.",
        "Employee Assistance Program",
        "Clinical Employee Assistance Services is a confidential counseling resource that specializes in working with employees and their family members who are experiencing personal problem(s) that may be affecting the employee’s job performance. The assistance program is available to help clarify issues, identify resources and offer follow-up assistance as needed.",
        "Office of Diversity",
        "The Office of Diversity is in solidarity with all our campus community, and people in every community and country experiencing this global health crisis. The office has created “Singing from Balconies,” a space where UIC students, faculty and staff can share their thoughts and learn from each other by writing about how they have experienced this change and how it is impacting them, their families and communities.",
        "In partnership with the Dean of Students, the Office of Diversity has also developed a list of COVID Resources for Students and COVID-19 Resources for Undocumented Students.",
        "Office of International Services",
        "The Office of International Services provides information regarding coronavirus for the UIC international community as it relates to immigration status, travel guidance, support resources, frequently asked questions (FAQs) and more.",
        "Student Health at University Village",
        "All UIC students pay a Student Services Fee, and this fee pays for access to preventive and acute healthcare services provided by the Department of Family Medicine at their Maxwell Street clinic at no additional charge. The Student Services Fee does not cover all visits to Family Medicine.",
        "Student Leadership and Civic Engagement – COVID-19 Service and Volunteer Opportunities",
        "There are several ways for the UIC community to get involved, volunteer, and make an impact during COVID-19. Visit the SLCE website for resources and opportunities to serve in person or from home during this time.",
        "University Health Service (for employees)",
        "UI Health Services provides occupational health services for the University of Illinois Hospital & Health Sciences System employees, the University of Illinois employees, volunteers, and students (if exposed or injured as part of the student curriculum). For more information or to schedule an appointment, call (312) 996-7420 or the UI Health website.",
        "U and I Care program, Office of Student Affairs",
        "The U and I Care Network is dedicated to the success of all UIC students and is able to provide resources and support as students navigate through personal challenges and hardships.",
        "Wellness Center",
        "Information about how to keep yourself healthy and well during this challenging time, the UIC Wellness Center has several tips and tools to assist you."
    ],
    "out_links": [
        "http://uic.edu/",
        "https://today.uic.edu/",
        "https://today.uic.edu/campus-news",
        "https://today.uic.edu/academics-research",
        "https://today.uic.edu/events",
        "https://today.uic.edu/resources",
        "https://today.uic.edu/resources/current-students",
        "https://today.uic.edu/resources/faculty-staff",
        "https://today.uic.edu/resources/photo-video-policies",
        "https://today.uic.edu/resources/social-media-inquiry-form",
        "https://today.uic.edu/uic-social-media-guidelines-and-best-practices",
        "https://today.uic.edu/coronavirus",
        "https://today.uic.edu/frequently-asked-questions",
        "https://today.uic.edu/what-you-need-to-know-about-covid-19",
        "https://today.uic.edu/teaching-learning-and-working-resources",
        "https://today.uic.edu/in-the-news-covid-19",
        "https://today.uic.edu/contact",
        "https://today.uic.edu/contact/communicating-on-campus",
        "https://today.uic.edu/contact/communicating-on-campus/sending-massmails-dddh",
        "https://today.uic.edu/contact/social-media-directory",
        "https://wlrc.uic.edu/",
        "https://counseling.uic.edu/",
        "https://counseling.uic.edu/news-stories/response-to-coronavirus/",
        "https://counseling.uic.edu/news-stories/coping-with-stress-related-to-covid-19/",
        "https://dos.uic.edu/",
        "http://diversity.uic.edu/",
        "https://diversity.uic.edu/singing-from-balconies-covid-19-quarantine-testimonials/",
        "https://www.ois.uic.edu/",
        "http://go.uic.edu/covid19-opportunities",
        "https://dos.uic.edu/student-assistance/uicare/",
        "https://wellnesscenter.uic.edu/",
        "https://today.uic.edu/campus-news/campus-newspaper/subscribe-to-uic-today",
        "https://today.uic.edu/news-release/news-release/",
        "https://today.uic.edu/experts-guide",
        "https://today.uic.edu/contact/communicating-on-campus/submit-announcements",
        "https://today.uic.edu/submit-an-event",
        "http://catalog.uic.edu/ucat/academic-calendar/",
        "http://www.uic.edu/apps/departments-az/search",
        "http://disabilityresources.uic.edu/",
        "http://emergency.uic.edu/",
        "http://events.uic.edu/",
        "http://uic.edu/about/job-opportunities",
        "http://library.uic.edu/",
        "http://maps.uic.edu/",
        "http://dos.uic.edu/studentveteranaffairs.shtml"
    ]
}