{
    "url": "https://innovation.uic.edu/",
    "title": "Office of the Vice Chancellor for Innovation | University of Illinois at Chicago",
    "text": [
        "Officials at the University of Illinois at Chicago, the University of Illinois System and public health officials locally and nationally, are closely monitoring an outbreak of respiratory illness caused by a novel (new) coronavirus, named COVID-19.",
        "UIC has created a central webpage to bring the latest news and information about COVID-19 to the campus community. Use the link below to stay informed.",
        "UIC is a hub of innovation and cutting-edge research with a national and international reputation, providing an expansive education and healthcare enterprise in Chicago and throughout Illinois. The Office of the Vice Chancellor for Innovation was created to organize UIC’s innovation and commercialization portfolio under one office. We support an infrastructure that allows our faculty, staff and students to innovate in the lab, classroom and beyond. OVCI is focused on creating initiatives across the university that support technology commercialization, entrepreneurship, and collaboration with the private sector.",
        "Leveraging IT infrastructure",
        "A scalable, agile IT infrastructure is needed to leverage shared technology solutions to drive innovation. ACCC provides innovative technology to enrich the academic experience for students and support UIC researchers. ACCC also offers central computer support for the campus community.",
        "Supporting tech transfer",
        "UIC is a leader in generating innovations that positively impact human lives and economic well-being. We work closely with the Office of Technology Management to support initiatives that ensure research is successfully transferred outside of the university to drive economic growth and benefit the general public.",
        "Fostering entrepreneurship",
        "At UIC, innovative thinking is inspired and nurtured. We are working collaboratively to foster a culture of entrepreneurship by encouraging relevant initiatives across the university that support students and faculty seeking to make a difference in society through startups, social entrepreneurship, and other ventures of their own creation.",
        "Encouraging collaboration",
        "We are developing new strategic partnerships with the private sector that support research and academic programs, enable faculty and students to exchange ideas with the very best minds inside and outside of the university, help prepare students for the rapidly changing job market, and provide opportunities to commercialize university innovations.",
        "Advancing online learning",
        "We are helping students of all ages to strengthen current skills and acquire new skills they need to further their careers through UIC’s Extended Campus. Through collaboration with UIC’s colleges, centers and institutes, Extended Campus offers innovative programs and supports professionals seeking development opportunities."
    ],
    "out_links": [
        "http://uic.edu/",
        "https://innovation.uic.edu/about/",
        "https://innovation.uic.edu/about/faculty-advisory-committee/",
        "https://innovation.uic.edu/initiatives/",
        "https://innovation.uic.edu/news-events/",
        "https://innovation.uic.edu/contact-us/",
        "http://maps.uic.edu/",
        "https://today.uic.edu/coronavirus",
        "https://accc.uic.edu/",
        "https://ec.uic.edu/",
        "https://otm.uic.edu/uic-community/submit-your-idea/",
        "https://cif.uic.edu/",
        "https://otm.uic.edu/resources/ctri/",
        "http://research.uic.edu/uicdpi",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}