{
    "url": "https://pga.uic.edu/",
    "title": "Office of Public and Government Affairs | University of Illinois at Chicago",
    "text": [
        "The Office of Public and Government Affairs has created and frequently updates a webpage to keep the UIC community up to date on the campus’ response to the Coronavirus Disease 2019 (COVID-19). Read more for current official communications, frequently asked questions, resources for the community, and links to public health organizations.",
        "UI Health messages of gratitude video, created by PGA staff and shared on UIC social media channels.",
        "To Uphold and Enhance the Reputation, Image and Values of UIC and to Showcase and Celebrate UIC’s Diverse and Inclusive Community.",
        "The Office of Public and Government Affairs is focused on institutional advocacy to establish strong relationships with outside constituencies and build broad understanding of UIC’s contributions locally, nationally, and worldwide. Units within PGA are responsible for developing and broadcasting strategic communications and supporting campus units by providing best practices and resources to ensure that marketing and communications are aligned with UIC’s brand and identity."
    ],
    "out_links": [
        "http://uic.edu/",
        "https://pga.uic.edu/public-government-affairs-units/",
        "https://pga.uic.edu/staff-directory/",
        "https://pga.uic.edu/contact-public-government-affairs/",
        "http://maps.uic.edu/",
        "https://today.uic.edu/coronavirus",
        "http://pga.uic.edu/public-government-affairs-units/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}