{
    "url": "https://www.uic.edu/about/visit-directions/",
    "title": "University of Illinois at Chicago",
    "text": [
        "Always Active",
        "The best way to get to know UIC is to visit",
        "University of Illinois at Chicago offers a number of options for campus visits. You can choose a weekday or Saturday visit, on your own or as part of a group. We also offer scheduled preview days for freshmen, transfer students and students in health sciences. We’ll do everything we can to accommodate you.",
        "More information on visiting campus.",
        "UIC’s campus spans 244 acres. At the east, students will find the corner of Halsted and Harrison streets. The Illinois Medical District is at the heart of the west side of campus and the exciting University Village is a popular spot for students just south of Roosevelt Road.",
        "Running along Halsted Street from Harrison Street to south of Roosevelt Road are the east and south sides of campus. Start your tour of campus at the UIC Visitors Center located in our Student Services Building. The east and south sides of campus are also home to the majority of undergraduate housing and nine of our 16 colleges. Academics cover the arts and humanities, basic sciences, business, social work, education, engineering and urban planning. You’ll also find here the Student Services Building, Richard J. Daley Library, Student Center East and the Student Recreation Facility.",
        "Home to our health sciences colleges and hospital, the west side of campus sits in the heart of the Illinois Medical District. Students have access to housing, the Library of the Health Sciences, the Sport & Fitness Center and Student Center West.",
        "No matter which side of campus you plan to visit, UIC is readily accessible by car, train, bus or bike. For a street address of a specific department, please see our Directory.",
        "UIC John Marshall Law School is located in the heart of Chicago’s downtown business district, “the Loop.” Located at 300 S. State Street, students of the law school are right around the corner from Chicago’s lakefront parks, like Grant Park, Millennium Park and Maggie Daley Park.",
        "We want to make it as easy as possible for you to navigate campus.",
        "The UIC interactive campus map displays a wide array of information resources for UIC’s students, visitors, faculty and staff. It provides university building and parking information, assists with directions, outlines UIC shuttle routes and provides high-resolution, print-optimized campus maps in PDF format available for download.",
        "UIC’s location allows easy access to campus via public transportation.  Both  CTA buses and the CTA trains (the “L”) run through and around campus.  Seven CTA bus routes run through the campus (see routes as a layer on our campus map). The Blue Line train (UIC-Halsted, Racine and Illinois Medical District stops) and the Pink Line train (Polk stop), connect the campus with downtown, O’Hare International Airport, northwest and west side neighborhoods of Chicago, and the western suburbs of Oak Park, Forest Park and Cicero.",
        "Pace Suburban Bus operates an express route (Route 755 Plainfield – IMD Express) between Plainfield, Bolingbrook and the UIC campus and Illinois Medical District during weekday rush hours.",
        "The UIC campus is also two blocks west of the Greyhound Bus terminal.",
        "Detailed travel information is available from the Regional Transportation Authority’s Travel Information Center or 312-836-7000.",
        "Chicago’s Jane Byrne (Circle) Interchange, which links four expressways around UIC, is undergoing a multi-year renovation. Construction progress may affect traffic and parking on campus.",
        "",
        "Campus Parking Services provides safe, convenient and affordable parking options for vehicles on campus:",
        "UIC’s Intracampus bus services provides free transportation services to students, faculty and staff to different places on campus. Three routes are available:",
        "Know where the buses are now with the UIC Bus Tracker which is also available on our UIC mobile app.",
        "Biking can be a healthy and fun way to get to and around campus. UIC has over 800 bicycle racks and is part of the ever-expanding Chicago bike infrastructure which includes dedicated bike lanes. Spend a few minutes considering your route. Check the City of Chicago bike map or other user-recommended routes for suggestions."
    ],
    "out_links": [
        "http://maps.uic.edu/",
        "http://www.uic.edu/apps/departments-az/search",
        "https://www.uic.edu/about/contact-us/",
        "http://library.uic.edu/",
        "http://oge.uic.edu/",
        "https://today.uic.edu/resources/current-students",
        "https://today.uic.edu/resources/faculty-staff",
        "https://uihealth.uic.edu/",
        "https://give.uic.edu/",
        "https://www.uic.edu/",
        "https://www.uic.edu/admissions-aid/",
        "https://www.uic.edu/admissions-aid/visit-campus/",
        "https://www.uic.edu/admissions-aid/paying-for-college/",
        "https://www.uic.edu/academics/",
        "https://www.uic.edu/academics/programs-of-study/",
        "https://www.uic.edu/academics/colleges-schools/",
        "https://www.uic.edu/academics/student-support/",
        "https://www.uic.edu/research/",
        "https://www.uic.edu/research/research-impact/",
        "https://www.uic.edu/research/research-strengths/",
        "https://www.uic.edu/research/resources-facilities/",
        "https://www.uic.edu/research/student-research/",
        "https://www.uic.edu/life-at-uic/",
        "https://www.uic.edu/life-at-uic/living-on-around-campus/",
        "https://www.uic.edu/life-at-uic/campus-resources/",
        "https://www.uic.edu/chicago/",
        "https://www.uic.edu/chicago/exploring-chicago/",
        "https://www.uic.edu/chicago/city-transportation/",
        "https://www.uic.edu/chicago/essential-chicago/",
        "https://www.uic.edu/alumni/",
        "https://www.uic.edu/about/",
        "https://www.uic.edu/about/history/",
        "https://www.uic.edu/about/leadership/",
        "https://www.uic.edu/about/public-media-resources/",
        "https://www.uic.edu/about/job-opportunities/",
        "https://www.uic.edu/about/acerca/",
        "https://www.uic.edu/about",
        "https://www.uic.edu/about/visit-directions",
        "https://admissions.uic.edu/book-visit",
        "https://www.uic.edu/chicago/city-transportation",
        "http://news.uic.edu/uicnews/section/circleinterchange",
        "https://parking.uic.edu/application/",
        "https://parking.uic.edu/facilities/",
        "https://parking.uic.edu/rates-fees/",
        "https://parking.uic.edu/",
        "http://bus.uic.edu/",
        "http://accc.uic.edu/uicmobile",
        "http://fmweb.fm.uic.edu/Trans/intracampus.aspx",
        "http://sustainability.uic.edu/green-campus/bikes/",
        "https://accc.uic.edu/service/g-suite",
        "https://my.uic.edu/",
        "https://outlook.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "http://catalog.uic.edu/ucat/academic-calendar/",
        "http://events.uic.edu/",
        "http://today.uic.edu/",
        "http://clery.uic.edu/",
        "http://oae.uic.edu/UnlawfulDiscrimination/index.htm",
        "http://oae.uic.edu/sexual-misconduct/",
        "http://financialaid.uic.edu/consumer-information/department-education-complaint-process/",
        "http://disabilityresources.uic.edu/",
        "http://emergency.uic.edu/",
        "https://maps.uic.edu/",
        "http://www.uic.edu/depts/dos/studentveteranaffairs.shtml",
        "http://admissions.uic.edu/visit-us",
        "http://admissions.uic.edu/undergraduate/request-information",
        "http://admissions.uic.edu/apply-now",
        "http://advance.uic.edu/alumni-association/",
        "https://news.uic.edu/social-media-directory"
    ]
}