{
    "url": "https://today.uic.edu/uic-realizara-celebracion-virtual-de-graduacion",
    "title": "UIC realizará celebración virtual de graduación | UIC Today",
    "text": [
        "La celebración no reemplaza a la tradicional ceremonia de graduación de la UIC, que se reprogramará una vez que la pandemia de COVID-19 disminuya y los funcionarios de salud consideren que es seguro reanudar las reuniones públicas.",
        "In English",
        "La universidad se ha asociado con Marching Order, una empresa privada que brinda la oportunidad a las instituciones educativas de ofrecer una ceremonia de graduación virtual a medida. En la UIC, 14 de los 16 colegios de la universidad compartirán información sobre sus graduados en el sitio de la Marching Order a través de enlaces que los propios graduados podrán compartir. Estos incluyen la Facultad de Derecho John Marshall de la UIC, así como el  Colegio de Honor .",
        "El Colegio de Medicina tendrá su propia celebración virtual el 8 de mayo para que puedan comenzar a trabajar en el campo de la salud lo antes posible. Los estudiantes en el Graduate College participarán en las ceremonias en línea de su colegio académico.",
        "Del total de 5.381 graduados participantes, 3.149 obtendrán títulos universitarios, mientras que 2.232 recibirán títulos graduados / avanzados. El mayor número de graduados son de la Facultad de Artes y Ciencias Liberales, seguidos por la Facultad de Ingeniería y la Facultad de Enfermería.",
        "“Estamos muy orgullosos de nuestros graduados”, dijo el canciller de la UIC, Michael Amiridis. “Le daremos sus títulos en una ceremonia virtual para que puedan continuar con la próxima fase de sus carreras. Y aunque celebraremos prácticamente este hito, lo veo como un ensayo general para la celebración cara a cara en la que todos quieren participar y que nuestros graduados, sus familias y sus amigos se merecen. Cuando sea seguro hacerlo, estoy seguro de que todos en la clase de 2020 se unirán a nosotros para una verdadera celebración en el campus “.",
        "Hasta entonces, los graduados y sus familias podrán ver mensajes de felicitación del canciller y de los oradores de graduación durante el evento virtual del 16 de mayo.  Los enlaces se activarán a las 9 a.m. y se podrán ver después. Los oradores de inicio incluyen:",
        "Antes del 16 de mayo, los graduados tendrán la oportunidad de subir una foto en una diapositiva que enumerará sus nombres, principales y un mensaje personal. La página que enumera los nombres de los estudiantes y otra información privada estará disponible a través de un enlace al graduado, que podrá compartirlo.",
        "La ceremonia con discursos de apertura estará abierta al público, incluidos los medios de comunicación.",
        "",
        "",
        "Contact",
        "",
        "Carlos Sadovi",
        "312-355-2491",
        "csadovi@uic.edu",
        "twitter.com/@carlossadoviuic",
        "",
        "",
        "",
        "",
        "Carlos Sadovi",
        "312-355-2491",
        "csadovi@uic.edu",
        "twitter.com/@carlossadoviuic",
        "",
        "Categories"
    ],
    "out_links": [
        "http://uic.edu/",
        "https://today.uic.edu/",
        "https://today.uic.edu/campus-news",
        "https://today.uic.edu/academics-research",
        "https://today.uic.edu/events",
        "https://today.uic.edu/resources",
        "https://today.uic.edu/resources/current-students",
        "https://today.uic.edu/resources/faculty-staff",
        "https://today.uic.edu/resources/photo-video-policies",
        "https://today.uic.edu/resources/social-media-inquiry-form",
        "https://today.uic.edu/uic-social-media-guidelines-and-best-practices",
        "https://today.uic.edu/coronavirus",
        "https://today.uic.edu/frequently-asked-questions",
        "https://today.uic.edu/what-you-need-to-know-about-covid-19",
        "https://today.uic.edu/support-for-the-uic-community",
        "https://today.uic.edu/teaching-learning-and-working-resources",
        "https://today.uic.edu/in-the-news-covid-19",
        "https://today.uic.edu/contact",
        "https://today.uic.edu/contact/communicating-on-campus",
        "https://today.uic.edu/contact/communicating-on-campus/sending-massmails-dddh",
        "https://today.uic.edu/contact/social-media-directory",
        "https://today.uic.edu/uic-to-hold-virtual-graduation-celebration",
        "https://today.uic.edu/author/csadovi",
        "https://today.uic.edu/campus-news/campus-newspaper/subscribe-to-uic-today",
        "https://today.uic.edu/news-release/news-release/",
        "https://today.uic.edu/experts-guide",
        "https://today.uic.edu/contact/communicating-on-campus/submit-announcements",
        "https://today.uic.edu/submit-an-event",
        "http://catalog.uic.edu/ucat/academic-calendar/",
        "http://www.uic.edu/apps/departments-az/search",
        "http://disabilityresources.uic.edu/",
        "http://emergency.uic.edu/",
        "http://events.uic.edu/",
        "http://uic.edu/about/job-opportunities",
        "http://library.uic.edu/",
        "http://maps.uic.edu/",
        "http://dos.uic.edu/studentveteranaffairs.shtml"
    ]
}