{
    "url": "https://today.uic.edu/uic-graduates-first-bfa-in-art-education-students?utm_campaign=academics&utm_medium=website&utm_source=homegrid",
    "title": "UIC graduates first BFA in art education students | UIC Today",
    "text": [
        "The program began",
        "anew in the fall of 2017 with a cohort of five students, three of whom will be",
        "graduating with the College of Architecture, Design, and the Arts in a virtual",
        "ceremony on May 16. The graduating seniors include Edith",
        "Mendez, Jennifer Gonzalez, and Latrell Walton.",
        "Mendez recently was accepted into the Chicago Public Schools’ early offer program, which guarantees her a teaching position with the district for the 2020-21 school year. The next step is for her to interview with principals for placement in a specific school.",
        "As part of their program, students had to take classes in the College of Education at UIC. In addition, they had to complete fieldwork and student teaching this past year. Like other teachers in Chicago, the student teachers experienced unprecedented challenges that will help make them better instructors, said Karyn Sandlos, who oversees the program. During this time, they were able to plan and teach, “amazing, personally and culturally relevant curricula and lesson plans.”",
        "“They faced many challenges, including a Chicago Teachers Union strike in Fall 2019 and the closing of CPS in March 2020 due to the COVID-19 pandemic,” Sandlos said. “Our students were able to turn these challenges into learning opportunities including learning what it means to teach under crisis conditions.”",
        "Since its initial cohort of five students, the program has grown to 14, including the graduating seniors. Another 13 new students have applied to enter the major in the fall, for a total of 24 students. Students enter the program in the third year of their college career after they have fulfilled requirements in studio art, art history and general education.",
        "As Sandlos began developing the program, she reached out to representatives from a local nonprofit, “Grow Your Own Teachers Illinois,” or GYO, whose focus is to diversify the teaching profession in the state.",
        "“The group works closely with several other colleges but was eager to get more UIC students involved,” Sandlos said.",
        "The organization has eight students from UIC’s BFA in Art Education program participating in the initiative where they receive financial, academic and social support in exchange for a five-year commitment to teach in a high-need public school after they graduate. The students, including the three graduates, can receive up to $25,000 in tuition assistance each during their lifetime.",
        "Edith Mendez, who graduated from Morton West High School in Berwyn, Illinois, and is a sculptor and mixed-media artist, said the UIC program provided her with the tools to succeed in her new career.",
        "“I was able to create a timeline with my professor to stay on track for student teaching, the edTPA, graduation, licensure and applying for jobs,” Mendez said. “This program is a tight-knitted community, and I always had access to my professors to address any questions, comments or concerns especially with the job application process.”",
        "In the fall of 2019, the program expanded with the hire of William Estrada as a new faculty member in art education and studio art. The multidisciplinary artist and educator has taught at Telpochcalli Elementary School in Little Village for 18 years and has been a teaching artist since 1998.",
        "“I’m working with Karyn and the art education students to reframe what art education can look like and how art can help us imagine, plan and build an equitable world,” Estrada said. “I hope to show that conversations about how we create an equity centered democracy can start in the art class and be led by artists and art educators.”",
        "",
        "",
        "Contact",
        "",
        "Carlos Sadovi",
        "312-355-2491",
        "csadovi@uic.edu",
        "twitter.com/@carlossadoviuic",
        "",
        "",
        "",
        "",
        "Carlos Sadovi",
        "312-355-2491",
        "csadovi@uic.edu",
        "twitter.com/@carlossadoviuic",
        "",
        "Categories",
        "",
        "Campus, Students",
        "Topics",
        "art education, CADA, CPS, education"
    ],
    "out_links": [
        "http://uic.edu/",
        "https://today.uic.edu/",
        "https://today.uic.edu/campus-news",
        "https://today.uic.edu/academics-research",
        "https://today.uic.edu/events",
        "https://today.uic.edu/resources",
        "https://today.uic.edu/resources/current-students",
        "https://today.uic.edu/resources/faculty-staff",
        "https://today.uic.edu/resources/photo-video-policies",
        "https://today.uic.edu/resources/social-media-inquiry-form",
        "https://today.uic.edu/uic-social-media-guidelines-and-best-practices",
        "https://today.uic.edu/coronavirus",
        "https://today.uic.edu/frequently-asked-questions",
        "https://today.uic.edu/what-you-need-to-know-about-covid-19",
        "https://today.uic.edu/support-for-the-uic-community",
        "https://today.uic.edu/teaching-learning-and-working-resources",
        "https://today.uic.edu/in-the-news-covid-19",
        "https://today.uic.edu/contact",
        "https://today.uic.edu/contact/communicating-on-campus",
        "https://today.uic.edu/contact/communicating-on-campus/sending-massmails-dddh",
        "https://today.uic.edu/contact/social-media-directory",
        "https://today.uic.edu/author/csadovi",
        "https://today.uic.edu/category/category-campus",
        "https://today.uic.edu/category/category-students",
        "https://today.uic.edu/tag/art-education",
        "https://today.uic.edu/tag/cada",
        "https://today.uic.edu/tag/cps",
        "https://today.uic.edu/tag/education",
        "https://today.uic.edu/campus-news/campus-newspaper/subscribe-to-uic-today",
        "https://today.uic.edu/news-release/news-release/",
        "https://today.uic.edu/experts-guide",
        "https://today.uic.edu/contact/communicating-on-campus/submit-announcements",
        "https://today.uic.edu/submit-an-event",
        "http://catalog.uic.edu/ucat/academic-calendar/",
        "http://www.uic.edu/apps/departments-az/search",
        "http://disabilityresources.uic.edu/",
        "http://emergency.uic.edu/",
        "http://events.uic.edu/",
        "http://uic.edu/about/job-opportunities",
        "http://library.uic.edu/",
        "http://maps.uic.edu/",
        "http://dos.uic.edu/studentveteranaffairs.shtml"
    ]
}