{
    "url": "https://chancellor.uic.edu/about/committees/",
    "title": "Committees | Office of the Chancellor | University of Illinois at Chicago",
    "text": [
        "UIC is among the nation's most diverse universities and a leader in the sustainability movement in higher education. We consider diversity a strength that contributes to the success of our students, staff, faculty, and institutional research. UIC has developed major climate commitment goals and short-term action items that the campus will implement to address climate change, including teaching and learning opportunities in sustainability.",
        "The following groups are tasked to ensure neither diminished state support nor a more challenging financial environment deters us from our commitment to diversity and confronting the challenges of climate change and sustainability on campus.",
        "The Chancellor’s Committee on Sustainability and Energy is a voluntary committee that works to promote sustainability on UIC’s campus and advance UIC’s Climate Commitment of reducing greenhouse gas emissions by 80 percent by 2050.  Membership to CCSE is open to UIC staff, faculty and students.",
        "UIC established the Chancellor’s Status Committees to assist the campus community in supporting our diverse students, faculty and staff. Every year, faculty, staff, and students are nominated by existing committee members and appointed annually by the Chancellor as an official executive committee member. Their participation reflects the importance of service to the university and reflects the diversity of our campus. Involvement in Status Committee meetings and events is open to the entire UIC community and supported by the Chancellor thereby considered approved for employee participation. Chancellor Amiridis encourages the campus to call upon the Status Committees to seek their assistance or take part in their efforts in the areas described below. Please consult their websites for greater detail on activities, events and subcommittees.",
        "CCSAA is dedicated to promoting the academic, social, cultural and professional welfare of UIC’s Asian American faculty, staff and students. CCSAA addresses and makes recommendations to the chancellor regarding issues related to employment practices, climate, representation, recruitment, and retention issues that are of concern to the Asian American campus community. The committee is dedicated to working collaboratively with diverse communities on campus and building relationships with off campus Asian American community organizations.",
        "CCSB serves as an advisory body on matters pertaining to the academic, professional, and social aspects of African and African American life at UIC. CCSB addresses issues relating to campus governance, employment practices, public relations, student affairs and other issues that affect the well being of Blacks on campus. The committee works collaboratively with UIC’s diverse community.",
        "CCSL was established to promote the development of educational, professional and career opportunities among UIC Latinos. The committee addresses issues of general concern to Latinos at UIC.",
        "The mission of CCSLGBTQP is to address issues and concerns of the gay, lesbian, bisexual, transgender, and queer community at UIC. This includes addressing needs of faculty, staff, students and alumni of diverse sexual orientations. The goal is to enhance a supportive environment, which will foster full participation by all members of the university’s communities in teaching, public service, and research.",
        "The mission of CCSPD is to promote empowerment and inclusion of faculty, staff and students with disabilities at UIC. CCSPD recognizes that people with disabilities are a diverse group, including individuals with visible and non-visible disabilities. This mission is motivated by the belief that people with disabilities are assets to the university, not liabilities.",
        "CCSW works to improve the status of women at UIC with a primary objective to advise and make recommendations to the Chancellor regarding attitudes, policies, and procedures that affect women faculty, staff and students. The committee will undertake projects and will also recommend changes in campus structures, policies and programs as appropriate."
    ],
    "out_links": [
        "https://chancellor.uic.edu/",
        "http://uic.edu/",
        "https://chancellor.uic.edu/about/",
        "https://chancellor.uic.edu/about/biography/",
        "https://chancellor.uic.edu/about/senior-leadership/",
        "https://chancellor.uic.edu/about/chancellor-history/",
        "https://chancellor.uic.edu/news-communications/",
        "https://chancellor.uic.edu/news-communications/news/",
        "https://chancellor.uic.edu/news-communications/chancellor-communications/",
        "https://chancellor.uic.edu/speeches/",
        "https://chancellor.uic.edu/speeches/state-of-the-university-of-illinois-at-chicago-2019/",
        "https://chancellor.uic.edu/speeches/state-of-uic-address-2018/",
        "https://chancellor.uic.edu/speeches/city-club-chicago-02-01-18/",
        "https://chancellor.uic.edu/speeches/sotu2017/",
        "https://chancellor.uic.edu/speeches/sotu2016/",
        "https://chancellor.uic.edu/instagram-feed/",
        "https://chancellor.uic.edu/video/",
        "https://chancellor.uic.edu/photos/",
        "https://chancellor.uic.edu/contact/",
        "http://maps.uic.edu/",
        "http://sustainability.uic.edu/getinvolved/ccse/",
        "http://www.uic.edu/depts/ccsaa/",
        "http://www.uic.edu/depts/ccsb/",
        "http://www.uic.edu/depts/lcc/CCSL/",
        "https://ccslgbtqpa.uic.edu/",
        "https://ccspd.uic.edu/",
        "http://www.uic.edu/depts/ccsw/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}