{
    "url": "https://diversity.uic.edu/about/",
    "title": "About | Office of the Vice Provost for Diversity | University of Illinois at Chicago",
    "text": [
        "The University of Illinois at Chicago (UIC) is one of the nation’s most diverse public research universities. As a federally designated Minority Serving Institution, we strive to promote an organizational culture and structure, grounded on the principles of access, equity and inclusion. UIC welcomes students, staff and faculty from a variety of racial, ethnic, and class backgrounds, gender identities, sexual orientations, and abilities to cultivate a diverse learning community where human differences are embraced and neither difference nor disadvantage stands in the way of intellectual and professional achievement. Furthermore, we believe that by drawing upon these diverse perspectives, we are able to expand frontiers of knowledge as a national leader of innovative scholarship.",
        "The Office of Diversity guides UIC’s strategic efforts to advance access, equity, and inclusion as fundamental institutional values underpinning all aspects of university life. Our office manages UIC’s diversity resources and infrastructure which includes initiating educational programs to promote a supportive university climate, partnering with campus units to formulate systems of accountability, cultivating mutually beneficial partnerships with the community and alumni groups, and advising the Provost for Academic Affairs as well as the Chancellor on critical diversity issues.",
        "Vision",
        "As the nation’s premier urban public research university, UIC will be known as an institution where neither difference nor disadvantage stands in the way of intellectual and professional ambition; where each individual member of its community realizes their full capacity for creativity, innovation and service; and where the promise of equal opportunity is a reality.",
        "Mission",
        "UIC will take advantage of and build upon its diversity to create, share, and apply knowledge that prepares people for citizenship in a changing global society. The diversity of the members of our campus community will be apparent and, moreover, UIC will be known as an institution of higher education where diversity is a cornerstone of intellectual achievement. As a truly diverse institution, UIC will engage citizens from all the communities of Chicago and all the many other communities that comprise the state which we serve.",
        "Respect diverse voices and support the achievement of excellence for every individual.",
        "Respect individual identities and create a safe climate for discussion and cooperation to build a stronger, more diverse campus community.",
        "Provide opportunities to and encourage meaningful participation of members of historically underrepresented groups.",
        "Advocate for changes at UIC that advance organizational innovation and transformation.",
        "Cultivate a more egalitarian organization by promoting inclusive processes and fair and just outcomes for underrepresented and underserved groups.",
        "Work to discover and apply knowledge that serves our diverse communities both on and off campus.",
        "Increase access to leadership and decision making. Listen to and learn from the diverse groups and perspectives that constitute our university community."
    ],
    "out_links": [
        "https://diversity.uic.edu/",
        "http://uic.edu/",
        "https://diversity.uic.edu/about/diversity-strategic-plan/",
        "https://diversity.uic.edu/about/awards/",
        "https://diversity.uic.edu/about/leadership/",
        "https://diversity.uic.edu/about/staff/",
        "https://diversity.uic.edu/about/contact-us/",
        "https://diversity.uic.edu/engagement/",
        "https://diversity.uic.edu/engagement/ccusc/",
        "https://diversity.uic.edu/engagement/diversity-education/",
        "https://diversity.uic.edu/engagement/committees/",
        "https://diversity.uic.edu/engagement/dialogue-initiative/",
        "https://diversity.uic.edu/engagement/multi-cultural-scholars-community/",
        "https://diversity.uic.edu/engagement/student-inclusion/",
        "https://diversity.uic.edu/engagement/stride/",
        "https://diversity.uic.edu/yldf/",
        "https://diversity.uic.edu/singing-from-balconies-covid-19-quarantine-testimonials/",
        "https://diversity.uic.edu/news/",
        "https://diversity.uic.edu/news/join-our-mailing-list/",
        "https://diversity.uic.edu/events-2/",
        "https://diversity.uic.edu/data/",
        "https://diversity.uic.edu/data/research/",
        "https://diversity.uic.edu/data/equity-dashboard/",
        "https://diversity.uic.edu/resources/",
        "https://diversity.uic.edu/resources/external-resources/",
        "https://diversity.uic.edu/diversitytownhalls/",
        "https://diversity.uic.edu/engagement/student-inclusion/undocumented-student-support/",
        "https://diversity.uic.edu/donate/",
        "http://chancellor.uic.edu/",
        "http://provost.uic.edu/",
        "http://maps.uic.edu/",
        "http://go.uic.edu/uicare",
        "http://dos.uic.edu/",
        "http://counseling.uic.edu/",
        "http://oae.uic.edu/",
        "http://dream.uic.edu/",
        "http://ois.uic.edu/",
        "http://ask.uic.edu/",
        "http://policies.uic.edu/uic-policy-library/access-and-equity/nondiscrimination-policy-statement/",
        "https://diversity.uic.edu/donate/donate-to-diversity/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}