{
    "url": "https://diversity.uic.edu/engagement/stride/",
    "title": "STRategies for Inclusion, Diversity and Equity | Office of the Vice Provost for Diversity | University of Illinois at Chicago",
    "text": [
        "STRIDE is a network that brings together grant-based and institutional pipeline programs with academic support, student life, and cultural programs and centers. We seek to learn from each other and work together to broaden and deepen our efforts to serve our diverse body of students at UIC.",
        "“As we have increased enrollment what does it mean for our ability to serve our students? How do we move from minority enrolling to minority serving? What are the specific challenges you would like to discuss regarding our mission of serving students with rapid growth and enrollment?”",
        "Time",
        "Title",
        "Speakers",
        "8:15 a.m.",
        "Breakfast Networking",
        "",
        "",
        "9:00 a.m.",
        "Welcome and Recap from 2018",
        "Faculty Diversity Efforts and New Diversity Programs",
        "Provost Susan Poser",
        "Amalia Pallares, Karen Colley, Nancy Freitag",
        "",
        "",
        "10:00 a.m.",
        "Concurrent Workshops",
        "",
        "",
        "10:45 a.m.",
        "BREAK (pick up lunch)",
        "",
        "",
        "11:00 a.m.",
        "Plenary Presentation",
        "Rosa Cabrera, Jordan “JT” Turner",
        "",
        "",
        "11:30 a.m.",
        "Small Group Breakout Discussion Sessions",
        "",
        "",
        "12:30 p.m.",
        "Wrap Up",
        "Amalia Pallares, Karen Colley",
        "",
        "",
        "12:45 p.m.",
        "BREAK",
        "",
        "",
        "1:00 p.m.",
        "Concurrent Workshops",
        "",
        "",
        "Centers for Cultural Understanding and Social Change  – Rosa Cabrera (Director, Latino Cultural Center) & Jordan “JT” Turner (Director, Gender and Sexuality Center)",
        "The first part of this session will provide an overview on various ways that the UIC cultural centers assist students to achieve success in their educational pursuits and professional and personal aspirations. The centers develop strategies and programmatic responses that consider the lived experience of students as they face challenging personal, community, and educational issues. During the second part, centers’ staff will facilitate small group discussions to explore how collaborations between different campus entities with the centers can advance student learning and success in creative and engaging ways.",
        "Carol Fendt, Director, PRAIRIE Group, Learning Sciences Research Institute",
        "Attendees will prepare a proposal, project, or program description to work on; this is a working session and not just a presentation. In this workshop attendees will develop a logic model for their program that links goals, program activities, and outcomes. Utilizing this logic model they will create evaluation questions to provide formative and summative feedback on the effectiveness and impact of their program. The goal is to leave with a logic model and an evaluation plan.",
        "Charu Thakral, Associate Vice Provost for Diversity & Michelle Manno, Director for Diversity Initiatives",
        "The Office of Diversity’s Inclusive Classroom Initiative (ICI) lives at the intersection of three key institutional pri¬orities at UIC: diversity, equity, and inclusion; student success; and teaching excel¬lence. The initiative is based on the understanding that effective, high-quality teaching considers what is taught (academic content), who is taught (the student), and how the material is delivered (pedagogy). Given that the tendency for many instructors is the sole focus on course content with a lack of attention to exploring the relationship between content, student identity/experience, and pedagogical practice, ICI provides strategies for an inclusive and equitable environment where students can succeed. This session will highlight some easily implementable, successful strategies used in existing ICI professional development modules. Through small group discussions, participants will explore inclusive practices in the classroom and discuss the ways in which they can impact student success.",
        "Karen Colley, Dean of the Graduate College and Professor of Biochemistry and Molecular Genetics, College of Medicine",
        "As a minority serving university that is also a Highest Research Doctoral University, UIC is exceptional. UIC is also exceptional in that it has experienced an amazing increase in undergraduate enrollment over the last few years bucking a trend in Illinois and across the country. The faculty and staff at UIC are committed to serving our undergraduates, as well as all of our trainees, and we are especially sensitive to the needs of the minority members of our community. We have many pipeline and support programs, some funded by federal grants that require mentors to receive training. The Center for the Improvement of Mentored Experiences in Research (CIMER) has created a comprehensive mentor training program that is grounded in facilitated discussion of scenarios describing mentoring challenges. The downside of this program is that it is very time consuming. The challenge I have taken on is to create a general mentor training, based on the CIMER mentor training, that includes best practices and a variety of facilitated discussion scenarios that can be selected to best serve different audiences. I invite the experts who are already offering mentor training and those who aspire to offer mentor training to join me to provide feedback on my first attempt to create a 2-3 hour general mentor training that can be used as is or modified to serve a specific audience.",
        "Should our aspirational goals be to not need these programs at some future date?",
        "Time",
        "Title/Subtitle",
        "Panelists",
        "Moderator",
        "8:00am",
        "Breakfast and Pipeline Expo—",
        "UIC Programs and Support Units",
        "9:15",
        "Opening Remarks",
        "Amalia Pallares, Karen Colley",
        "9:30",
        "Session 1",
        "Aixa Alfonso, Sara Hall",
        "Maryfrances Miley",
        "11:00",
        "Provost Poser Remarks",
        "11:15",
        "Session 2",
        "Jeff Alton, Jeff Brown, Oscar Rodriguez",
        "Luis Duarte",
        "12:30pm",
        "Lunch",
        "1:30",
        "Session 3",
        "Sue Farruggia, Carol Fendt, Pat Inman",
        "Lunaire Ford",
        "3:00",
        "Session 4",
        "Meena Rao, William Walden",
        "Karen Colley",
        "4:30",
        "Closing Remarks",
        "Karen Colley, Amalia Pallares",
        "A culture change is needed.  Don’t call it service—call it leadership!",
        "Retention is the best recruitment strategy, and our students are the best ambassadors.",
        "It’s important if we’re hearing the same feedback from different sources.",
        "Should our aspirational goals be to not need these programs at some future date?"
    ],
    "out_links": [
        "https://diversity.uic.edu/",
        "http://uic.edu/",
        "https://diversity.uic.edu/about/",
        "https://diversity.uic.edu/about/diversity-strategic-plan/",
        "https://diversity.uic.edu/about/awards/",
        "https://diversity.uic.edu/about/leadership/",
        "https://diversity.uic.edu/about/staff/",
        "https://diversity.uic.edu/about/contact-us/",
        "https://diversity.uic.edu/engagement/",
        "https://diversity.uic.edu/engagement/ccusc/",
        "https://diversity.uic.edu/engagement/diversity-education/",
        "https://diversity.uic.edu/engagement/committees/",
        "https://diversity.uic.edu/engagement/dialogue-initiative/",
        "https://diversity.uic.edu/engagement/multi-cultural-scholars-community/",
        "https://diversity.uic.edu/engagement/student-inclusion/",
        "https://diversity.uic.edu/yldf/",
        "https://diversity.uic.edu/singing-from-balconies-covid-19-quarantine-testimonials/",
        "https://diversity.uic.edu/news/",
        "https://diversity.uic.edu/news/join-our-mailing-list/",
        "https://diversity.uic.edu/events-2/",
        "https://diversity.uic.edu/data/",
        "https://diversity.uic.edu/data/research/",
        "https://diversity.uic.edu/data/equity-dashboard/",
        "https://diversity.uic.edu/resources/",
        "https://diversity.uic.edu/resources/external-resources/",
        "https://diversity.uic.edu/diversitytownhalls/",
        "https://diversity.uic.edu/engagement/student-inclusion/undocumented-student-support/",
        "https://diversity.uic.edu/donate/",
        "http://chancellor.uic.edu/",
        "http://provost.uic.edu/",
        "http://maps.uic.edu/",
        "http://heritagegarden.uic.edu/",
        "https://diversity.uic.edu/engagement/diversity-education/ici/",
        "https://diversity.uic.edu/engagement/diversity-education/words-matter/",
        "http://gsc.uic.edu/safe-zone/",
        "https://latinocultural.uic.edu/programs/dialogues-tours/",
        "https://diversity.uic.edu/engagement/real-community/",
        "https://diversity.uic.edu/engagement/student-inclusion/early-outreach-program-2/",
        "https://diversity.uic.edu/yldf/program/",
        "https://diversity.uic.edu/yldf/register/",
        "https://diversity.uic.edu/yldf/faq/",
        "http://go.uic.edu/uicare",
        "http://dos.uic.edu/",
        "http://counseling.uic.edu/",
        "http://oae.uic.edu/",
        "http://dream.uic.edu/",
        "http://ois.uic.edu/",
        "http://ask.uic.edu/",
        "http://policies.uic.edu/uic-policy-library/access-and-equity/nondiscrimination-policy-statement/",
        "https://diversity.uic.edu/donate/donate-to-diversity/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}