{
    "url": "https://diversity.uic.edu/diversitytownhalls/",
    "title": "Diversity Town Halls | Office of the Vice Provost for Diversity | University of Illinois at Chicago",
    "text": [
        "Don’t let anything stop you. These are tough times, but you can succeed. We are here to help.",
        "When: Wednesday, May 6, 2020",
        "Time: 3 – 4:30pm",
        "Virtually: Zoom",
        "RSVP: go.uic.edu/AATH",
        "Presented by UIC Student organizations African Student Union, Black Student Union, Black Graduate Student Association, Undergraduate Student Government, and by the UIC African American Academic Network, African American Cultural Center, African American Recruitment, Enrollment, and Retention Initiative, Career Center, CHANCE Program, Chancellor’s Committee on the Status of Blacks, Counseling Center, Department of African American Studies, Institute for Health Research and Policy, Institute for Research on Race and Public Policy, Minority Engineering Recruitment and Retention Program, Office for Advising Development, Office of the Dean of Students, Office of Vice Chancellor for Student Affairs, Office of the Vice Provost for Diversity, Social Justice Initiative, Student Financial Aid and Scholarships, Urban Health Program",
        "Package and resources to come",
        "Join students for an interactive teach-in contextualizing the rise in anti-Asian violence amid COVID-19 within the long history of anti-Asian racism. Learn how the Asian American student movement emerged from transnational, multiracial struggles that continues today through UIC Asian and Asian American student activism. A discussion centering student voices and experiences will follow.",
        "Panelist:",
        "Anna Guevarra, Founding Director and Associate Professor of Global Asian Studies.",
        "Michael Jin, Assistant Professor of Global Asian Studies and History",
        "Gayatri Reddy, CCSAA Co-Chari and Associate Professor of Gender and Women’s Studies and Anthropology",
        "Karen Su, Project Director of UIC AANAPISI Intiative and Clinical Assistant Professor of Global Asian Studies",
        "Presented by the Global Asian Studies, Chancellor’s Committee on the Status of Asian Americans, Asian American Resource and Cultural Center, Diversity",
        "",
        "Package and resources to come",
        "Without you there is no us / Sin ustedes no hay un nosotros",
        "COVID-19 is having a serious impact on Latinx communities and on our students. We invite UIC Latinx students and their families to share how this pandemic is affecting their lives and what are their most urgent needs.",
        "Here are UIC’s resources for Latinx students, including emergency funds, career services, mental health, student engagement, and support for undocumented students. Together, we will define what are important next steps to support Latinx students at UIC in the challenging times ahead.",
        "Presented by the UIC Chancellor’s Committee on the Status of Latinos, Disability and Human Development, Diversity, Great Cities Institute, Institute for Research on Race and Public Policy, Latin American and Latino Studies Program, Latin American Recruitment and Educational Services, Rafael Cintrón Ortiz Latino Cultural Center, Social Justice Initiative",
        "The Institute for Research on Race and Public Policy and the Social Justice Initiative host a conversation on the Coronavirus Pandemic through the Lens of Racial and Social Justice. Moderated by Barbara Ransby from the Social Justice Initiative, panelists include Dr. Linda Rae Murray, Aislinn Pulley from Chicago Torture Project, Ald. Rossana Rodriguez, Ald. Jeanette Taylor, Detention Watch Network’s Gaby Viera and Reyna Wences from Organized Communities Against Deportations. This program was edited by CAN TV"
    ],
    "out_links": [
        "https://diversity.uic.edu/",
        "http://uic.edu/",
        "https://diversity.uic.edu/about/",
        "https://diversity.uic.edu/about/diversity-strategic-plan/",
        "https://diversity.uic.edu/about/awards/",
        "https://diversity.uic.edu/about/leadership/",
        "https://diversity.uic.edu/about/staff/",
        "https://diversity.uic.edu/about/contact-us/",
        "https://diversity.uic.edu/engagement/",
        "https://diversity.uic.edu/engagement/ccusc/",
        "https://diversity.uic.edu/engagement/diversity-education/",
        "https://diversity.uic.edu/engagement/committees/",
        "https://diversity.uic.edu/engagement/dialogue-initiative/",
        "https://diversity.uic.edu/engagement/multi-cultural-scholars-community/",
        "https://diversity.uic.edu/engagement/student-inclusion/",
        "https://diversity.uic.edu/engagement/stride/",
        "https://diversity.uic.edu/yldf/",
        "https://diversity.uic.edu/singing-from-balconies-covid-19-quarantine-testimonials/",
        "https://diversity.uic.edu/news/",
        "https://diversity.uic.edu/news/join-our-mailing-list/",
        "https://diversity.uic.edu/events-2/",
        "https://diversity.uic.edu/data/",
        "https://diversity.uic.edu/data/research/",
        "https://diversity.uic.edu/data/equity-dashboard/",
        "https://diversity.uic.edu/resources/",
        "https://diversity.uic.edu/resources/external-resources/",
        "https://diversity.uic.edu/engagement/student-inclusion/undocumented-student-support/",
        "https://diversity.uic.edu/donate/",
        "http://chancellor.uic.edu/",
        "http://provost.uic.edu/",
        "http://maps.uic.edu/",
        "http://go.uic.edu/AATH",
        "http://go.uic.edu/uicare",
        "http://dos.uic.edu/",
        "http://counseling.uic.edu/",
        "http://oae.uic.edu/",
        "http://dream.uic.edu/",
        "http://ois.uic.edu/",
        "http://ask.uic.edu/",
        "http://policies.uic.edu/uic-policy-library/access-and-equity/nondiscrimination-policy-statement/",
        "https://diversity.uic.edu/donate/donate-to-diversity/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}