{
    "url": "https://diversity.uic.edu/data/equity-dashboard/",
    "title": "The Equity Dashboard Project | Office of the Vice Provost for Diversity | University of Illinois at Chicago",
    "text": [
        "The Equity Dashboard project is a partnership between UIC's Office of Diversity, the Office of Institutional Research, and the Office of the Vice Provost for Academic and Enrollment Services.",
        "While the numbers of underrepresented minority (URM) and first-generation students attending colleges and universities have increased substantially over time, “gaps in college graduation by race and income have remained steady or widened” (Farrington et al. 2012).",
        "Put simply, underrepresented students on average, are not thriving at colleges and universities—including at UIC—compared to their counterparts. Prevailing explanations for such inequities have focused on college readiness and financial issues, situating responsibility for success solely within the individual student. Evidence suggests, however, that additional factors such as campus climate and academic and social support are crucial to student retention and graduation. Understanding the complexity of student success required shifting away from deficit-minded perspectives of students towards one of equity-mindedness. This is the basic premise of the Equity Dashboard Project.",
        "Drawing on campus-wide data, the Equity Dashboard Project is designed to (1) raise awareness of equity gaps between students UIC and (2) support colleges in bridging those gaps by focusing on the ways in which we, as an institution, are promoting and/or hindering student success.",
        "",
        "",
        "Access",
        "measuring/comparing key inputs across groups including:",
        "Application, admission, enrollment volume",
        "Admit rate",
        "Yield rate",
        "",
        "",
        "",
        "Achievement",
        "measuring/comparing key outcomes across groups including:",
        "Retention and graduation outcomes",
        "ABC and DFW rates by course",
        "",
        "",
        "",
        "Inclusion",
        "emotional/psychological aspects of how students interact with UIC including:",
        "Campus climate continuums",
        "Academic and social supports",
        "Comfort expressing views",
        "Having quality interactions on campus",
        "",
        "",
        "",
        "Engagement",
        "behavioral aspects of how students interact with UIC, including:",
        "Time spent in a typical week",
        "Balancing school and life",
        "Student interactions with academic, co-curricular activities",
        "Participation in clubs, student orgs, undergraduate research",
        "",
        "A series of dynamic Tableau dashboards presenting key indicators of student success along four dimensions: Access, Achievement, Inclusion, and Engagement.",
        "Dashboards will allow users to slice-and-dice data using a variety of filters so that more granular insights are available alongside campus-wide data.",
        "Core filters that will be included in each dashboard whenever possible include: student type/level; IPEDS race/ethnicity; gender; URM status; UIC college; first-generation status; pell eligibility status.",
        "First Year Retention Rate",
        "the rate at which full-time, first year or new transfer students enrolled in the fall, remained registered for the following fall semester.",
        "Two Year Graduation Rate",
        "the rate at which transfer students enrolled in the fall, graduated by the end of their second academic year. Graduation is counted through the summer of the second year.",
        "Four Year Graduation Rate",
        "the rate at which transfer students or full-time, first year students enrolled in the fall, graduated by the end of their fourth academic year. Graduation is counted through the summer of the fourth year.",
        "Six Year Graduation Rate",
        "the rate at which full-time, first year students enrolled in the fall, graduated by the end of their sixth academic year. Graduation is counted through the summer of the sixth year.",
        "First Generation",
        "neither parent(s) nor legal guardian has attended college (NCES definition). First generation data only exists starting with fall 2013 and for incoming first-time students.",
        "Gender",
        "according to IPEDS recommendations for reporting graduation and retention rates, with unknown gendered students added to the ‘Men’ category. For Application, Admit, Enrollment and DFW data, gender is reported as is.",
        "Under-represented minority status (URM)",
        "students who identify themselves as American Indian or Alaska Native, Black or African American, Hispanic/Latinx, or Native Hawaiian or Other Pacific Islander or a multi-race combination of any of these.",
        "Other minority status",
        "students who identify themselves as Asian or multi-race Asian/White.",
        "Non-URM status",
        "students who identify themselves as White.",
        "Pell status",
        "students who have received a Pell grant during their first term of enrollment at UIC.",
        "College at Entry",
        "the college in which students were admitted to during their first fall term. This is used to report student application and enrollment in the Access Dashboard and to report student retention and graduation rates in the Achievement Dashboard.",
        "Student College/Department",
        "the college/department students were enrolled in during a specific term of enrollment. This is used to report student DFW rates in the Achievement Dashboard.",
        "Course College/Department",
        "the college/department offering the course. This is used to report student DFW rates in the Achievement Dashboard.",
        "Graduation rates may vary slightly than historical reports. Starting in the fall of 2014, graduation rates were frozen. Therefore, prior to this, late degrees are included in the graduation counts.",
        "DFW data excludes satisfactory/unsatisfactory courses and credit/no credit course grades.",
        "Farrington, C.A., Roderick, M., Allensworth, E., Nagaoka, J., Keyes, T.S., Johnson, D.W., & Beechum, N.O. (2012). Teaching adolescents to become learners. The role of noncognitive factors in shaping school performance: A critical literature review. Chicago: University of Chicago Consortium on Chicago School Research.",
        "The Equity Dashboard compiles institutional data in an objective way and allows for reporting in disaggregation format. This format allows for comparison across various student characteristics or attributes. The Equity Dashboard is intended as a tool to assist in understanding where inequities exist.",
        "The Equity Dashboard does not provide ‘how’ or ‘why’ disparities in indicators exist, just that they exist. The Dashboard may prompt more detailed analysis of a particular indicator to better understand source of gaps.",
        "There are currently two primary sources of data:",
        "Access and Achievement data will be updated annually after Fall enrollment census.",
        "The Inclusion and Engagement components will be updated every two years (based on a biennial administration of the student survey).",
        "Access dashboards include undergraduate and graduate/professional level data.",
        "Achievement, Engagement, and Inclusion dashboard are predominantly undergraduate. Some versions of graduate/professional data will be added after the pilot year.",
        "None of the Equity Dashboards are currently publicly available. There is consideration for a ‘public’ version of the Dashboard to be made available at a later date.",
        "The data can be sorted by College of enrollment, gender, and race/ethnicity as reflected and available in the student record. A recoding of the race/ethnicity allows for a broader racial/ethnic sort of URM and Other Minority (see Data Dictionary for more information).",
        "For general information on the Equity Dashboard, contact Michelle Manno at mmanno2@uic.edu.",
        "To with with the Equity Dashboard implementation team, contact Amalia Pallares at amalia@uic.edu."
    ],
    "out_links": [
        "https://diversity.uic.edu/",
        "http://uic.edu/",
        "https://diversity.uic.edu/about/",
        "https://diversity.uic.edu/about/diversity-strategic-plan/",
        "https://diversity.uic.edu/about/awards/",
        "https://diversity.uic.edu/about/leadership/",
        "https://diversity.uic.edu/about/staff/",
        "https://diversity.uic.edu/about/contact-us/",
        "https://diversity.uic.edu/engagement/",
        "https://diversity.uic.edu/engagement/ccusc/",
        "https://diversity.uic.edu/engagement/diversity-education/",
        "https://diversity.uic.edu/engagement/committees/",
        "https://diversity.uic.edu/engagement/dialogue-initiative/",
        "https://diversity.uic.edu/engagement/multi-cultural-scholars-community/",
        "https://diversity.uic.edu/engagement/student-inclusion/",
        "https://diversity.uic.edu/engagement/stride/",
        "https://diversity.uic.edu/yldf/",
        "https://diversity.uic.edu/singing-from-balconies-covid-19-quarantine-testimonials/",
        "https://diversity.uic.edu/news/",
        "https://diversity.uic.edu/news/join-our-mailing-list/",
        "https://diversity.uic.edu/events-2/",
        "https://diversity.uic.edu/data/",
        "https://diversity.uic.edu/data/research/",
        "https://diversity.uic.edu/resources/",
        "https://diversity.uic.edu/resources/external-resources/",
        "https://diversity.uic.edu/diversitytownhalls/",
        "https://diversity.uic.edu/engagement/student-inclusion/undocumented-student-support/",
        "https://diversity.uic.edu/donate/",
        "http://chancellor.uic.edu/",
        "http://provost.uic.edu/",
        "http://maps.uic.edu/",
        "https://diversity.uic.edu/data/equity-dashboard/access-dashboard/",
        "https://diversity.uic.edu/data/equity-dashboard/achievement-dashboard/",
        "https://diversity.uic.edu/data/equity-dashboard/engagement-and-inclusion-dashboard/",
        "http://go.uic.edu/uicare",
        "http://dos.uic.edu/",
        "http://counseling.uic.edu/",
        "http://oae.uic.edu/",
        "http://dream.uic.edu/",
        "http://ois.uic.edu/",
        "http://ask.uic.edu/",
        "http://policies.uic.edu/uic-policy-library/access-and-equity/nondiscrimination-policy-statement/",
        "https://diversity.uic.edu/donate/donate-to-diversity/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}