{
    "url": "https://slce.uic.edu/leadership/ignite/",
    "title": "Ignite | Student Leadership and Civic Engagement | University of Illinois at Chicago",
    "text": [
        "An Exploring Leaders Program",
        "Ignite supports UIC students as they begin to navigate and explore the concepts of leadership and self-reflection. By examining themselves in the role of a leader, participants recognize key identities, values, and issues that matter to them. Throughout the program, students discover the variety of involvement opportunities that exist on- and off-campus and gain the skills needed to pursue positive change.",
        "Learn about the Ignite Experience:",
        "Who is Ignite for?",
        "Ignite is for students who are just beginning their leadership development journey. If you are new to UIC and/or looking for ways to grow as a leader on-campus and in the community, then this is for you!",
        "What’s the time commitment for the program?",
        "Ignite meets once a week, for 6 weeks during both the Fall and Spring semesters. Please be aware that all weekly sessions last for 2 hours and require your attendance.",
        "How is Ignite different than other leadership programs?",
        "Ignite is framed through the individual. Meaning, students who participate in Ignite will be given the room to explore themselves independently, while gaining the foundational skills needed to lead and deliver positive change at UIC or the greater community. Ignite exposes participants to the various resources, student organizations, and outside groups in which can further their involvement – charging them to discover their roles within these respective groups.",
        "How will my time be spent during Ignite?",
        "Ignite, utilizing the entirety of the two-hour sessions, is comprised of engaging activities and reflective conversations. From creative exercises to individualized brainstorming, Ignite serves to cater all exploring leaders.",
        "Upon completion of the program, students will feel better connected with the UIC community, have a better sense of their personal goals, and become a change agent for the future.",
        "",
        "The Spring 2020 run of the Ignite: Exploring Leaders Program ran February 11, 2020 and ended March 17, 2020.",
        "Looking to be a Student Mentor ? Applications for the next group of Ignite mentors will be posted here when open.",
        "Looking to Participate? Applications for the next Ignite program will be posted here when open.",
        "“Ignite solidified that leadership qualities can be evoked from almost anyone when given the confidence and appropriate opportunities to do so. Mentoring through Ignite gave me a sense of purpose on campus, ended my hiatus from leadership, and connected me with inspiring individuals.”",
        "“Working together with my younger peers has allowed me to grow as an individual. They challenge my old way of thinking, and I’ve learned to include everyone in the conversation and not just those I’m comfortable with.”",
        "“Being inspired by Student Leadership and Civic Engagement, and especially Ignite, I am now developing my own lead & serve program back in Vietnam. Moreover, GROWING TOGETHER through Ignite is what I have always felt thankful for!”",
        "“Because I was an immigrant and struggled through college, I chose to help students in similar situations so they could have a better experience than I had.”",
        "“When I was a participant in Ignite, it allowed me to get better connected to UIC, make new friends, gain life skills, and ultimately led to me making an impact at UIC. As a peer facilitator for Ignite, I give back and practice leadership by aiding with teaching and debriefing the curriculum. This opportunity was phenomenal and I recommend everyone be involved with Ignite!”",
        "“While my passion lies in the fields of medicine and mathematics, I give back through this Ignite leadership role by sharing what I’ve learned about building leadership skills, time management, project development, and other transferable skills.”",
        "“I want to give back to students because I never had guidance when I began college. I believe my leadership role can be effective because I am helping the students I work with discover their own passions, goals and values.”"
    ],
    "out_links": [
        "https://slce.uic.edu/",
        "http://uic.edu/",
        "https://slce.uic.edu/leadership/",
        "https://slce.uic.edu/leadership/forge/",
        "https://slce.uic.edu/leadership/flashpoint/",
        "https://slce.uic.edu/leadership/leadershipuic/",
        "https://slce.uic.edu/leadership/institute/",
        "https://slce.uic.edu/leadership/leadership-book-club/",
        "https://slce.uic.edu/leadership/workshops/",
        "https://slce.uic.edu/leadership-service-and-civic-engagement-at-home/",
        "https://slce.uic.edu/leadership/awards/",
        "https://slce.uic.edu/service/",
        "https://slce.uic.edu/service/service-leaders/",
        "https://slce.uic.edu/service/welcome/",
        "https://slce.uic.edu/service/mondays/",
        "https://slce.uic.edu/service/give/",
        "https://slce.uic.edu/service/mlk-day-service/",
        "https://slce.uic.edu/service/uic-day/",
        "https://slce.uic.edu/service/expo/",
        "https://slce.uic.edu/service/president/",
        "https://slce.uic.edu/service/hours/",
        "https://slce.uic.edu/service/post-an-opportunity/",
        "https://slce.uic.edu/civic-engagement/",
        "https://slce.uic.edu/civic-engagement/registration/",
        "https://slce.uic.edu/civic-engagement/education/",
        "https://slce.uic.edu/civic-engagement/participation/",
        "https://slce.uic.edu/civic-engagement/results/",
        "https://slce.uic.edu/about/",
        "https://slce.uic.edu/about/staff-directory/",
        "https://slce.uic.edu/about/contact/",
        "https://slce.uic.edu/about/donate/",
        "https://slce.uic.edu/about/feedback-suggestions/",
        "http://service.uic.edu/",
        "http://connect.uic.edu/",
        "http://involvement.uic.edu/",
        "https://vcsa.uic.edu/",
        "http://maps.uic.edu/",
        "http://clce.uic.edu/about/donate/",
        "https://slce.uic.edu/events/",
        "http://vote.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}