{
    "url": "https://diversity.uic.edu/news-stories/quarantine-life-motherhood/",
    "title": "Quarantine Life - Motherhood | Office of the Vice Provost for Diversity | University of Illinois at Chicago",
    "text": [
        "In a society where moms are complaining online about their kids and how “they are done…PERIOD!”, I feel the complete opposite. As a wife, mother, educator and graduate student, pre-pandemic, my life was full from 4 a.m. – 9 p.m. with little breaks in between. Working six days a week along with my other responsibilities I had no time to be one of the most important things…. a mom. It was the way of the world for working women, expected to be at the top of our game in EVERY area of our lives. Realistically, something has to give and for me, it was time with my 5-year old daughter.",
        "The first day schools were closed, March 16th, my daughter awoke, ready to get dressed for school. We sat on the couch and I explained to her for the next several weeks we would be having school at home, because there’s a dangerous germ outside and we don’t want to get it. She looked at me with her round, bright eyes, leaned over and said, “Mommy, I’m happy to be home with you.” I squeezed her and with a tear in my eye, I responded, I’m happy to be here with you too.",
        "Since then, we’ve done ALL sorts of things. Things I kept pushing off, things I wouldn’t have gotten around to because I was “busy”. Daily, we pray. It sounds small, but my daughter didn’t know how to pray. She never saw or heard me really pray. I did in private, but not much with her. This, I said to myself, will be part of her quarantine training. Everyday she picks our worship music or scripture. We dance around the house, I explain a verse or two to her and we pray. Her prayers started off as SCREAMS! “God, why won’t people listen to the Governor?! Why won’t people stay home?!!” A month later, and she’s no longer screaming, but praying for a kitten.",
        "We’ve enjoyed walking, she’s learning how to ride a bike and play Monopoly! I tell you, kids can be such sore losers. I won the money in Free Parking and she cried, like crocodile tears cried. It wouldn’t be the last time either. When I told her school would be at home for the remainder of the year, she laid on me and cried. When I told her that she wouldn’t be going to summer camp she crawled in my lap and cried. Being the only child can be hard. She sorely misses her friends.",
        "In our “new reality” of social distancing, I’ve become more than a mom; I’m now her teacher and playmate. She fully expects me to travel to places unknown as we play with her dolls and action figures. Their favorite places are castles and space. Despite the occasional tears, from the both of us, we’re learning how to live in our new normal, where Facetime and drive-by hellos are in order.",
        "For some, this pandemic is the worst and for those who have experienced loss, my heart goes out to them. However, I view this time as a miracle. It’s a miracle I get to watch my daughter develop and grow. It’s a miracle we get to laugh and play. This miracle has given me hope. I know our world will be a better place because I’m working on our future right now, my daughter.",
        "",
        "— Aisha Scott, Student"
    ],
    "out_links": [
        "https://diversity.uic.edu/",
        "http://uic.edu/",
        "https://diversity.uic.edu/about/",
        "https://diversity.uic.edu/about/diversity-strategic-plan/",
        "https://diversity.uic.edu/about/awards/",
        "https://diversity.uic.edu/about/leadership/",
        "https://diversity.uic.edu/about/staff/",
        "https://diversity.uic.edu/about/contact-us/",
        "https://diversity.uic.edu/engagement/",
        "https://diversity.uic.edu/engagement/ccusc/",
        "https://diversity.uic.edu/engagement/diversity-education/",
        "https://diversity.uic.edu/engagement/committees/",
        "https://diversity.uic.edu/engagement/dialogue-initiative/",
        "https://diversity.uic.edu/engagement/multi-cultural-scholars-community/",
        "https://diversity.uic.edu/engagement/student-inclusion/",
        "https://diversity.uic.edu/engagement/stride/",
        "https://diversity.uic.edu/yldf/",
        "https://diversity.uic.edu/singing-from-balconies-covid-19-quarantine-testimonials/",
        "https://diversity.uic.edu/news/",
        "https://diversity.uic.edu/news/join-our-mailing-list/",
        "https://diversity.uic.edu/events-2/",
        "https://diversity.uic.edu/data/",
        "https://diversity.uic.edu/data/research/",
        "https://diversity.uic.edu/data/equity-dashboard/",
        "https://diversity.uic.edu/resources/",
        "https://diversity.uic.edu/resources/external-resources/",
        "https://diversity.uic.edu/diversitytownhalls/",
        "https://diversity.uic.edu/engagement/student-inclusion/undocumented-student-support/",
        "https://diversity.uic.edu/donate/",
        "http://chancellor.uic.edu/",
        "http://provost.uic.edu/",
        "http://maps.uic.edu/",
        "http://go.uic.edu/uicare",
        "http://dos.uic.edu/",
        "http://counseling.uic.edu/",
        "http://oae.uic.edu/",
        "http://dream.uic.edu/",
        "http://ois.uic.edu/",
        "http://ask.uic.edu/",
        "http://policies.uic.edu/uic-policy-library/access-and-equity/nondiscrimination-policy-statement/",
        "https://diversity.uic.edu/donate/donate-to-diversity/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}