{
    "url": "https://diversity.uic.edu/news-stories/home-bittersweet-home/",
    "title": "Home Bittersweet Home | Office of the Vice Provost for Diversity | University of Illinois at Chicago",
    "text": [
        "It has been roughly four weeks now that we are in this stay-at-home order for basically the whole world and I am not sure how to feel about it. On the one side, I absolutely love staying home and being to do all my work from home and be able to skip my 2 hours commute every day. This whole situation is like a surprise vacation for a lot of people even if some of these people may not want it. While on the other hand, I miss going to class and meeting with my friends to study every day and being able to work on my research in the lab.",
        "I do not think I am the right person to be asking how I am affected by the order because I work with two different professors on research and one of them can be done from home which doesn’t prohibit me from doing what I would normally do. I also was fortunate enough to be able to work from home and not have to worry about the loss of wages or increase my risk to contracting the COVID-19 virus. Other than my one organic chemistry research lab, I am still able to do all my work regardless of me being at home.",
        "For me this stay home order is nice, and I would not mind going for another month or two. I may be enjoying this, but I know everyone else may not and I can say my mom is one of those people. This shelter in place order has caused her to be laid off temporarily because her job is considered non-essential because of all the high schools being shut down. She enjoys spending time at home just like I do but she definitely doesn’t enjoy spending this much time at home. She would prefer to be working because she gets too bored too easily.",
        "I do not believe I have any current struggles or fears, but this doesn’t mean something will occur down the line. I am just hoping we can see a swift end to this entire pandemic and a return to regularity. I would say I just hope this situation does not take a turn for the worst and we end up quarantined for potentially a year or longer. This entire experienced is for sure odd and I have never experienced anything like it.",
        "In terms of me being affected and changed, I would say I am going to come out the same person I was when this entire thing started. I would say the same thing for our campus, I do not see much change happening other than maybe a high regard for sanitation and cleanliness. In terms of society or the entire world, I do not see much happening either other than an increase in racist remarks towards Asian Americans because it’s their “fault” for causing this virus. We will continue to see the ignorance towards these groups of individuals and this scenario will only be a catalysis for these remarks.",
        "",
        "–Ahmad Almanasra, Student"
    ],
    "out_links": [
        "https://diversity.uic.edu/",
        "http://uic.edu/",
        "https://diversity.uic.edu/about/",
        "https://diversity.uic.edu/about/diversity-strategic-plan/",
        "https://diversity.uic.edu/about/awards/",
        "https://diversity.uic.edu/about/leadership/",
        "https://diversity.uic.edu/about/staff/",
        "https://diversity.uic.edu/about/contact-us/",
        "https://diversity.uic.edu/engagement/",
        "https://diversity.uic.edu/engagement/ccusc/",
        "https://diversity.uic.edu/engagement/diversity-education/",
        "https://diversity.uic.edu/engagement/committees/",
        "https://diversity.uic.edu/engagement/dialogue-initiative/",
        "https://diversity.uic.edu/engagement/multi-cultural-scholars-community/",
        "https://diversity.uic.edu/engagement/student-inclusion/",
        "https://diversity.uic.edu/engagement/stride/",
        "https://diversity.uic.edu/yldf/",
        "https://diversity.uic.edu/singing-from-balconies-covid-19-quarantine-testimonials/",
        "https://diversity.uic.edu/news/",
        "https://diversity.uic.edu/news/join-our-mailing-list/",
        "https://diversity.uic.edu/events-2/",
        "https://diversity.uic.edu/data/",
        "https://diversity.uic.edu/data/research/",
        "https://diversity.uic.edu/data/equity-dashboard/",
        "https://diversity.uic.edu/resources/",
        "https://diversity.uic.edu/resources/external-resources/",
        "https://diversity.uic.edu/diversitytownhalls/",
        "https://diversity.uic.edu/engagement/student-inclusion/undocumented-student-support/",
        "https://diversity.uic.edu/donate/",
        "http://chancellor.uic.edu/",
        "http://provost.uic.edu/",
        "http://maps.uic.edu/",
        "http://go.uic.edu/uicare",
        "http://dos.uic.edu/",
        "http://counseling.uic.edu/",
        "http://oae.uic.edu/",
        "http://dream.uic.edu/",
        "http://ois.uic.edu/",
        "http://ask.uic.edu/",
        "http://policies.uic.edu/uic-policy-library/access-and-equity/nondiscrimination-policy-statement/",
        "https://diversity.uic.edu/donate/donate-to-diversity/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}