{
    "url": "https://diversity.uic.edu/news-stories/culture-clash/",
    "title": "Culture Clash | Office of the Vice Provost for Diversity | University of Illinois at Chicago",
    "text": [
        "Transitioning to online school has had quite a big impact on the way I approach school. I know that I am still required to finish my assignments and take tests, but it honestly feels like school is not my main focus. Being at home puts me in the mindset that I am on break. I always talk about this feeling of coming home with my friends. We all agree that even though there is no place like home, it’s hard at times to stay in our suburban homes when we all love the energy of Chicago. Being at home kind of makes me revert back to the pre-UIC version of myself that I have been trying to grow out of since I started college.",
        "I have honestly been struggling to adjust my daily routine because now class is on my computer and I can literally wake up one minute before it starts without being late (which is not good for me, who likes to sleep). When I was on campus, I still had this problem of oversleeping, but now it has just become emphasized. I also miss having a good study environment. Studying in my room is not ideal for me, especially since it is kind of messy, but now I have to put in the work to make this a zone where I focus on school. I would prefer to study in a library or some other space that is not my house, but that is not an option in these times and this has been an interesting challenge for me to adjust to. One of my fears is that this will have a negative impact on my performance on my finals.",
        "Another thing I miss is how I used to walk so much around campus. Now, most of my physical activity has been reduced to just me walking my dog every day around my neighborhood. I miss seeing my friends in person, being able to sit and study with them, and just waving to others around campus. It has been a challenge to keep in touch with people, especially since I’m bad at texting in the first place. But me and my friends are all trying our hardest to make time to call each other and use FaceTime or Zoom! The Nintendo Switch game Animal Crossing has also become a hit with everyone. I think it came at such a perfect time because now we can at least hang out with each other and go places virtually. Many of my friends are saddened about important events being cancelled such as concerts and even graduations. I feel so sad for the seniors that have to celebrate these momentous occasions in a completely unexpected way, but I know all of these efforts to stop the spread of the virus will pay off.",
        "I’m sure that after this experience, all of us will value the moments we spend with our loved ones so much more. Shaking peoples hands and giving your friends hugs will have a whole new significance once we are able to gather again. We can overcome this together and hopefully soon!"
    ],
    "out_links": [
        "https://diversity.uic.edu/",
        "http://uic.edu/",
        "https://diversity.uic.edu/about/",
        "https://diversity.uic.edu/about/diversity-strategic-plan/",
        "https://diversity.uic.edu/about/awards/",
        "https://diversity.uic.edu/about/leadership/",
        "https://diversity.uic.edu/about/staff/",
        "https://diversity.uic.edu/about/contact-us/",
        "https://diversity.uic.edu/engagement/",
        "https://diversity.uic.edu/engagement/ccusc/",
        "https://diversity.uic.edu/engagement/diversity-education/",
        "https://diversity.uic.edu/engagement/committees/",
        "https://diversity.uic.edu/engagement/dialogue-initiative/",
        "https://diversity.uic.edu/engagement/multi-cultural-scholars-community/",
        "https://diversity.uic.edu/engagement/student-inclusion/",
        "https://diversity.uic.edu/engagement/stride/",
        "https://diversity.uic.edu/yldf/",
        "https://diversity.uic.edu/singing-from-balconies-covid-19-quarantine-testimonials/",
        "https://diversity.uic.edu/news/",
        "https://diversity.uic.edu/news/join-our-mailing-list/",
        "https://diversity.uic.edu/events-2/",
        "https://diversity.uic.edu/data/",
        "https://diversity.uic.edu/data/research/",
        "https://diversity.uic.edu/data/equity-dashboard/",
        "https://diversity.uic.edu/resources/",
        "https://diversity.uic.edu/resources/external-resources/",
        "https://diversity.uic.edu/diversitytownhalls/",
        "https://diversity.uic.edu/engagement/student-inclusion/undocumented-student-support/",
        "https://diversity.uic.edu/donate/",
        "http://chancellor.uic.edu/",
        "http://provost.uic.edu/",
        "http://maps.uic.edu/",
        "http://go.uic.edu/uicare",
        "http://dos.uic.edu/",
        "http://counseling.uic.edu/",
        "http://oae.uic.edu/",
        "http://dream.uic.edu/",
        "http://ois.uic.edu/",
        "http://ask.uic.edu/",
        "http://policies.uic.edu/uic-policy-library/access-and-equity/nondiscrimination-policy-statement/",
        "https://diversity.uic.edu/donate/donate-to-diversity/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}