{
    "url": "https://slce.uic.edu/leadership/leadershipuic/",
    "title": "LeadershipUIC | Student Leadership and Civic Engagement | University of Illinois at Chicago",
    "text": [
        "A Transformative Leaders Program",
        "LeadershipUIC is the pinnacle leadership capstone experience for students on-campus. Throughout the program, participants receive coaching from prominent community and business leaders and work collaboratively to find solutions to a current problem that exists around them. By clarifying their mission, vision, values, along with their own definition of leadership, this capstone experience allows students to reflect on their journey from exploring leaders to transformed leaders, while giving them the opportunity to craft a project portfolio that they can use as they begin to search for careers and other leadership positions.",
        "Learn about the LeadershipUIC Experience:",
        "Who is LeadershipUIC for?",
        "LeadershipUIC is exclusive to UIC students entering their final year at the university. These students must have two semesters of coursework remaining and have shown their commitment to being an engaged leader on-campus and in the community. Ideally, LeadershipUIC applicants are apart of a student organization, are a student employee, hold another leadership position, and/or have participated in one of SLCE’s other leadership development offerings.",
        "What’s the time commitment for the program?",
        "LeadershipUIC is a yearlong commitment. Beginning with an hour long orientation session taking place August 2019, followed by once-a-month sessions that take place from 12-3pm at an off-campus location. More information regarding tentatively-scheduled sessions can be found in the LeadershipUIC application.",
        "How is LeadershipUIC different than other leadership programs?",
        "LeadershipUIC is guided by the Leadership Practices Inventory 360 assessment, which allows participants to identify the frequency of their personal leadership behaviors, while experimenting with innovative ideas and learning from their accompanying mistakes. Through the real world application of improvisation and critical thinking, participants gain a better sense of how to model the way, inspire a shared vision, challenge the process, enable others to act, and encourage the heart while they serve in their respective roles. LeadershipUIC offers students one of the greatest returns on their investment – the ability to impact others in a positive way.",
        "How will my time be spent during LeadershipUIC?",
        "All sessions of LeadershipUIC take place off-campus at our partner sites. Participants will have the opportunity to meet with and listen from community and business leaders in the fields of education, healthcare, policy, and the arts. Throughout the program, students work on an assigned project and reflect on their undergraduate experience, while connecting it all to life after UIC.",
        "Upon the completion of the program, students will have a better understanding of how to apply their UIC Experience to their lives after UIC. Utilizing their enhanced creative and adaptive leadership skills, these students will be well fit to manage any task or project that is thrown at them!",
        "Check back for information about applying to join for the 2020-2021 academic year near the end of the Spring 2020 semester.",
        "“This experience has taught me that all students have a voice and can truly make a difference in their community if they make that voice heard. It has also taught me the power in diversity and though it is great to find pride and identity in your own culture, we can all gain a deeper and meaningful perspective if we connect with those from different walks of life.”"
    ],
    "out_links": [
        "https://slce.uic.edu/",
        "http://uic.edu/",
        "https://slce.uic.edu/leadership/",
        "https://slce.uic.edu/leadership/ignite/",
        "https://slce.uic.edu/leadership/forge/",
        "https://slce.uic.edu/leadership/flashpoint/",
        "https://slce.uic.edu/leadership/institute/",
        "https://slce.uic.edu/leadership/leadership-book-club/",
        "https://slce.uic.edu/leadership/workshops/",
        "https://slce.uic.edu/leadership-service-and-civic-engagement-at-home/",
        "https://slce.uic.edu/leadership/awards/",
        "https://slce.uic.edu/service/",
        "https://slce.uic.edu/service/service-leaders/",
        "https://slce.uic.edu/service/welcome/",
        "https://slce.uic.edu/service/mondays/",
        "https://slce.uic.edu/service/give/",
        "https://slce.uic.edu/service/mlk-day-service/",
        "https://slce.uic.edu/service/uic-day/",
        "https://slce.uic.edu/service/expo/",
        "https://slce.uic.edu/service/president/",
        "https://slce.uic.edu/service/hours/",
        "https://slce.uic.edu/service/post-an-opportunity/",
        "https://slce.uic.edu/civic-engagement/",
        "https://slce.uic.edu/civic-engagement/registration/",
        "https://slce.uic.edu/civic-engagement/education/",
        "https://slce.uic.edu/civic-engagement/participation/",
        "https://slce.uic.edu/civic-engagement/results/",
        "https://slce.uic.edu/about/",
        "https://slce.uic.edu/about/staff-directory/",
        "https://slce.uic.edu/about/contact/",
        "https://slce.uic.edu/about/donate/",
        "https://slce.uic.edu/about/feedback-suggestions/",
        "http://service.uic.edu/",
        "http://connect.uic.edu/",
        "http://involvement.uic.edu/",
        "https://vcsa.uic.edu/",
        "http://maps.uic.edu/",
        "http://clce.uic.edu/about/donate/",
        "https://slce.uic.edu/events/",
        "http://vote.uic.edu/",
        "https://uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://uic.edu/about/job-opportunities",
        "https://library.uic.edu/",
        "https://maps.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/"
    ]
}